**C               *>Natural Source Header 000000
**C               *:NatName ADVKUPRM
**C               *:UID IEN
**C               *:Mode S
**C               *:CP
**C               *:Date 20101115
**C               *:Time 0918040
**C               *<Natural Source Header
**DS                    1ADVKUPRM
**DF              N   5 2OG-ID
**DF              A   3 2VA-ID
**DF              N   8 2DT-ID
**DF              N11.4 2KU-VA
**DF              N 7.0 2EI-VA
