**C               *>Natural Source Header 000000
**C               *:NatName ASUMLCL
**C               *:UID SUSHICKA
**C               *:Mode S
**C               *:CP
**C               *:Date 20070319
**C               *:Time 1218330
**C               *<Natural Source Header
**DV          0        V1ASUM-SYS-FILE                   ASUM-SYS-FILE
**DD          0   N 5.0 2OG-F
**DD          0   A   2 2KK-F
**DD          0   N 5.0 2KD-F
