* >Natural Source Header 000000 /*<RO>>
* :NatName BATCH
* :UID ASA
* :Mode R
* :CP
* :Date 20010419
* :Time 2004330
* <Natural Source Header /*<<RO>
COMPRESS 'NATBAT' *USER 'CNATLIBM TESTGRMO R 1'
INTO #CMS(A70)
CALL 'CMS' #CMS
STOP
END
