* >Natural Source Header 000000 /*<RO>>
* :NatName BRWC
* :UID MSA
* :Mode S
* :CP
* :Date 20051210
* :Time 1609330
* <Natural Source Header /*<<RO>
  IF *PF-KEY = 'PF4' AND *OPSYS = SCAN 'CMS'
    STACK TOP COMMAND *PROGRAM
    STACK TOP COMMAND 'BRW'
    STOP
  END-IF
