* >Natural Source Header 000000 /*<RO>>
* :NatName BS15-5
* :UID MSA
* :Mode S
* :CP
* :Date 20071104
* :Time 1603330
* <Natural Source Header /*<<RO>
*
*  5-ÇÍÀ×ÍÛÉ Ñ×ÅÒ Â 15-ÇÍÀ×ÍÛÉ
*
DEFINE DATA
  PARAMETER USING BS5-15L
  LOCAL USING LCLBSL
  LOCAL
  1 KEYSS(A20)
  1 REDEFINE KEYSS
    2 KEYSSOG(N5)  2 KEYSSSS(A15)
END-DEFINE
BS5 := 0
KEYSSOG := OG5-15  KEYSSSS := BS15
FIND IBS-BS-FILE OG-SS15 = KEYSS
  BS5 := SS-ID
END-FIND
END
