**C               *>Natural Source Header 000000
**C               *:NatName BS5-15L
**C               *:UID MSA
**C               *:Mode S
**C               *:CP
**C               *:Date 20071104
**C               *:Time 1603330
**C               *<Natural Source Header
**DS          0         1BS5-15
**DK          0   N   5 2OG5-15
**DK          0   N   5 2BS5
**DK          0   A  15 2BS15
