* >Natural Source Header 000000 /*<RO>>
* :NatName CABICM0P
* :UID PAUL
* :Mode S
* :CP
* :Date 20100328
* :Time 2131330
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING CMBICM0A
LOCAL USING CDGNXM0L
END-DEFINE
SET CONTROL "M03"
SET CONTROL "M=RE"
FIND (1) CDGNXM0L WITH TYPE EQ 10 AND CODE EQ "1000"
  MOVE CDGNXM0L.RID TO CMBICM0A.RID
  MOVE 11 TO CMBICM0A.SUB-TYPE
  MOVE "EDIT" TO CMBICM0A.CMD
  PERFORM CMBICM0S XXERX00A CMBICM0A
END-FIND
END
