* >Natural Source Header 000000 /*<RO>>
* :NatName CCASKOG
* :UID IEN
* :Mode S
* :CP
* :Date 20001019
* :Time 1556330
* <Natural Source Header /*<<RO>
IF OG-IDENT-G = 0  SY-IDENT-G(1) := *PROGRAM
  CALLNAT 'SBSAYOG' SY-IDENT-G(1) ; STOP END-IF
 IF FUN-NM-G NE  ' '  SELREG := SELFUN SELFUN := FUN-NM-G
                 ELSE
                      SELREG := SELFUN
 END-IF
 CALLNAT 'SBCNTR40' SELREG ; CALLNAT 'SBCNTR60' SELFUN
 FUN-NM-G := SELFUN REG-NM-G := SELREG







