* >Natural Source Header 000000 /*<RO>>
* :NatName CCERPRC
* :UID IBS_8
* :Mode S
* :CP
* :Date 20000706
* :Time 1332330
* <Natural Source Header /*<<RO>
INPUT NO ERASE
 'ньхайю б лндске' *PROGRAM
 'мюфлхре дкъ опнднкфемхъ кчасч йкюбхьс'
