* >Natural Source Header 000000 /*<RO>>
* :NatName CCHELP
* :UID V
* :Mode S
* :CP
* :Date 20011017
* :Time 1441330
* <Natural Source Header /*<<RO>
PARMHELP.HSYSTEM  := 'CNATLIBM'
PARMHELP.NUMHELP  := &1&
CALLNAT 'SBTHELP' PARMHELP(AD=O)
