* >Natural Source Header 000000 /*<RO>>
* :NatName CCINITPR
* :UID NIMI1
* :Mode S
* :CP
* :Date 20000712
* :Time 1332330
* <Natural Source Header /*<<RO>
DEFINE WINDOW PROCESS_WINDOW
 SIZE 6*44
 BASE 8/22
 TITLE 'Oбpaбoткa бaзы дaнныx'
 CONTROL SCREEN
 FRAMED ON
 POSITION OFF
