* >Natural Source Header 000000 /*<RO>>
* :NatName CCMSG
* :UID IEN
* :Mode S
* :CP
* :Date 20001019
* :Time 1554330
* <Natural Source Header /*<<RO>
*COM := &1&
CALLNAT 'SBMSGGEN' ;
