* >Natural Source Header 000000 /*<RO>>
* :NatName CCPROCF
* :UID IEN
* :Mode S
* :CP
* :Date 20001019
* :Time 1300330
* <Natural Source Header /*<<RO>
IF SHOW_PROGRESS_BAR THEN
 KOLPR := *COUNTER * 40 / *NUMBER
 IF BREAK KOLPR
  IF KOLPR NE 0 THEN
   SET WINDOW 'PROCESS_WINDOW'
   SET CONTROL 'N'
   RESET CMD
   MOVE 'OOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO'
        TO SUBSTRING(CMD,1,KOLPR)
   INPUT USING MAP 'MAPCESSM'
   SET WINDOW OFF
  END-IF
 END-IF
END-IF
