* >Natural Source Header 000000 /*<RO>>
* :NatName CCRFUNNM
* :UID IBS_8
* :Mode S
* :CP
* :Date 20000717
* :Time 1106330
* <Natural Source Header /*<<RO>
FUN-NM-G := SELFUN
REG-NM-G := SELREG

