* >Natural Source Header 000000 /*<RO>>
* :NatName CCSETKEY
* :UID IBS_9
* :Mode S
* :CP
* :Date 19991101
* :Time 0946330
* <Natural Source Header /*<<RO>
SET KEY ENTR PF1 PF2 PF3 PF4 PF5 PF6 PF7 PF8 PF9 PF10 PF11 PF12

