* >Natural Source Header 000000 /*<RO>>
* :NatName CCUFRO50
* :UID IBS_8
* :Mode S
* :CP
* :Date 20000609
* :Time 1255330
* <Natural Source Header /*<<RO>
ASSIGN KEYOG1 = OG-IDENT-G
ASSIGN KEYOG2 = OG-IDENT-G
ASSIGN KEYOG3 = OG-IDENT-G
