* >Natural Source Header 000000 /*<RO>>
* :NatName CCUOR
* :UID IBS_8
* :Mode S
* :CP
* :Date 20000706
* :Time 1346330
* <Natural Source Header /*<<RO>
ASSIGN IBS-NAOR-FILE.UP-DT = *DATX
ASSIGN IBS-NAOR-FILE.UP-PG = *PROGRAM
ASSIGN IBS-NAOR-FILE.UP-ID = *INIT-ID
ASSIGN IBS-NAOR-FILE.UP-US = *INIT-USER
