* >Natural Source Header 000000 /*<RO>>
* :NatName CHECKERR
* :UID TIT_HOME
* :Mode S
* :CP
* :Date 19990117
* :Time 0832330
* <Natural Source Header /*<<RO>
 LCONVERT.ERROR := TRUE
 LCONVERT.ERROR_CODE := &1&
 ESCAPE ROUTINE
