* >Natural Source Header 000000 /*<RO>>
* :NatName CLOSPRN
* :UID MNN
* :Mode S
* :CP
* :Date 20050414
* :Time 1509330
* <Natural Source Header /*<<RO>
IF *OPSYS = 'Windows/' OR = 'WNT-X86'
  DEFINE PRINTER(1) OUTPUT 'LPT1' PROFILE 'S'
END-IF
CLOSE PRINTER(1)
