**C               *>Natural Source Header 000000
**C               *:NatName CPRDRL0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20100328
**C               *:Time 2106330
**C               *<Natural Source Header
**DS          0         1CPRDRL0A
**DK          0   A  15 2CMD
**DK          0   A  15 2CMD-EXIT
**DK          0   I   4 2RID
**DK          0   I   4 2UP-RID
