**C               *>Natural Source Header 000000
**C               *:NatName CPRLXP0A
**C               *:UID T_UPA
**C               *:Mode S
**C               *:CP
**C               *:Date 20100330
**C               *:Time 0959330
**C               *<Natural Source Header
**DS          0         1CPRLXP0A
**DK          0   A  15 2CMD
**DK          0   I   4 2RID
**DK          0   N   6 2PERIOD
