* >Natural Source Header 000000 /*<RO>>
* :NatName CVZKAC2S
* :UID T_UPA
* :Mode S
* :CP
* :Date 20100312
* :Time 1718330
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER
1 CVZKAC2A
2 AC-CODE     (N5)
2 ZK-CODE     (A9)
2 PO-CODE     (N5)
2 ST-CODE     (N5)
/*
LOCAL USING LCLZKL
LOCAL USING ASRZSYSL
/*
END-DEFINE
DEFINE SUBROUTINE CVZKAC2S

END-SUBROUTINE
END
