* >Natural Source Header 000000 /*<RO>>
* :NatName DEFPRBC
* :UID MSA
* :Mode S
* :CP
* :Date 20050411
* :Time 1642330
* <Natural Source Header /*<<RO>
CLOSE PRINTER(1)
FORMAT(1) PS=68 LS=132
IF POSIT = 1  CALL 'CMS' 'CP SPOOL P TO  *     P'  END-IF
IF POSIT = 2  CALL 'CMS' 'CP SPOOL P TO  NFTS1 R'  END-IF
