* >Natural Source Header 000000 /*<RO>>
* :NatName DEFREG
* :UID MSA
* :Mode S
* :CP
* :Date 20050408
* :Time 1425330
* <Natural Source Header /*<<RO>
#USG := 'IL'  #ORG := 1000  SYSTP := 'ADM'
PGMMENU := *PROGRAM
PERFORM DEFMENU PRMDEF
