* >Natural Source Header 000000 /*<RO>>
* :NatName EXEXCEL
* :UID INTECO
* :Mode S
* :CP
* :Date 20041208
* :Time 1458330
* <Natural Source Header /*<<RO>
CLOSE WORK &1&
RESET #COMMAND
#OPSYS := *OPSYS
IF #OPSYS NE 'W'
 COMPRESS 'EXECTASK EXCEL' #FPATH INTO #COMMAND
 DOWNLOAD PC &2& COMMAND #COMMAND
 ELSE
 CALLNAT 'DEF-PATH' OG-IDENT-G 'EXCEL   ' #COMMAND
 COMPRESS #COMMAND #FPATH INTO #COMMAND
 CALL 'WINCMD' #COMMAND
END-IF
