* >Natural Source Header 000000 /*<RO>>
* :NatName EXWORD
* :UID NATURAL
* :Mode S
* :CP
* :Date 20050411
* :Time 1633330
* <Natural Source Header /*<<RO>
CLOSE WORK &1&
RESET #COMMAND
#OPSYS := *OPSYS
IF #OPSYS NE 'W'
 COMPRESS 'EXECTASK MSWORD' #FPATH INTO #COMMAND
 DOWNLOAD PC &2& COMMAND #COMMAND
 ELSE
 CALLNAT 'DEF-PATH' OG-IDENT-G 'MSWORD  ' #COMMAND
 COMPRESS #COMMAND #FPATH INTO #COMMAND
 CALL 'WINCMD' #COMMAND
END-IF
