* >Natural Source Header 000000 /*<RO>>
* :NatName FER
* :UID NAT22602
* :Mode S
* :CP
* :Date 20050601
* :Time 1154330
* <Natural Source Header /*<<RO>
CALL 'CMS' 'CP SPOOL PRINT *'
END
