* >Natural Source Header 000000 /*<RO>>
* :NatName FILEPAT2
* :UID KSV
* :Mode R
* :CP
* :Date 20040907
* :Time 1714330
* <Natural Source Header /*<<RO>
#OPSYS := *OPSYS
RESET #COMMAND
IF #OPSYS NE 'W'
 COMPRESS 'SET PCFILE' &1& 'DOWN DATA' #COMMAND INTO #COMMAND
 COMPRESS  #COMMAND #FPATH INTO #COMMAND
DOWNLOAD PC &2& COMMAND #COMMAND
ELSE
 DEFINE WORK FILE &1& #FPATH
END-IF

