* >Natural Source Header 000000 /*<RO>>
* :NatName FILEPATH
* :UID SUSHICKA
* :Mode R
* :CP
* :Date 20070510
* :Time 1052330
* <Natural Source Header /*<<RO>
#OPSYS := *OPSYS
RESET #COMMAND
IF #OPSYS NE 'W'
 COMPRESS 'SET PCFILE' &1& 'DOWN DATA' #COMMAND INTO #COMMAND
 COMPRESS  #COMMAND #FPATH INTO #COMMAND
 DOWNLOAD PC &2& COMMAND #COMMAND
END-IF

