* >Natural Source Header 000000 /*<RO>>
* :NatName GETNMVO
* :UID MSA
* :Mode S
* :CP
* :Date 20080406
* :Time 1753330
* <Natural Source Header /*<<RO>
* Õ¿»Ã≈ÕŒ¬¿Õ»≈ Œ–√¿Õ»«¿÷»»
DEFINE DATA
  PARAMETER
  1 #OG(N5)
  1 #VO(N5)
  1 #NM(A50)
  LOCAL USING LCLVOL
  LOCAL
  1 KEYVO(A10)
  1 REDEFINE KEYVO
    2 KEYPOOG(N5)
    2 KEYPOVO(N5)
END-DEFINE
*
RESET #NM
KEYPOOG := #OG  KEYPOVO := #VO
FIND IBS-KVO-FILE OG-VO = KEYVO
  #NM := NM-OG
END-FIND
END
