* >Natural Source Header 000000 /*<RO>>
* :NatName GETNMPO
* :UID MSA
* :Mode S
* :CP
* :Date 20050220
* :Time 1159330
* <Natural Source Header /*<<RO>
* мюхлемнбюмхе ондпюгдекемхъ
DEFINE DATA
  PARAMETER
  1 #OG(N5)
  1 #PO(N5)
  1 #NM(A50)
  LOCAL USING LCLPOL
  LOCAL
  1 KEYPO(A10)
  1 REDEFINE KEYPO
    2 KEYPOOG(N5)
    2 KEYPOPO(N5)
END-DEFINE
*
RESET #NM
KEYPOOG := #OG  KEYPOPO := #PO
FIND IBS-KPO-FILE OG-PD = KEYPO
  #NM := NM-PD
END-FIND
END
