* >Natural Source Header 000000 /*<RO>>
* :NatName GETNMSS
* :UID MSA
* :Mode S
* :CP
* :Date 20050225
* :Time 1230330
* <Natural Source Header /*<<RO>
* мюхлемнбюмхе ясаяверю
DEFINE DATA
  PARAMETER
  1 #OG(N5)
  1 #PO(N5)
  1 #NM(A50)
  LOCAL USING LCLBSL
  LOCAL
  1 KEYPO(A10)
  1 REDEFINE KEYPO
    2 KEYPOOG(N5)
    2 KEYPOPO(N5)
END-DEFINE
*
RESET #NM
KEYPOOG := #OG  KEYPOPO := #PO
FIND IBS-BS-FILE OG-SS = KEYPO
  #NM := NM-BS
END-FIND
END
