* >Natural Source Header 000000 /*<RO>>
* :NatName GETNMTN
* :UID MSA
* :Mode S
* :CP
* :Date 20050220
* :Time 1209330
* <Natural Source Header /*<<RO>
* ‘¿Ã»À»ﬂ
DEFINE DATA
  PARAMETER
  1 #OG(N5)
  1 #VO(N5)
  1 #NM(A50)
  LOCAL USING LCLASRZ
END-DEFINE
*
RESET #NM
FIND ASRZ-LS-FILE TN-F = #VO
  COMPRESS FA-F #IM #OT INTO #NM
END-FIND
END
