**C               *>Natural Source Header 000000
**C               *:NatName GLL
**C               *:UID MSA
**C               *:Mode S
**C               *:CP
**C               *:Date 20050123
**C               *:Time 1346330
**C               *<Natural Source Header
**DF          0   A  60 1SYS-NM-G
**DF          0   A  60 1FUN-NM-G
**DF          0   A  40 1REG-NM-G
