**C               *>Natural Source Header 000000
**C               *:NatName HLPST
**C               *:UID MSA
**C               *:Mode R
**C               *:CP
**C               *:Date 20100101
**C               *:Time 2220330
**C               *<Natural Source Header
**DS          0         1HLPST
**DK          0   N   5 2OGST
**DK          0   A   5 2SHST
**DK          0   N   6 2CDST
**DK          0   A  30 2NMST
