**C               *>Natural Source Header 000000
**C               *:NatName LCLADSSY
**C               *:UID TIROD
**C               *:Mode S
**C               *:CP
**C               *:Date 20090831
**C               *:Time 1032330
**C               *<Natural Source Header
**DV          0        V1ADS-SYS-FILE                    ADS-SYS-FILE
**DD          0   N 5.0 2OG-ID
**DD          0   A   3 2KK-F
**DD          0   I   4 2NN-F
