**C               *>Natural Source Header 000000
**C               *:NatName LCLKGPL
**C               *:UID IBS_8
**C               *:Mode S
**C               *:CP
**C               *:Date 20000705
**C               *:Time 1634330
**C               *<Natural Source Header
**DV          0000     V1IBS-KGP-FILE                    IBS-SYS-FILE
**DD          0000N 5.0 2OG-ID
**DD          0000A  80 2NM-PD
**DD          0000N 5.0 2GP-ID
