**C               *>Natural Source Header 000000
**C               *:NatName LCLNAUL
**C               *:UID IBS_8
**C               *:Mode S
**C               *:CP
**C               *:Date 20000706
**C               *:Time 1432330
**C               *<Natural Source Header
**DV          0000     V1IBS-NAUS-FILE                   IBS-SYS-FILE
**DD I1 C     0000A   8M2SY-ID                           (1:10) /* DEF. FROM PREDICT
