**C               *>Natural Source Header 000000
**C               *:NatName LCLPLL
**C               *:UID IBS_8
**C               *:Mode S
**C               *:CP
**C               *:Date 20000705
**C               *:Time 1633330
**C               *<Natural Source Header
**DV          0000     V1IBS-KPL-FILE                    IBS-SYS-FILE
**DD          0000N 5.0 2OG-ID
**DD          0000N 5.0 2PL-ID
**DD          0000A  80 2NM-PL
**DD          0000N 5.0 2PO-ID
