**C               *>Natural Source Header 000000
**C               *:NatName LCLSTKDF
**C               *:UID IBS_8
**C               *:Mode S
**C               *:CP
**C               *:Date 20001016
**C               *:Time 1044330
**C               *<Natural Source Header
**DF          0000I   4 1I_RELOADST
**DF          0000I   4 1N_RELOADST
**DF          0000B   4 1C-DATA-B
