**C               *>Natural Source Header 000000
**C               *:NatName LCLSTAKD
**C               *:UID IBS_8
**C               *:Mode S
**C               *:CP
**C               *:Date 20001017
**C               *:Time 1512330
**C               *<Natural Source Header
**DF          0000I   4 1I_RELOADST
**DF          0000I   4 1N_RELOADST
