* >Natural Source Header 000000 /*<RO>>
* :NatName MESSAGE
* :UID UOCNEW
* :Mode R
* :CP
* :Date 20020104
* :Time 1903330
* <Natural Source Header /*<<RO>
*COM := &1&
CALLNAT 'MESSAGEN' ;
