* >Natural Source Header 000000 /*<RO>>
* :NatName NAVOI
* :UID NAT22606
* :Mode S
* :CP
* :Date 20050221
* :Time 1257330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL
  1 IKD(N5) 1 T70(A70)
END-DEFINE
CALLNAT 'SNAVOI' IKD T70 'W'
END
