* >Natural Source Header 000000 /*<RO>>
* :NatName NAVOR0
* :UID MSA
* :Mode S
* :CP
* :Date 20050411
* :Time 1402330
* <Natural Source Header /*<<RO>
*************************************
* опнцпюллю бедемхъ окюмю явернб лт *
*************************************
DEFINE DATA
LOCAL USING PRMNAV       /* наыюъ оюпюлерпхвеяйюъ накюярэ ондопнцпюлл-тсмйжхи яхярелш
END-DEFINE
NAV_OG-IDENT-G := 1000
CALLNAT 'SNAVOR' PRMNAV
END
