* >Natural Source Header 000000 /*<RO>>
* :NatName NAVPSW
* :UID T_MSA
* :Mode S
* :CP
* :Date 20100318
* :Time 1218330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL USING PSWPRM
END-DEFINE
SYST := 'PPD'  ORG := 1000
PERFORM SNAVPSW SKEY
END
