* >Natural Source Header 000000 /*<RO>>
* :NatName NAVRT
* :UID MSA
* :Mode S
* :CP
* :Date 20050220
* :Time 1528330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL
  1 IKD(N5)
  1 T70(A70)
END-DEFINE
CALLNAT 'SNAVRT' IKD T70 'W'
END
