* >Natural Source Header 000000 /*<RO>>
* :NatName NAVSTR
* :UID MSA
* :Mode S
* :CP
* :Date 20050624
* :Time 1431330
* <Natural Source Header /*<<RO>
*************************************
* опнцпюллю бедемхъ окюмю явернб лт *
*************************************
DEFINE DATA
LOCAL USING PRMNAV       /* наыюъ оюпюлерпхвеяйюъ накюярэ ондопнцпюлл-тсмйжхи яхярелш
END-DEFINE
NAV_OG-IDENT-G := 1000  #RW := 'R'
CALLNAT 'SNAVZSTA' PRMNAV
END
