* >Natural Source Header 000000 /*<RO>>
* :NatName NAVST
* :UID MSA
* :Mode S
* :CP
* :Date 20050411
* :Time 1356330
* <Natural Source Header /*<<RO>
*************************************
* опнцпюллю бедемхъ окюмю явернб лт *
*************************************
DEFINE DATA
LOCAL USING PRMNAV       /* наыюъ оюпюлерпхвеяйюъ накюярэ ондопнцпюлл-тсмйжхи яхярелш
END-DEFINE
NAV_OG-IDENT-G := 1000
CALLNAT 'SNAVZSTA' PRMNAV
END
