* >Natural Source Header 000000 /*<RO>>
* :NatName NAVVO
* :UID MSA
* :Mode S
* :CP
* :Date 20050411
* :Time 1404330
* <Natural Source Header /*<<RO>
*************************************
* опнцпюллю бедемхъ окюмю явернб лт *
*************************************
DEFINE DATA
 LOCAL USING PR4NAVVO
END-DEFINE
  KODIF_VO.OG_ID_G := 1000
  CALLNAT 'SYSNAVO' KODIF_VO
END
