* >Natural Source Header 000000 /*<RO>>
* :NatName NAVVD
* :UID MSA
* :Mode S
* :CP
* :Date 20050220
* :Time 1543330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL
  1 IKD(N5) 1 T70(A70)
END-DEFINE
CALLNAT 'SNAVVD' IKD T70 'W'
END
