* >Natural Source Header 000000 /*<RO>>
* :NatName NP1
* :UID MSA
* :Mode S
* :CP
* :Date 20110403
* :Time 1252000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING AUUNXX0L
LOCAL
1 STR(A200)
END-DEFINE
FIND AU-UNIT UN-CODE = 1 THRU 999999
  STR := UN-NAME  CALLNAT 'UPCASE' STR  UN-NAME := STR
  UPDATE
  END TRANSACTION
END-FIND
END
