**C               *>Natural Source Header 000000
**C               *:NatName NPACS3SA
**C               *:UID PAUL
**C               *:Mode R
**C               *:CP
**C               *:Date 20080313
**C               *:Time 0502330
**C               *<Natural Source Header
**DS          0         1NPACS3SA
**DK          0   B   4 2STACK-NUMBER
**DK          0   I   4 2STACK-COUNT
**DK          0   I   4 2STACK-LEN
**DK          0   I   4 2STACK-ID
