**C               *>Natural Source Header 000000
**C               *:NatName NPAVND3A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20090323
**C               *:Time 0840330
**C               *<Natural Source Header
**DS          0         1NPAVND3A
**DK          0   N   6 2PRM-GM
**DK          0   N   5 2PRM-PROV
**DK          0   N   5 2PRM-AC
