**C               *>Natural Source Header 000000
**C               *:NatName NPAVS10A
**C               *:UID INTECO
**C               *:Mode R
**C               *:CP
**C               *:Date 20090323
**C               *:Time 0839330
**C               *<Natural Source Header
**DS          0         1NPAVS10A
**DK          0   B   4 2STACK-NUMBER
**DK          0   I   4 2STACK-COUNT
**DK          0   I   4 2STACK-LEN
**DK          0   I   4 2STACK-ID
