**C               *>Natural Source Header 000000
**C               *:NatName NPOCOR0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20090811
**C               *:Time 1411330
**C               *<Natural Source Header
**DS          0         1NPOCOR0A
**DK          0   B   4 2STACK-NUMBER
**DK          0   I   4 2STACK-COUNT
**DK          0   I   4 2STACK-LEN
**DK          0   I   4 2STACK-ID
