**C               *>Natural Source Header 000000
**C               *:NatName NPSP910A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20090323
**C               *:Time 0839330
**C               *<Natural Source Header
**DS          0         1NPSP910A
**DK          0   N   5 2OG-CODE
**DK          0   N   6 2GM-YYYYMM
**DK          0   N   5 2N-PROV
