**C               *>Natural Source Header 000000
**C               *:NatName NPXXANSA
**C               *:UID PAUL
**C               *:Mode R
**C               *:CP
**C               *:Date 20080312
**C               *:Time 0026330
**C               *<Natural Source Header
**DS          0         1NPXXANSA
**DK          0   B   4 2STACK-NUMBER
**DK          0   I   4 2STACK-COUNT
**DK          0   I   4 2STACK-LEN
**DK          0   I   4 2STACK-ID
