**C               *>Natural Source Header 000000
**C               *:NatName NPZK910A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20090323
**C               *:Time 0839330
**C               *<Natural Source Header
**DS          0         1NPZK910A
**DK          0   A   9 2ZK-CODE
**DK          0   A   9 2ZK-BASE
**DK          0   N   5 2AC-PRIB
