**C               *>Natural Source Header 000000
**C               *:NatName OPORGL
**C               *:UID TIROD
**C               *:Mode S
**C               *:CP
**C               *:Date 20081118
**C               *:Time 1306330
**C               *<Natural Source Header
**DF I1       0   A 100 1OPORG-STR                       (1:20)
**DF          0   N   5 1OPORG-OG
