**C               *>Natural Source Header 000000
**C               *:NatName PARMHELP
**C               *:UID UOCNEW
**C               *:Mode R
**C               *:CP
**C               *:Date 20020104
**C               *:Time 1902330
**C               *<Natural Source Header
**DS          0000      1PARMHELP
**DK          0000A   9 2HSYSTEM                         /* KOÄ CÈCTEMÛ (HAÏPÈMEP:"ASUM
**DK          0000N   9 2NUMHELP                         /* HOMEP ÏÓHKTA ÏOMOÙÈ
