**C               *>Natural Source Header 000000
**C               *:NatName PATHL
**C               *:UID SUSHICKA
**C               *:Mode S
**C               *:CP
**C               *:Date 20070219
**C               *:Time 1643330
**C               *<Natural Source Header
**DF          0   N   5 1IOG
**DF          0   A   8 1ISOFT
**DF          0   A  80 1ICOMMAND
