**C               *>Natural Source Header 000000
**C               *:NatName PRM-SH1
**C               *:UID KZTA01
**C               *:Mode S
**C               *:CP
**C               *:Date 20051008
**C               *:Time 1324330
**C               *<Natural Source Header
**DS          0000      1PRM-SH
**DK          0000A 200 2ST-NM
**DK I1       0000A  30 2SH-NM                           (1:150)
