**C               *>Natural Source Header 000000
**C               *:NatName PRMHELP
**C               *:UID IBS_3
**C               *:Mode S
**C               *:CP
**C               *:Date 20000604
**C               *:Time 1735330
**C               *<Natural Source Header
**DS          0000      1PARMHELP
**DK          0000A   9 2HSYSTEM                         /* ÊÎÄ ÑÈÑÒÅÌÛ (ÍÀÏÐÈÌÅÐ:"ASUM
**DK          0000N   9 2NUMHELP                         /* ÍÎÌÅÐ ÏÓÍÊÒÀ ÏÎÌÎÙÈ
