**C               *>Natural Source Header 000000
**C               *:NatName PRMM01
**C               *:UID IBS_8
**C               *:Mode S
**C               *:CP
**C               *:Date 20001016
**C               *:Time 1248330
**C               *<Natural Source Header
**DS          0000      1PARMDOP
**DK          0000N   5 2KOD-ST
**DK          0000B   4 2N-DAT-B
**DK          0000N   4 2IS14
**DK          0000N   1 2FLG11
**DK          0000N   5 2OG-POLZ
