**C               *>Natural Source Header 000000
**C               *:NatName PRMSELST
**C               *:UID IBS_9
**C               *:Mode S
**C               *:CP
**C               *:Date 19991101
**C               *:Time 0946330
**C               *<Natural Source Header
**DS          0000      1SELSTPAR
**DK          0000N   5 2SEL_OG
**DK          0000A   5 2SEL_SHORT
**DK          0000A  70 2SEL_NM
