**C               *>Natural Source Header 000000
**C               *:NatName PSWPRM
**C               *:UID MSA
**C               *:Mode R
**C               *:CP
**C               *:Date 20041121
**C               *:Time 1616330
**C               *<Natural Source Header
**DS          0         1SKEY
**DK          0   A   8 2SYST
**DK          0   N   5 2ORG
**DK          0   A   8 2POLZ
