**C               *>Natural Source Header 000000
**C               *:NatName PSWPRM1
**C               *:UID MSA
**C               *:Mode S
**C               *:CP
**C               *:Date 20041111
**C               *:Time 0819330
**C               *<Natural Source Header
**DS          0         1SKEY
**DK          0   N   5 2ORG
**DK          0   A   5 2SYST
**DK          0   A   8 2USR
**DK          0   A   8 2PSW
**DK          0   N   1 2#RC
