* >Natural Source Header 000000 /*<RO>>
* :NatName READAU
* :UID MSA
* :Mode S
* :CP windows-1251
* :Date 20110726
* :Time 1335340
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL USING AUUNXX0L
  LOCAL USING STEKL
END-DEFINE
*
READ AU-UNIT
  IF UN-BS = 832 AND UN-CODE = 842147
WRITE ';;;;;;;;;'
*    UN-CODE := 832089  UPDATE  END TRANSACTION
    WRITE UN-CODE
  END-IF
END-READ
END TRANSACTION
*
END
