* >Natural Source Header 000000 /*<RO>>
* :NatName READUN
* :UID MSA
* :Mode S
* :CP windows-1251
* :Date 20111017
* :Time 1506450
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING AUUNXX0L
END-DEFINE
READ AU-UNIT
IF UN-CODE = 842130  WRITE UN-BS ';'  END-IF
END-READ
END
