* >Natural Source Header 000000 /*<RO>>
* :NatName READPSW
* :UID KBDUO
* :Mode R
* :CP
* :Date 20090217
* :Time 1013330
* <Natural Source Header /*<<RO>
READ PSW-SYS-FILE
IF SYST = 'ASUM' DO
WRITE OG-ID SYST RTYPE OBJ-ID FLDA1
* DELETE
DOEND
END OF TRANSACTION
.
