* >Natural Source Header 000000 /*<RO>>
* :NatName READSYS
* :UID INTECO
* :Mode R
* :CP
* :Date 20090702
* :Time 1513330
* <Natural Source Header /*<<RO>
FIND IBS-SYS-FILE KK-F = 'UC'
WRITE ';' .
