* >Natural Source Header 000000 /*<RO>>
* :NatName RUN_DOG
* :UID MSA
* :Mode S
* :CP
* :Date 20080406
* :Time 1630330
* <Natural Source Header /*<<RO>
DEFINE DATA
 PARAMETER USING PRMNAVI
END-DEFINE
PERFORM XPDGSH0S
END
