* >Natural Source Header 000000 /*<RO>>
* :NatName RUN_UNIT
* :UID MSA
* :Mode S
* :CP
* :Date 20090919
* :Time 1031330
* <Natural Source Header /*<<RO>
DEFINE DATA
 PARAMETER USING PRMNAVI
END-DEFINE
PERFORM XPUNSH0S
END
