* >Natural Source Header 000000 /*<RO>>
* :NatName RUN_CLP
* :UID INTECO
* :Mode S
* :CP
* :Date 20090702
* :Time 1513330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL
  1 #OG(N5) INIT < 1000 >
END-DEFINE
CALLNAT 'CLPROV' #OG
END
