* >Natural Source Header 000000 /*<RO>>
* :NatName RUN_RBP
* :UID INTECO
* :Mode S
* :CP
* :Date 20090706
* :Time 1533330
* <Natural Source Header /*<<RO>
DEFINE DATA
 PARAMETER USING PRMNAVI
END-DEFINE
PERFORM XPRBSH0S
END
