* >Natural Source Header 000000 /*<RO>>
* :NatName RUNUNIT
* :UID MSA
* :Mode S
* :CP
* :Date 20110403
* :Time 1245000
* <Natural Source Header /*<<RO>
DEFINE DATA
 PARAMETER USING PRMNAVI
END-DEFINE
PERFORM XPUNSH0S
END
