* >Natural Source Header 000000 /*<RO>>
* :NatName SBROWSER
* :UID NATURAL
* :Mode S
* :CP
* :Date 20050411
* :Time 1635330
* <Natural Source Header /*<<RO>
FETCH RETURN 'FIW'
CALLNAT 'BROWSER'
.
