* >Natural Source Header 000000 /*<RO>>
* :NatName SET-PARO
* :UID MSA
* :Mode S
* :CP
* :Date 20100309
* :Time 1242330
* <Natural Source Header /*<<RO>
    UOC-INV-FILE.SU-F(1) := OTK_PARMS.SU1
    UOC-INV-FILE.SU-F(2) := OTK_PARMS.SU2
    UOC-INV-FILE.BS-F(1) := OTK_PARMS.BS1
    UOC-INV-FILE.BS-F(2) := OTK_PARMS.BS2
    UOC-INV-FILE.OT-F := OTK_PARMS.OTR
    UOC-INV-FILE.OV-F := OTK_PARMS.VD
    UOC-INV-FILE.MO-F := OTK_PARMS.MO
    UOC-INV-FILE.QN-F := OTK_PARMS.KL
