* >Natural Source Header 000000 /*<RO>>
* :NatName SETKEYAL
* :UID UOCNEW
* :Mode R
* :CP
* :Date 20020104
* :Time 1905330
* <Natural Source Header /*<<RO>
SET KEY ENTR PF1 PF2 PF3 PF4 PF5 PF6 PF7 PF8 PF9 PF10 PF11 PF12 ;
