* >Natural Source Header 000000 /*<RO>>
* :NatName STST1
* :UID MSA
* :Mode S
* :CP windows-1251
* :Date 20110404
* :Time 1103180
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL USING VIEWSTAT
  LOCAL USING AUUNXX0L
END-DEFINE
READ AU-UNIT
  IF UN-BS = 850
    VIEWSTAT.OG-ID := 1000
    VIEWSTAT.ST-F := 'UNIT'
    VIEWSTAT.CT-F := UN-CODE
    VIEWSTAT.NM-OG := UN-NAME
    STORE VIEWSTAT
    END TRANSACTION
  END-IF
END-READ
END
