* >Natural Source Header 000000 /*<RO>>
* :NatName SZV
* :UID NIMI3
* :Mode S
* :CP
* :Date 20001204
* :Time 1734330
* <Natural Source Header /*<<RO>
DEFINE DATA
 LOCAL USING LCLSTSET
 LOCAL
1 KEYSETUP(A16)
1 REDEFINE KEYSETUP
 2 KEYOG(N5)
 2 KEYTT(A5)
 2 KEYCD(N6)
END-DEFINE
  KEYSETUP.KEYOG :=1000 /* PARCOMM.OG_ID
  KEYSETUP.KEYTT := 'VO'
  KEYSETUP.KEYCD := -1
  WRITE '='KEYSETUP
 FIND STSETUPV OG-ST = KEYSETUP
WRITE ST-F CT-F
 WRITE 'KOL' '='*NUMBER
END-FIND
END

