* >Natural Source Header 000000 /*<RO>>
* :NatName TCLOSEDB
* :UID NAT315
* :Mode R
* :CP
* :Date 20060920
* :Time 1423330
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL
1 DB(P3)
END-DEFINE
DB := 7
CALLNAT 'CLOSEDB' DB
END
