* >Natural Source Header 000000 /*<RO>>
* :NatName TEKTON4
* :UID MSA
* :Mode S
* :CP
* :Date 20041010
* :Time 1356330
* <Natural Source Header /*<<RO>
DEFINE DATA
 LOCAL USING LCLSTAT
 LOCAL USING LCLSTATI
END-DEFINE
END

