* >Natural Source Header 000000 /*<RO>>
* :NatName TEST-ST
* :UID KALIGULA
* :Mode R
* :CP
* :Date 20040806
* :Time 1203330
* <Natural Source Header /*<<RO>
RESET #I(N10) KD(N6) KK(A5)
/*
FIND IBS-REC-FILE WITH  GM-F = 200401
/*
 OBTAIN ST-OS(1-4)
* WHERE  KK-OS NE ' '
 /*

* WRITE '*' c
  FOR #I = 1 TO C*ST-OS
*  IF KK-OS(#I) = ' ' ESCAPE BOTTOM
  WRITE OS-F KK-OS(1.#I) KD-OS(1.#I) GM-F
*  LOOP
/*
LOOP
END
