* >Natural Source Header 000000 /*<RO>>
* :NatName #TEST1
* :UID NATURAL
* :Mode S
* :CP
* :Date 20020703
* :Time 1147330
* <Natural Source Header /*<<RO>
/* œ–Œ¬≈– ¿ —“–Œ » Õ¿  Œ––≈ “ÕŒ—“‹ —»Õ“¿ —»—¿
/*  INPUT:
/*  1) —“–Œ ¿ (¿70)
/* OUTPUT:
/*  1)  ‘À¿√ Œÿ»¡ »
/*  1a)  Œƒ Œÿ»¡ »
/*     ≈—À» ‘À¿√ Œÿ»¡ » == FALSE, “Œ
/*  2)  ŒÀ»◊≈—“¬Œ œ≈–≈Ã≈ÕÕ€’, Õ¿…ƒ≈ÕÕ€’ ¬ —“–Œ ≈ (I4)
/*  3) —œ»—Œ  œ≈–≈Ã≈ÕÕ€’, Õ¿…ƒ≈ÕÕ€’ ¬ —“–Œ ≈ (A10/1:20)
/*  4) —“–” “”–¿ ƒÀﬂ œ≈–≈ƒ¿◊» ¬  ¿À‹ ”Àﬂ“Œ–
DEFINE DATA
 LOCAL USING LCONVERT
 LOCAL USING RESERROR
 LOCAL
1 STR(A70)
1 SCREEN
 2 NVAR(I1/1:20)
 2 VARNAME(A10/1:20)
 2 NFUN(I1/1:20)
 2 FUNNAME(A10/1:20)
1 I(I4)
1 K(I4)
1 D(I4)
1 W(I4)
END-DEFINE
FORMAT LS=100
REPEAT
 RESET LCONVERT ;
 INPUT (AD=MT'_') STR;
 LCONVERT.CMD := STR;
 CALLNAT 'CHECKCMD' LCONVERT ;
 IF LCONVERT.ERROR THEN
   PERFORM GET_LAST_ERROR;
  ELSE
    RESET SCREEN;
    FOR I = 1 TO LCONVERT.VARCOUNT
     SCREEN.NVAR(I) := I
     SCREEN.VARNAME(I) := LCONVERT.VARNAME(I)
    END-FOR
    FOR I = 1 TO LCONVERT.FUNCOUNT
     SCREEN.NFUN(I) := I
     SCREEN.FUNNAME(I) := LCONVERT.FUNNAME(I)
    END-FOR
    WRITE 'String :' LCONVERT.CMD ;
    WRITE ' N Var :' LCONVERT.VARCOUNT 10X ' N Fun :' LCONVERT.FUNCOUNT
    FOR I = 1 TO 20
     WRITE SCREEN.NVAR(I)(ZP=OFF) 2X SCREEN.VARNAME(I) 20T '|'
           SCREEN.NFUN(I)(ZP=OFF) 2X SCREEN.FUNNAME(I)
    END-FOR
    FOR I = 1 TO LCONVERT.FUNCOUNT
     NEWPAGE;
     WRITE '    String :' LCONVERT.CMD ;
     WRITE '     Point :' I
     WRITE '   ‘ÛÌÍˆË  :' LCONVERT.FUNNAME(I)
     WRITE 'N parameter:' LCONVERT.FUNPARCOUNT(I)
     FOR K = 1 TO LCONVERT.FUNPARCOUNT(I)
      WRITE K '-'(50)
      FOR D = 1 TO LCONVERT.FUNPVARCOUNT(I,K)
       W := LCONVERT.FUNPVAR(I,K,D)
       IF D = 1 THEN WRITE ' Uses :' LCONVERT.VARNAME(W)
       ELSE WRITE 8X LCONVERT.VARNAME(W)
       END-IF
      END-FOR
      WRITE /'Parameter turn :'
      FOR D = 1 TO 40
       IF LCONVERT.FUNVARTYPE(I,K,D) EQ 0 THEN ESCAPE TOP END-IF
       WRITE D(NL=3) 1X LCONVERT.FUNVARTYPE(I,K,D)
                        LCONVERT.FUNVARPOINT(I,K,D)
                        LCONVERT.FUNVARDATA(I,K,D)
      END-FOR
     END-FOR
     WRITE '-'(60)
    END-FOR
    NEWPAGE;
    WRITE 'String :' LCONVERT.CMD ;
    WRITE 'COMMON TURN' /
    WRITE 2T 'N    TYPE   POINT         DATA'
    FOR I = 1 TO 50
     IF LCONVERT.TYPE(I) EQ 0 THEN ESCAPE TOP END-IF
     WRITE I(NL=3) 1X LCONVERT.TYPE(I)  LCONVERT.POINT(I) LCONVERT.DATA(I)
    END-FOR
 END-IF
END-REPEAT
DEFINE SUBROUTINE GET_LAST_ERROR
   IF LCONVERT.ERROR_CODE EQ 1 THRU NRESERROR THEN
     IF LCONVERT.ERROR_CODE EQ 1 OR EQ 22 THEN
       INPUT (AD=OIL) 'Œ¯Ë·Í‡ Ò ÍÓ‰ÓÏ :' LCONVERT.ERROR_CODE /
                      '         “ÂÍÒÚ :' RESERROR(ERROR_CODE) /
                      '     *ERROR-TA -' *ERROR-TA /
                      '   *ERROR-LINE -' *ERROR-LINE /
                      '     *ERROR-NR -' *ERROR-NR
      ELSE
       INPUT (AD=OIL) 'Œ¯Ë·Í‡ Ò ÍÓ‰ÓÏ :' LCONVERT.ERROR_CODE /
             '“ÂÍÒÚ :' RESERROR(ERROR_CODE)
     END-IF
    ELSE
     INPUT (AD=OIL) 'Œ¯Ë·Í‡ Ò ÍÓ‰ÓÏ :' LCONVERT.ERROR_CODE
   END-IF
END-SUBROUTINE
END
