* >Natural Source Header 000000 /*<RO>>
* :NatName TPRBPR0P
* :UID T_IEN
* :Mode S
* :CP
* :Date 20100301
* :Time 1023330
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XPRBPR0A
END-DEFINE
OG-CODE := 1000
AC-CODE := 9760
DT-START := 20090101
DT-STOP := 20091231
SIGN-OID := 3357
PERFORM XPRBPR0S XXERX00A XPRBPR0A
END
