* >Natural Source Header 000000 /*<RO>>
* :NatName TT
* :UID MSA
* :Mode S
* :CP
* :Date 20071120
* :Time 1012330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL USING LCLKKL
END-DEFINE
FIND IBS-KK-FILE KK-F = 'KD'
  WRITE WORK 7 KK-F NA-KD NA-NM NA-SH
END-FIND
END
