* >Natural Source Header 000000 /*<RO>>
* :NatName UNLVO
* :UID MSA
* :Mode S
* :CP
* :Date 20051111
* :Time 1437330
* <Natural Source Header /*<<RO>
DEFINE DATA
  LOCAL USING LCLVOL
  LOCAL
  1 #I(N7)  1 INM(A200)  1 R-NM(A30/150)
  1 DD(B1)
  1 REDEFINE DD
    2 #DD(A1)
END-DEFINE
DD := H'7F'
FIND IBS-KVO-FILE OG-VO = '0100000001' THRU '0100099999'
  WRITE WORK 1 VO-ID NM-OG AD-OG
END-FIND
END
