**C               *>Natural Source Header 000000
**C               *:NatName VIEW-TYL
**C               *:UID NAT22603
**C               *:Mode S
**C               *:CP
**C               *:Date 20060124
**C               *:Time 1422330
**C               *<Natural Source Header
**DS          0000      1VIEW-TYL
**DK          0000A   3 2ITY
**DK          0000A  50 2ISH
