**C               *>Natural Source Header 000000
**C               *:NatName VIEWSTAT
**C               *:UID NIMI
**C               *:Mode S
**C               *:CP
**C               *:Date 20051020
**C               *:Time 1405330
**C               *<Natural Source Header
**DV          0        V1VIEWSTAT                        IBS-SYS-FILE
**DD          0   N 5.0 2OG-ID
**DD          0   A   5 2ST-F
**DD          0   N 6.0 2CT-F
**DD          0   A  80 2NM-OG
