* >Natural Source Header 000000 /*<RO>>
* :NatName #VO_2_ST
* :UID MSA
* :Mode R
* :CP
* :Date 20080301
* :Time 1725330
* <Natural Source Header /*<<RO>
RESET #FR(B10) REDEFINE #FR(#OG1(N5) #CD1(N5))
RESET #TO(B10) REDEFINE #TO(#OG2(N5) #CD2(N5))
!0.*
#OG1 = 1
#CD1 = 1
*
#OG2 = 99999
#CD2 = 99999
*
RESET NNN(I4)
READ IBS-SYS-FILE IN LOGICAL WITH OG-VO EQ #FR THRU #TO
 ADD 1 TO NNN
 UPDATE CT-F = VO-ID(!0) ST-F = 'VO'
 END OF TRANSACTION
LOOP
WRITE NNN
.
