* >Natural Source Header 000000 /*<RO>>
* :NatName WMESSAGE
* :UID IBS_3
* :Mode S
* :CP
* :Date 20001214
* :Time 1222330
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER
1 PARAM_STR(A40)
END-DEFINE
DEFINE WINDOW MESSAGE
       SIZE 07 * 46
       BASE 08 / 22
       TITLE 'ֶהטעו ...'
/*        FRAMED (CD=RE)
IF *DEVICE NE 'BATCH'
SET CONTROL 'N'
SET WINDOW 'MESSAGE'
INPUT (IP=OFF) /
 02T PARAM_STR  (AD=BLOFHT' ' CD=RE )
SET WINDOW OFF
END-IF
END
