**C               *>Natural Source Header 000000
**C               *:NatName XLL
**C               *:UID NIMI
**C               *:Mode S
**C               *:CP
**C               *:Date 20061015
**C               *:Time 1535330
**C               *<Natural Source Header
**DF I1       0   A 100 1#DATA                           (1:10)
**DF          0   N   5 1#CODE
