**C               *>Natural Source Header 000000
**C               *:NatName XPDGSC0L
**C               *:UID OLEG
**C               *:Mode S
**C               *:CP
**C               *:Date 20080229
**C               *:Time 0009330
**C               *<Natural Source Header
**DS          0         1XPDGSC0L
**DK          0   N   5 2DG-CODE
**DK          0   A  20 2DG-NUMBER-DOG
