**C               *>Natural Source Header 000000
**C               *:NatName XPFVSC0L
**C               *:UID LMV
**C               *:Mode S
**C               *:CP
**C               *:Date 20080323
**C               *:Time 1818330
**C               *<Natural Source Header
**DS          0         1XPFVSC0L
**DK          0   N   5 2FV-CODE
**DK          0   A 100 2FV-NAME
