**C               *>Natural Source Header 000000
**C               *:NatName XPNISC0L
**C               *:UID OLEG
**C               *:Mode S
**C               *:CP
**C               *:Date 20080111
**C               *:Time 1336330
**C               *<Natural Source Header
**DS          0         1XPNISC0L
**DK          0   N   5 2NI-CODE
**DK          0   A 100 2NI-NAME
