* >Natural Source Header 000000 /*<RO>>
* :NatName XPPBIN0C
* :UID INTECO
* :Mode S
* :CP
* :Date 20081022
* :Time 1415330
* <Natural Source Header /*<<RO>
RESET XPPBXX0A
MOVE &1& TO XPPBXX0A.PB-PROCESS-MAX
MOVE &2& TO XPPBXX0A.PB-HEADER
MOVE "INIT" TO XPPBXX0A.BL-COMMAND
PERFORM XPPBXX0S XXERX00A XXCTXX0A XPPBXX0A
IF RETURN-CODE NE 0 THEN PERFORM XPERVW0S XXERX00A END-IF
