**C               *>Natural Source Header 000000
**C               *:NatName XPRBSC0L
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20090706
**C               *:Time 1346330
**C               *<Natural Source Header
**DS          0         1XPRBSC0L
**DK          0   N   6 2RB-CODE
**DK          0   A 100 2RB-NAME
