* >Natural Source Header 000000 /*<RO>>
* :NatName XPXXSP5C
* :UID MSA
* :Mode S
* :CP
* :Date 20080406
* :Time 1756330
* <Natural Source Header /*<<RO>
/* 1 - XPDGSH1L.DG-VALUTA
/* 2 - XPDGSH1L.DG-VALUTA-A
/* 3 - XPXXCO0L.CODE-valuta

  WHEN *CURS-FIELD = POS(&1&)
     HLPST.OGST := XPXXCO0L.OSN-GROUP  MOVE &3& TO SHST
     CDST := &1&
     CALLNAT 'SELSTAN' HLPST
     &1& := CDST
     &2& := NMST

