* >Natural Source Header 000000 /*<RO>>
* :NatName XPXXSP1C
* :UID KOVALCHU
* :Mode S
* :CP
* :Date 20080319
* :Time 1254330
* <Natural Source Header /*<<RO>
/* 1 - XPDGSH1L.DG-ROLY-LICA-SACLUCH
/* 2 - XPDGSH1L.DG-ROLY-LICA-SACLUCH-A
/* 3 - XPXXCO0L.CODE-TYPE-STORON-DOC

  IF &1& NE 0   /*
     HLPST.OGST := 1000  SHST := &3&
     CDST := &1&
     CALLNAT "GETSTANA" HLPST
     MOVE NMST  TO &2&
  ELSE
     RESET &1& &2&
  END-IF

