* >Natural Source Header 000000 /*<RO>>
* :NatName XXERSY1C
* :UID INTECO
* :Mode R
* :CP
* :Date 20081022
* :Time 1420330
* <Natural Source Header /*<<RO>
ON ERROR
  RETURN-CODE   := -1
  ERROR-NUMBER  := *ERROR-NR
  ERROR-MODULE  := *PROGRAM
  ERROR-LINE    := *ERROR-LINE
  ESCAPE ROUTINE
END-ERROR
