DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING WWXRPC0A
END-DEFINE
XML-IN :=
'<?xml version="1.0" encoding="utf-8"?>'-
'<XWVOXCIA>'-
'  <OG-CODE>1</OG-CODE>'-
'</XWVOXCIA>'
CALLNAT "XWVOXC0N" XXERX00A WWXRPC0A
PRINT XML-OUT
END

