**C               *>Natural Source Header 000000
**C               *:NatName CVTDCX0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20000102
**C               *:Time 0000000
**C               *<Natural Source Header
**DS          0000      1CVTDCXOA
**DK          0000P  15 2DT-START
**DK          0000P  15 2DT-STOP
