* >Natural Source Header 000000 /*<RO>>
* :NatName CVTREC0P
* :UID PAUL
* :Mode S
* :CP
* :Date 20070411
* :Time 0944000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING IBS-RECL
END-DEFINE
FIND IBS-REC-FILE WITH GM-F EQ 200703 AND
    OS-F EQ 1901  AND KS-F EQ 60
  ACCEPT SY-F EQ "ASUM"
  BO-F := 2
  KS-F := 193
  STORE IBS-REC-FILE
  END TRANSACTION
END-FIND
END TRANSACTION
END
