* >Natural Source Header 000000 /*<RO>>
* :NatName CVTSLD8P
* :UID PAUL
* :Mode S
* :CP
* :Date 20070419
* :Time 2138000
* <Natural Source Header /*<<RO>
/* удаление загруженных остатков
DEFINE DATA
LOCAL USING MBSAEX0L
END-DEFINE
DEFINE WORK FILE 7 'c:\clear202.ncd'
MOVE 202 TO MBSAEX0L.NOMPARTY
MOVE 777 TO MBSAEX0L.NOMDOK
MOVE 20061231 TO MBSAEX0L.DATE
WRITE WORK FILE 7 MBSAEX0L
CLOSE WORK FILE 7
END
