* >Natural Source Header 000000 /*<RO>>
* :NatName CXBSS0XS
* :UID ¿‰ÏËÌËÒÚ
* :Mode S
* :CP
* :Date 20061024
* :Time 1959000
* <Natural Source Header /*<<RO>
/* Ã¿“≈–»¿À€

DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING CXBSS0XA
PARAMETER USING CXXXS0CA
PARAMETER USING MBXXOP0A     /* Œœ»—¿Õ»≈
PARAMETER USING XXCTXX0A
LOCAL USING CXBSS0DL
LOCAL USING LCLBSL
LOCAL USING XXXXEC0L
LOCAL
1 #BS-ID  (N15)
1 REDEFINE #BS-ID
2 BLANK (N5)
2 OG-ID (N5)
2 BS-ID (N5)
1 #OG-SS  (B10)
1 REDEFINE #OG-SS
2 OG-ID (N5)
2 BS-ID (N5)
1 #I     (I4)
END-DEFINE
/*
DEFINE SUBROUTINE CXBSS0XS
INCLUDE XXERSY1C
  RESET XXERX00A.RETURN-CODE
  DECIDE ON FIRST VALUE CXBSS0XA.BS-COMMAND
     VALUE "INIT"
        PERFORM STACK-INIT
     VALUE "FREE"
        PERFORM STACK-FREE
     VALUE "LOCATE"
        PERFORM DEFINE-FIND
     VALUE "READ"
        PERFORM ITEM-READ
     NONE VALUE
        IGNORE
  END-DECIDE
/*
DEFINE SUBROUTINE DEFINE-FIND
  IF XXCTXX0A.OG-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF CXBSS0XA.BS-SEARCH EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE CXBSS0XA.BS-SEARCH TO CXBSS0DL.BS-ID
  PERFORM ITEM-LOCATE
END-SUBROUTINE
/*
DEFINE SUBROUTINE ITEM-LOCATE
  CXBSS0DL.STACK-TMP-I := 9
  MOVE CXBSS0DL.STACK-TMP-I TO CXBSS0DL.STACK-FIELD-POS
  CXBSS0DL.STACK-TMP-I := 8   /*
  MOVE CXBSS0DL.STACK-TMP-I TO CXBSS0DL.STACK-FIELD-LEN
  CALL 'CMPXF' CXBSS0DL.BS-ID CXBSS0DL.STACK-FIELD-POS
               CXBSS0DL.STACK-FIELD-LEN CXXXS0CA.STACK-NUMBER


  IF CXBSS0DL.STACK-FIELD-POS EQ H'00000000'  THEN
     MOVE XXCTXX0A.OG-ID TO #OG-SS.OG-ID
     MOVE CXBSS0XA.BS-SEARCH TO #BS-ID
     MOVE #BS-ID.BS-ID TO #OG-SS.BS-ID
     F1. FIND IBS-BS-FILE WITH OG-SS = #OG-SS
        IF NO RECORDS
           MOVE CXBSS0DL.BS-ID TO IBS-BS-FILE.SS-ID
           MOVE 'ÕÂ Ì‡È‰ÂÌÓ' TO IBS-BS-FILE.NM-BS
        END-NOREC
        XXCTXX0A.OG-ID := IBS-BS-FILE.OG-ID
        CXBSS0DL.BS-CODE := IBS-BS-FILE.SS-ID
        MOVE IBS-BS-FILE.SS-ID TO #BS-ID.BS-ID
        MOVE XXCTXX0A.OG-ID TO #BS-ID.OG-ID
        MOVE #BS-ID TO CXBSS0DL.BS-ID
        CXBSS0DL.BS-NAME := IBS-BS-FILE.NM-BS
        PERFORM STACK-PUSH
        MOVE CXXXS0CA.STACK-LEN TO CXBSS0DL.STACK-FIELD-POS
        ESCAPE BOTTOM
     END-FIND
  ELSE
     CALL 'RWSX' CXBSS0DL.STACK-FIELD-POS CXBSS0DL.STACK-REC-B(1)
                STACK-READ CXXXS0CA.STACK-NUMBER
     CXBSS0XA.BS-ID := CXBSS0DL.BS-ID
  END-IF
/*
  MOVE CXBSS0DL.STACK-FIELD-POS TO CXBSS0XA.DS-ELEM-STEK
/*
END-SUBROUTINE
/*
INCLUDE CXXXSOXS "CXBSS0DL" "BS-NPP" "BS-SORT" "CXBSS0XA"
/*
END-SUBROUTINE
END

