* >Natural Source Header 000000 /*<RO>>
* :NatName CXGMS0XS
* :UID ¿‰ÏËÌËÒÚ
* :Mode S
* :CP
* :Date 20060911
* :Time 1023000
* <Natural Source Header /*<<RO>
/* √–”œœ€ Ã¿“≈–»¿ÀŒ¬

DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING CXGMS0XA
PARAMETER USING CXXXS0CA
PARAMETER USING MBXXOP0A     /* Œœ»—¿Õ»≈
PARAMETER USING XXCTXX0A
LOCAL USING CXGMS0DL
LOCAL USING ASUMGMAT
LOCAL USING XXXXEC0L
LOCAL
1 KEY1(A12)
1 REDEFINE KEY1
  2 KEYOG1(N5)            /*  KOƒ
  2 KEYKK1(A2)            /*  METKA
  2 KEYKD1(N5)            /*   Œƒ √–”œœ€
1 #I     (I4)
1 #GM-ID1      (N15)
1 REDEFINE #GM-ID1
2 BLANK       (N5)
2 OG-ID       (N5)
2 GM-ID       (N5)
END-DEFINE
/*
DEFINE SUBROUTINE CXGMS0XS
  RESET XXERX00A.RETURN-CODE
  DECIDE ON FIRST VALUE CXGMS0XA.GM-COMMAND
     VALUE "INIT"
        PERFORM STACK-INIT
     VALUE "FREE"
        PERFORM STACK-FREE
     VALUE "LOCATE"
        PERFORM DEFINE-FIND
     VALUE "READ"
        PERFORM ITEM-READ
     NONE VALUE
        IGNORE
  END-DECIDE
/*
DEFINE SUBROUTINE DEFINE-FIND
  IF CXGMS0XA.GM-SEARCH = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF XXCTXX0A.OG-ID = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE CXGMS0XA.GM-SEARCH TO CXGMS0DL.GM-ID
  PERFORM ITEM-LOCATE
END-SUBROUTINE
/*
/*
DEFINE SUBROUTINE ITEM-LOCATE
  CXGMS0DL.STACK-TMP-I := 9
  MOVE CXGMS0DL.STACK-TMP-I TO CXGMS0DL.STACK-FIELD-POS
  CXGMS0DL.STACK-TMP-I := 8
  MOVE CXGMS0DL.STACK-TMP-I TO CXGMS0DL.STACK-FIELD-LEN
  CALL 'CMPXF' CXGMS0DL.GM-ID CXGMS0DL.STACK-FIELD-POS
               CXGMS0DL.STACK-FIELD-LEN CXXXS0CA.STACK-NUMBER

  IF CXGMS0DL.STACK-FIELD-POS EQ H'00000000'  THEN
     MOVE "MA" TO KEYKK1
     MOVE XXCTXX0A.OG-ID TO KEYOG1
     CXGMS0DL.GM-CODE := CXGMS0XA.GM-SEARCH - XXCTXX0A.OG-ID * 100000
     MOVE CXGMS0DL.GM-CODE TO KEYKD1
     F1. FIND ASUMGMAT WITH TP-Y = KEY1
        IF NO RECORDS
           MOVE CXGMS0XA.GM-CODE TO ASUMGMAT.KD-F
           MOVE '«¿œ»—‹ Õ≈ Õ¿…ƒ≈Õ¿' TO ASUMGMAT.NMGROUP
        END-NOREC
        CXGMS0DL.GM-ID := ASUMGMAT.OG-F * 100000 + ASUMGMAT.KD-F
        MOVE CXGMS0DL.GM-ID TO CXGMS0XA.GM-ID
        MOVE ASUMGMAT.KD-F TO CXGMS0XA.GM-CODE
        MOVE CXGMS0XA.GM-CODE  TO CXGMS0DL.GM-CODE
        MOVE ASUMGMAT.NMGROUP TO CXGMS0DL.GM-NAME
        PERFORM STACK-PUSH
        MOVE CXXXS0CA.STACK-LEN TO CXGMS0DL.STACK-FIELD-POS
        ESCAPE BOTTOM
     END-FIND
  ELSE
    CALL 'RWSX' CXGMS0DL.STACK-FIELD-POS CXGMS0DL.STACK-REC-B(1)
                STACK-READ CXXXS0CA.STACK-NUMBER
     CXGMS0XA.GM-ID := CXGMS0DL.GM-ID
  END-IF
/*
  MOVE CXGMS0DL.STACK-FIELD-POS TO CXGMS0XA.DS-ELEM-STEK
/*
END-SUBROUTINE
/*
INCLUDE CXXXSOXS "CXGMS0DL" "GM-NPP" "GM-SORT" "CXGMS0XA"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

