* >Natural Source Header 000000 /*<RO>>
* :NatName CXMTS0XS
* :UID PAUL
* :Mode S
* :CP
* :Date 20071030
* :Time 1818000
* <Natural Source Header /*<<RO>
/* Ã¿“≈–»¿À€

DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING CXMTS0XA
PARAMETER USING CXXXS0CA
PARAMETER USING MBXXOP0A     /* Œœ»—¿Õ»≈
PARAMETER USING XXCTXX0A
LOCAL USING CXMTS0DL
LOCAL USING KDFL
LOCAL USING XXXXEC0L
LOCAL
1 SUP-KEYMT(A27)
1 REDEFINE SUP-KEYMT
  2 OG-F   (N5)
  2 KM-F   (A22)

1 #MT-NAME (A100)
1 REDEFINE #MT-NAME
  2 #NM-F  (A50/1:2)
1 #I     (I4)
END-DEFINE
/*
DEFINE SUBROUTINE CXMTS0XS
INCLUDE XXERSY1C
  RESET XXERX00A.RETURN-CODE
  DECIDE ON FIRST VALUE CXMTS0XA.MT-COMMAND
     VALUE "INIT"
        PERFORM STACK-INIT
     VALUE "FREE"
        PERFORM STACK-FREE
     VALUE "LOCATE"
        PERFORM DEFINE-FIND
     VALUE "READ"
        PERFORM ITEM-READ
     NONE VALUE
        IGNORE
  END-DECIDE
/*
DEFINE SUBROUTINE DEFINE-FIND
  IF CXMTS0XA.MT-SEARCH = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE CXMTS0XA.MT-SEARCH TO CXMTS0DL.MT-ID
  PERFORM ITEM-LOCATE
END-SUBROUTINE
/*
DEFINE SUBROUTINE ITEM-LOCATE
  CXMTS0DL.STACK-TMP-I := 9
  MOVE CXMTS0DL.STACK-TMP-I TO CXMTS0DL.STACK-FIELD-POS
  CXMTS0DL.STACK-TMP-I := 8   /* CXMTS0DL
  MOVE CXMTS0DL.STACK-TMP-I TO CXMTS0DL.STACK-FIELD-LEN
  CALL 'CMPXF' CXMTS0DL.MT-ID CXMTS0DL.STACK-FIELD-POS
               CXMTS0DL.STACK-FIELD-LEN CXXXS0CA.STACK-NUMBER
  IF CXMTS0DL.STACK-FIELD-POS EQ H'00000000'  THEN
     F1. FIND ASUM-KODIF-FILE WITH INT-NUM-KM = CXMTS0DL.MT-ID
        IF NO RECORDS
           MOVE CXMTS0DL.MT-ID TO ASUM-KODIF-FILE.KM-F
           MOVE 'ÕÂ Ì‡È‰ÂÌÓ' TO ASUM-KODIF-FILE.NM-F(*)
        END-NOREC
        RESET CXMTS0DL.STACK-REC-G
        CXMTS0DL.MT-ID := ASUM-KODIF-FILE.INT-NUM-KM
        CXMTS0XA.MT-ID := ASUM-KODIF-FILE.INT-NUM-KM
        MOVE ASUM-KODIF-FILE.KM-F  TO CXMTS0DL.MT-CODE
        COMPRESS ASUM-KODIF-FILE.NM-F(1:2) INTO CXMTS0DL.MT-NAME
        IF ASUM-KODIF-FILE.OBOZ(1) NE " " THEN
           COMPRESS ASUM-KODIF-FILE.OBOZ(2) ASUM-KODIF-FILE.OBOZ(1)
              ASUM-KODIF-FILE.GOSTS ASUM-KODIF-FILE.GOST
              ASUM-KODIF-FILE.PROF ASUM-KODIF-FILE.VPR INTO CXMTS0DL.MT-NAME
        END-IF
        PERFORM STACK-PUSH
        MOVE CXXXS0CA.STACK-LEN TO CXMTS0DL.STACK-FIELD-POS
        ESCAPE BOTTOM
     END-FIND
  ELSE
     CALL 'RWSX' CXMTS0DL.STACK-FIELD-POS CXMTS0DL.STACK-REC-B(1)
                STACK-READ CXXXS0CA.STACK-NUMBER
     CXMTS0XA.MT-ID := CXMTS0DL.MT-ID
  END-IF
/*
  MOVE CXMTS0DL.STACK-FIELD-POS TO CXMTS0XA.DS-ELEM-STEK
/*
END-SUBROUTINE
/*
INCLUDE CXXXSOXS "CXMTS0DL" "MT-NPP" "MT-SORT" "CXMTS0XA"
/*
END-SUBROUTINE
END

