* >Natural Source Header 000000 /*<RO>>
* :NatName KZIMRL0P
* :UID ARMK01
* :Mode S
* :CP
* :Date 20070606
* :Time 1332000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL
1 REAL
2 OBOZN (N9)
2 NAIM  (A30)
2 SUMM  (N14.2)
2 NDS   (N14.2)
2 SUMM-ALL(N14.2)
2 NUM-SF(N9)
2 COD-ORG(N5)
2 DATA(N8)
2 NUM-TR (A8)
2 NUM-DT1(N8)
2 NUM-DT2(N8)
END-DEFINE
READ WORK FILE 7 REAL
  WRITE OBOZN NAIM SUMM NDS
       SUMM-ALL NUM-SF COD-ORG DATA NUM-TR NUM-DT1 NUM-DT2
END-WORK
END
