* >Natural Source Header 000000 /*<RO>>
* :NatName MAMTSK3N
* :UID PAUL
* :Mode S
* :CP
* :Date 20070612
* :Time 1530000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿: ¡»«Õ≈— Œœ≈–¿÷»ﬂ
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: œ–»’Œƒ€¬¿Õ»≈ œŒ œ–»’ŒƒÕŒÃ” Œ–ƒ≈–”
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - EDIT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XABOXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXITAT0L
LOCAL USING MPSKSH0A
END-DEFINE
RESET XXERX00A
/*
SET KEY OFF
SET KEY COMMAND OFF
SET KEY NAMED OFF
SET KEY ALL
SET CONTROL 'M=RE'
MPSKSH0A.CL-ID := 2000
* IT-ID
MPSKSH0A.ATTR-NAME(1) := 'MO'
/*MPSKSH0A.ATTR-CODE(1) := 10003
MPSKSH0A.ATTR-CODE(1) := MO-ATTR-ID
*
MPSKSH0A.ATTR-NAME(2) := 'MT'
/*MPSKSH0A.ATTR-CODE(2) := 10050
MPSKSH0A.ATTR-CODE(2) := MT-ATTR-ID
*
MPSKSH0A.ATTR-NAME(3) := 'PR'
/*MPSKSH0A.ATTR-CODE(3) := 10060
MPSKSH0A.ATTR-CODE(3) := PR-ATTR-ID
*
MPSKSH0A.ATTR-NAME(4) := 'KOL-EP'
MPSKSH0A.ATTR-CODE(4) := 0
*
MPSKSH0A.ATTR-NAME(5) := 'KOL-EU'
MPSKSH0A.ATTR-CODE(5) := 10103
*
MPSKSH0A.ATTR-NAME(6) := 'SUMMA-EU'
MPSKSH0A.ATTR-CODE(6) := 10105
*
MPSKSH0A.ATTR-NAME(7) := 'DATA-OT' /* ‰ÓÍÛÏÂÌÚ
MPSKSH0A.ATTR-CODE(7) := 902
*
MPSKSH0A.ATTR-NAME(8) := 'NUMBER-DOC'
MPSKSH0A.ATTR-CODE(8) := 10000
*
MPSKSH0A.ATTR-NAME(9) := 'DATA-DOC'
MPSKSH0A.ATTR-CODE(9) := 10001
*
MPSKSH0A.ATTR-NAME(10) := 'ZK'
MPSKSH0A.ATTR-CODE(10) := ZK-ATTR-ID
*
MPSKSH0A.ATTR-NAME(11) := 'VO'
MPSKSH0A.ATTR-CODE(11) := VO-ATTR-ID
*
MPSKSH0A.ATTR-NAME(12) := "BASE-MT"
MPSKSH0A.ATTR-CODE(12) := MT-BASE-ATTR-ID
*
MPSKSH0A.MD-IT-ID(1) := 151
MPSKSH0A.MD-IT-ID(2) := 152
MPSKSH0A.SK-COMMAND := 'NEW'
PERFORM MPSKSH0S XXERX00A XXCTXX0A MPSKSH0A
/*
INCLUDE XXERSY1C
END
