* >Natural Source Header 000000 /*<RO>>
* :NatName MAROXX0N
* :UID PAUL
* :Mode S
* :CP
* :Date 20070220
* :Time 1847000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿: ¡»«Õ≈— Œœ≈–¿÷»ﬂ
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: œ–»’Œƒ€¬¿Õ»≈ œŒ œ–»’ŒƒÕŒÃ” Œ–ƒ≈–” Õ¿ — À¿ƒ≈
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - EDIT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XABOXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XMBMXX1A
LOCAL USING UXCSXX0A
LOCAL USING MPDCSH0A
END-DEFINE
RESET XXERX00A
/*IF BO-COMMAND NE 'NEW' THEN /* AND BO-COMMAND NE 'EDIT' THEN
/*  MOVE BO-COMMAND TO ERROR-ADDITION(1)
/*  *ERROR-NR := EC-UNKNOW-COMMAND
/*END-IF
/*
SET KEY OFF
SET KEY COMMAND OFF
SET KEY NAMED OFF
SET KEY ALL
SET CONTROL 'M=RE'
/*XMBMXX0A.BM-COMMAND := BO-COMMAND
/*BM-OBJECT := 214416
IF BO-COMMAND EQ "EDIT" OR EQ "CONFIRM" THEN
  MOVE "SELDOC" TO BO-COMMAND-PROCESS
ELSE
  MOVE BO-COMMAND TO BO-COMMAND-PROCESS
END-IF
REPEAT
  DECIDE ON FIRST VALUE BO-COMMAND-PROCESS
     VALUE "NEW"
        XMBMXX1A.BM-COMMAND := "NEW"
        PERFORM MMRONW0S XXERX00A XXCTXX0A XMBMXX1A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     VALUE "SELDOC"
        MPDCSH0A.DD-ID := 1601
        MPDCSH0A.DC-NUMBER-ATTR-ID := 10000
        MPDCSH0A.DC-DATE-ATTR-ID := 10001
        MPDCSH0A.DC-MO-ATTR-ID := 20003
        MPDCSH0A.DC-KOR-MO-ATTR-ID := 30003
        MPDCSH0A.DC-KOR-VO-ATTR-ID := 20002
        MPDCSH0A.DR-ATTR-ID(1) := 10101
        MPDCSH0A.DR-VALUE(1) := 1
        MOVE "SELECT" TO XMBMXX1A.BM-COMMAND
        PERFORM MPDCSH0S XXERX00A XXCTXX0A XMBMXX1A MPDCSH0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
        MOVE MPDCSH0A.OD-ID TO XXCTXX0A.OD-ID
     VALUE "SELECT"
        IF BO-COMMAND EQ "EDIT" THEN
           MOVE "EDIT" TO BO-COMMAND-PROCESS
        ELSE IF BO-COMMAND EQ "CONFIRM" THEN
           MOVE "CONFIRM" TO BO-COMMAND-PROCESS
        ELSE
           MOVE BO-COMMAND TO ERROR-ADDITION(1)
           *ERROR-NR := EC-UNKNOW-COMMAND
        END-IF END-IF
     VALUE "CONFIRM"
        XMBMXX1A.BM-COMMAND := "CONFIRM"
        PERFORM MMROCF0S XXERX00A XXCTXX0A XMBMXX1A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
        BO-COMMAND-PROCESS := "SELDOC"
     VALUE "EDIT"
        XMBMXX1A.BM-COMMAND := "EDIT"
        PERFORM MMROED0S XXERX00A XXCTXX0A XMBMXX1A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
        IF RETURN-CODE NE 0 THEN
            BO-COMMAND-PROCESS := "SELDOC"
        END-IF
     VALUE "VIEW"
        MOVE BO-OBJECT TO BM-OBJECT
        MOVE "VIEW" TO XMBMXX1A.BM-COMMAND
        PERFORM MMROVW0S XXERX00A XXCTXX0A XMBMXX1A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     VALUE "VIEWEDIT"
        MOVE "VIEWEDIT" TO XMBMXX1A.BM-COMMAND
        PERFORM MMROVW0S XXERX00A XXCTXX0A XMBMXX1A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     VALUE "SAVE"
        IF BO-COMMAND EQ "EDIT" OR EQ "NEW" THEN
           MOVE "VIEWEDIT" TO BO-COMMAND-PROCESS
        ELSE IF BO-COMMAND EQ "CONFIRM" THEN
           MOVE "EXIT" TO BO-COMMAND-PROCESS
        ELSE
           MOVE BO-COMMAND TO ERROR-ADDITION(1)
           *ERROR-NR := EC-UNKNOW-COMMAND
        END-IF END-IF
     VALUE "PRINT"
        DEFINE PRINTER (1) OUTPUT DEFAULT-PRINTER
        MOVE "PRINT" TO XMBMXX1A.BM-COMMAND
        PERFORM MMROPR0S XXERX00A XXCTXX0A XMBMXX1A UXCSXX0A
        MOVE "VIEW"     TO BO-COMMAND-PROCESS
        MOVE XMBMXX1A.BM-OBJECT TO BO-OBJECT
     VALUE "EXIT"
        ESCAPE BOTTOM
     NONE VALUE
        MOVE BO-COMMAND-PROCESS TO ERROR-ADDITION(1)
        *ERROR-NR := EC-UNKNOW-COMMAND
  END-DECIDE
END-REPEAT
INCLUDE XXERSY1C
END
