* >Natural Source Header 000000 /*<RO>>
* :NatName MBBSMN0S
* :UID ¿‰ÏËÌËÒÚ
* :Mode S
* :CP
* :Date 20060911
* :Time 1024000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBBSMN0A
LOCAL USING XXXXEC0L
LOCAL USING LCLBSL
LOCAL
1 #BS-ID  (N15)
1 REDEFINE #BS-ID
2 BLANK (N5)
2 OG-ID (N5)
2 BS-ID (N5)
1 #OG-SS  (B10)
1 REDEFINE #OG-SS
2 OG-ID (N5)
2 BS-ID (N5)
END-DEFINE
DEFINE SUBROUTINE MBBSMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE BL-COMMAND
  VALUE 'READ'
     PERFORM RECORD-READ
  VALUE 'LOCATE'
     PERFORM RECORD-LOCATE
  NONE VALUE
     MOVE BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-READ
  IF MBBSMN0A.BS-ID = 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE MBBSMN0A.BS-ID TO #BS-ID
  MOVE #BS-ID.OG-ID TO #OG-SS.OG-ID
  MOVE #BS-ID.BS-ID TO #OG-SS.BS-ID
  FIND IBS-BS-FILE WITH OG-SS EQ #OG-SS
     IF NO RECORD
        MOVE #BS-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     MBBSMN0A.OG-ID := IBS-BS-FILE.OG-ID
     MBBSMN0A.BS-CODE := IBS-BS-FILE.SS-ID
     MBBSMN0A.BS-NAME := IBS-BS-FILE.NM-BS
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOCATE
  IF MBBSMN0A.BS-CODE EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF MBBSMN0A.OG-ID EQ 0 THEN
     MOVE XXCTXX0A.OG-ID TO MBBSMN0A.OG-ID
  END-IF
  IF MBBSMN0A.OG-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE MBBSMN0A.OG-ID TO #BS-ID.OG-ID
  MOVE MBBSMN0A.BS-CODE TO #BS-ID.BS-ID
  MOVE MBBSMN0A.OG-ID TO #OG-SS.OG-ID
  MOVE MBBSMN0A.BS-CODE TO #OG-SS.BS-ID
  FIND IBS-BS-FILE WITH OG-SS EQ #OG-SS
     IF NO RECORD
        RETURN-CODE := EC-OBJECT-NOT-FOUND
        ESCAPE ROUTINE
     END-NOREC
     MBBSMN0A.OG-ID := IBS-BS-FILE.OG-ID
     MBBSMN0A.BS-CODE := IBS-BS-FILE.SS-ID
     MBBSMN0A.BS-NAME := IBS-BS-FILE.NM-BS
     MBBSMN0A.BS-ID := #BS-ID
  END-FIND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

