**C               *>Natural Source Header 000000
**C               *:NatName MBBSMN0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060529
**C               *:Time 1032000
**C               *<Natural Source Header
**DS          0000      1MBBSMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2OG-ID
**DK          0000P  15 2BS-ID
**DK          0000N   5 2BS-CODE
**DK          0000A  80 2BS-NAME
