* >Natural Source Header 000000 /*<RO>>
* :NatName MBDCHM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070201
* :Time 1133000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — ÔËıÓ‰ÌÓ„Ó Ó‰Â‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBDCHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBDCHM0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C "MBDCHM0A" "DR-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC "DC-NUMBER-ATTR-ID"   "DC-NUMBER"
  INCLUDE XBDRSPDC "DC-DATE-ATTR-ID"     "DC-DATE"
  INCLUDE XBDRSPIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSPIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBDCHM0A
  MOVE UBDRMN0A.OD-ID TO MBDCHM0A.OD-ID
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"   "DC-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"     "DC-DATE"
  INCLUDE XBDRSUIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSUIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C "MBDCHM0A.DD-ID"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

