* >Natural Source Header 000000 /*<RO>>
* :NatName MBDMMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20061108
* :Time 1528000
* <Natural Source Header /*<<RO>
 /***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBDMMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING ASUMGLD
LOCAL
1 #I       (I4)
1 #DM-ID   (N15)
1 REDEFINE #DM-ID
2 BLANK    (N5)
2 OG-ID    (N5)
2 DM-ID    (N5)
END-DEFINE
DEFINE SUBROUTINE MBDMMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE MBDMMN0A.BL-COMMAND
  VALUE 'READ'
     PERFORM READ-RECORD
  VALUE 'CHECK'
     PERFORM CHECK-RECORD
  VALUE 'LOCATE'
     PERFORM LOCATE-RECORD
  NONE VALUE
     MOVE MBDMMN0A.BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
DEFINE SUBROUTINE READ-RECORD
/*  IF MT-OG-ID = 0
/*     *ERROR-NR := EC-OBJECT-ID-REQUIRED
/*  END-IF
  IF MBDMMN0A.DM-ID = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE MBDMMN0A.DM-ID TO #DM-ID
  FIND ASUM-GLD KD-F = #DM-ID.DM-ID AND KK-F = 'GL'
                WHERE OG-F = #DM-ID.OG-ID
     IF NO RECORD
        MOVE MBDMMN0A.DM-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     MBDMMN0A.DM-CODE := ASUM-GLD.KD-F
     MBDMMN0A.DM-NAME := ASUM-GLD.NAMEMAT
     MBDMMN0A.EI-ID := OG-F * 100000 + ASUM-GLD.GM-F
  END-FIND

END-SUBROUTINE
/*
DEFINE SUBROUTINE CHECK-RECORD
  /* ¬€«€¬¿≈Ã
  IF MT-OG-ID = 0
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF MBDMMN0A.DM-ID = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND ASUM-GLD OG-F = MT-OG-ID AND KK-F = 'GL'
                             AND KD-F = MBDMMN0A.DM-ID
     IF NO RECORD
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     IF MBDMMN0A.DM-CODE NE 0
        IF MBDMMN0A.DM-CODE NE ASUM-GLD.KD-F
           *ERROR-NR := EC-RECORD-MISMATCH
        END-IF
     END-IF
     IF MBDMMN0A.DM-NAME NE ' '
        IF MBDMMN0A.DM-NAME NE ASUM-GLD.NAMEMAT
           *ERROR-NR := EC-RECORD-MISMATCH
        END-IF
     END-IF

  END-FIND
     MBDMMN0A.DM-CODE := ASUM-GLD.KD-F
     MBDMMN0A.DM-NAME := ASUM-GLD.NAMEMAT
     MBDMMN0A.EI-ID := MT-OG-ID * 100000 + ASUM-GLD.GM-F
END-SUBROUTINE
/*
DEFINE SUBROUTINE LOCATE-RECORD
  IF MT-OG-ID = 0
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF MBDMMN0A.DM-CODE = 0
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND ASUM-GLD WITH KD-F = MBDMMN0A.DM-CODE AND KK-F = 'GL'
                WHERE OG-F = MT-OG-ID
     IF NO RECORD
        RETURN-CODE := EC-OBJECT-NOT-FOUND
        ESCAPE ROUTINE
     END-NOREC
     #DM-ID.OG-ID := ASUM-GLD.OG-F
     #DM-ID.DM-ID := ASUM-GLD.KD-F
     MBDMMN0A.DM-ID := #DM-ID
     MBDMMN0A.DM-CODE := ASUM-GLD.KD-F
     MBDMMN0A.DM-NAME := ASUM-GLD.NAMEMAT
     MBDMMN0A.EI-ID := MT-OG-ID * 100000 + ASUM-GLD.GM-F
  END-FIND
END-SUBROUTINE

INCLUDE XXERSY1C
END-SUBROUTINE

END




