**C               *>Natural Source Header 000000
**C               *:NatName MBDMMN0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20061108
**C               *:Time 1526000
**C               *<Natural Source Header
**DS          0000      1MBDMMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  13 2DM-ID
**DK          0000N   5 2DM-CODE
**DK          0000A  44 2DM-NAME
**DK          0000P  15 2EI-ID
