* >Natural Source Header 000000 /*<RO>>
* :NatName MBDNMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060529
* :Time 2046000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — ÕŒÃ≈–¿Ã» ƒŒ ”Ã≈Õ“Œ¬
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBDNMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
/*
END-DEFINE
DEFINE SUBROUTINE MBDNMN0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE MBDNMN0A.BL-COMMAND
  VALUE 'NEW'
     PERFORM NEW-NUMBER
  NONE VALUE
     MOVE MBDNMN0A.BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC '10003' 'DN-MO-ID'
  INCLUDE XBDRSPIC '10004' 'DN-YYYY'
  INCLUDE XBDRSPIC '10005' 'DN-NUMBER'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  INCLUDE XBDRSUIC '10003' 'DN-MO-ID'
  INCLUDE XBDRSUIC '10004' 'DN-YYYY'
  INCLUDE XBDRSUIC '10005' 'DN-NUMBER'
END-SUBROUTINE
/*
DEFINE SUBROUTINE NEW-NUMBER
  IF DN-MO-ID = 0 THEN
     MOVE 'DN-MO-ID' TO ERROR-ADDITION(1)
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  IF DN-YYYY = 0 THEN
     MOVE 'DN-YYYY' TO ERROR-ADDITION(1)
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  UBDRMN0A.BL-COMMAND := 'LOCATE'
  UBDRMN0A.DR-TYPE-ID := 9001
  PERFORM RECORD-PACK
  PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
  IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
     UBDRMN0A.BL-COMMAND := 'ADD'
     PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  ELSE IF RETURN-CODE NE 0 THEN
     *ERROR-NR := EC-QUIT-STACK-TRACE
  END-IF END-IF
  PERFORM RECORD-UNPACK
  ADD 1 TO DN-NUMBER
  PERFORM RECORD-PACK
  UBDRMN0A.BL-COMMAND := 'UPDATE'
  PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

