**C               *>Natural Source Header 000000
**C               *:NatName MBDNMN0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060502
**C               *:Time 1936000
**C               *<Natural Source Header
**DS          0000      1MBDNMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2DN-MO-ID
**DK          0000N   4 2DN-YYYY
**DK          0000N   6 2DN-NUMBER
