* >Natural Source Header 000000 /*<RO>>
* :NatName MBDVMN0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20060719
* :Time 1910000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - ADD
/*  - CHEK
/*  - LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBDVMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XBLTMN0A
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
END-DEFINE
DEFINE SUBROUTINE MBDVMN0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C 'MBDVMN0A' 'DV-ID'
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC '10000' 'DV-NUMBER'
  INCLUDE XBDRSPDC '10001' 'DV-DATE'
  INCLUDE XBDRSPIC '10023' 'TB-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  INCLUDE XBDRSUAC '10000' 'DV-NUMBER'
  INCLUDE XBDRSUDC '10001' 'DV-DATE'
  INCLUDE XBDRSUIC '10023' 'TB-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1400'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
