* >Natural Source Header 000000 /*<RO>>
* :NatName MBEIMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20081215
* :Time 0241000
* <Natural Source Header /*<<RO>
 /***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - READ
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBEIMN0A
LOCAL USING XXXXEC0L
LOCAL USING ASUM-IZ
LOCAL
1 #I       (I4)
1 #EI-ID   (N15)
1 REDEFINE #EI-ID
2 BLANK       (N5)
2 OG-ID       (N5)
2 EI-ID       (N5)
1 #OG-ID      (N5)
END-DEFINE
DEFINE SUBROUTINE MBEIMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE BL-COMMAND
  VALUE 'READ'
     PERFORM READ-RECORD
  VALUE 'CHEK'
     PERFORM CHEK-RECORD
  VALUE 'LOCATE'
     PERFORM LOCATE-RECORD
  NONE VALUE
     MOVE BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE READ-RECORD
  IF MBEIMN0A.EI-ID = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
/*  IF MT-OG-ID = 0
/*        *ERROR-NR := EC-OBJECT-ID-REQUIRED
/*  END-IF
  MOVE MBEIMN0A.EI-ID TO #EI-ID
  #OG-ID := #EI-ID.OG-ID
  FIND ASUM-EDIZ KD-F = #EI-ID.EI-ID AND
                 KK-F = 'EZ' AND
                 OG-F = #OG-ID
     IF NO RECORD
        MOVE MBEIMN0A.EI-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
  END-FIND
  MBEIMN0A.EI-CODE := ASUM-EDIZ.KD-F
  MBEIMN0A.EI-SHORT-NAME := ASUM-EDIZ.SH-NM
END-SUBROUTINE
/*
DEFINE SUBROUTINE CHEK-RECORD
  /* ¬€«€¬¿≈Ã
  IF MBEIMN0A.EI-ID = 0
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF MBEIMN0A.MT-OG-ID = 0
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND ASUM-EDIZ OG-F = MBEIMN0A.MT-OG-ID AND KK-F = 'EZ'
                             AND KD-F = MBEIMN0A.EI-ID
     IF NO RECORD
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     IF MBEIMN0A.EI-CODE NE 0
        IF MBEIMN0A.EI-CODE NE ASUM-EDIZ.KD-F
           *ERROR-NR := EC-RECORD-MISMATCH
        END-IF
     END-IF
     IF MBEIMN0A.EI-SHORT-NAME NE ' '
        IF MBEIMN0A.EI-SHORT-NAME NE ASUM-EDIZ.SH-NM
           *ERROR-NR := EC-RECORD-MISMATCH
        END-IF
     END-IF
  END-FIND
     MBEIMN0A.EI-CODE := ASUM-EDIZ.KD-F
     MBEIMN0A.EI-SHORT-NAME := ASUM-EDIZ.SH-NM
END-SUBROUTINE
/*
DEFINE SUBROUTINE LOCATE-RECORD
  IF MBEIMN0A.MT-OG-ID = 0
     MBEIMN0A.MT-OG-ID := XXCTXX0A.MT-OG-ID
  END-IF
  IF MBEIMN0A.MT-OG-ID = 0
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND ASUM-EDIZ KD-F = MBEIMN0A.EI-CODE AND KK-F = 'EZ'
                             AND OG-F = MBEIMN0A.MT-OG-ID
     IF NO RECORD
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     #EI-ID.OG-ID := OG-F
     MOVE KD-F TO #EI-ID.EI-ID
     MBEIMN0A.EI-ID   := #EI-ID
     MBEIMN0A.EI-CODE := ASUM-EDIZ.KD-F
     MBEIMN0A.EI-SHORT-NAME := ASUM-EDIZ.SH-NM
  END-FIND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END




