**C               *>Natural Source Header 000000
**C               *:NatName MBEIMN0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060526
**C               *:Time 1110000
**C               *<Natural Source Header
**DS          0000      1MBEIMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2MT-OG-ID
**DK          0000P  15 2EI-ID
**DK          0000N   5 2EI-CODE
**DK          0000A   5 2EI-SHORT-NAME
