**C               *>Natural Source Header 000000
**C               *:NatName MBGMMN0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060930
**C               *:Time 1417000
**C               *<Natural Source Header
**DS          0000      1MBGMMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2GM-ID
**DK          0000N   5 2GM-CODE
**DK          0000A  60 2GM-NAME
**DK          0000A  10 2GM-METHOD
