* >Natural Source Header 000000 /*<RO>>
* :NatName MBGMMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060930
* :Time 1428000
* <Natural Source Header /*<<RO>
/* √–”œœ€ Ã¿“≈–»¿ÀŒ¬
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBGMMN0A
LOCAL USING CXGMS0DL
LOCAL USING ASUMGMAT
LOCAL USING XXXXEC0L
LOCAL
1 KEY1(A12)
1 REDEFINE KEY1
  2 KEYOG1(N5)            /*  KOƒ
  2 KEYKK1(A2)            /*  METKA
  2 KEYKD1(N5)            /*   Œƒ √–”œœ€
1 #I     (I4)
1 #GM-ID1      (N15)
1 REDEFINE #GM-ID1
2 BLANK       (N5)
2 OG-ID       (N5)
2 GM-CODE     (N5)
END-DEFINE
DEFINE SUBROUTINE MBGMMN0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE BL-COMMAND
  VALUE "READ"
     PERFORM RECORD-READ
  VALUE "LOCATE"
     PERFORM RECORD-LOCATE
  NONE VALUE
     MOVE BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-EXTEND
  MBGMMN0A.GM-ID := ASUMGMAT.OG-F * 100000 + ASUMGMAT.KD-F
  MOVE ASUMGMAT.KD-F TO MBGMMN0A.GM-CODE
  MOVE ASUMGMAT.NMGROUP TO MBGMMN0A.GM-NAME
  MOVE "LT" TO MBGMMN0A.GM-METHOD
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  IF MBGMMN0A.GM-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  MOVE MBGMMN0A.GM-ID TO #GM-ID1
  MOVE "MA" TO KEYKK1
  MOVE #GM-ID1.OG-ID TO KEYOG1
  MOVE #GM-ID1.GM-CODE TO KEYKD1
  FIND ASUMGMAT WITH TP-Y = KEY1
     IF NO RECORDS
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     PERFORM RECORD-EXTEND
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOCATE
  MOVE "MA" TO KEYKK1
  MOVE XXCTXX0A.MT-OG-ID TO KEYOG1
  MOVE MBGMMN0A.GM-CODE TO KEYKD1
F1. FIND ASUMGMAT WITH TP-Y = KEY1
     IF NO RECORDS
        RETURN-CODE := EC-OBJECT-NOT-FOUND
        ESCAPE ROUTINE
     END-NOREC
     PERFORM RECORD-EXTEND
  END-FIND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

