* >Natural Source Header 000000 /*<RO>>
* :NatName MBLKHM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20080303
* :Time 0155000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — «¿√ŒÀŒ¬ ŒÃ œ–»’ŒƒÕŒ√Œ Œ–ƒ≈–¿
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBLKHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL USING MXDRAT0L
/*
LOCAL USING UDDRSH0A
/*
LOCAL
1 #DT-START-A   (A8)
1 REDEFINE #DT-START-A
2 #DT-START-N     (N8)
1 REDEFINE #DT-START-A
2 #DT-START-YYYY     (N4)
2 #DT-START-MMDD     (N4)
/*
1 #DT-STOP-A    (A8)
1 REDEFINE #DT-STOP-A
2 #DT-STOP-N         (N8)
1 REDEFINE #DT-STOP-A
2 #DT-STOP-YYYY      (N4)
2 #DT-STOP-MMDD      (N4)
END-DEFINE
DEFINE SUBROUTINE MBLKHM0S
RESET XXERX00A
/*
IF MBLKHM0A.BL-COMMAND EQ "LOC2" THEN
  UDDRSH0A.DL-COMMAND := "QUERY"
  UDDRSH0A.DD-ID := 1500
  UDDRSH0A.SH-RETAIN := *PROGRAM
/*SH-NUMBER
/*UDDRSH0A-SH-C
  UDDRSH0A-SH-C := 1
/*
  UDDRSH0A.SH-AT-ID(1,1) := DC-NUMBER-ATTR-ID
  UDDRSH0A.SH-OPER(1) := "SE"
  UDDRSH0A.SH-VALUE-A(1) := MBLKHM0A.LK-NUMBER
/*
  UDDRSH0A.SH-AT-ID(2,1) := DC-DATE-ATTR-ID
  UDDRSH0A.SH-OPER(2) := "TH"
  MOVE EDITED MBLKHM0A.LK-DT-START (EM=YYYYMMDD) TO #DT-START-A
  MOVE EDITED MBLKHM0A.LK-DT-STOP (EM=YYYYMMDD) TO #DT-STOP-A
  #DT-START-MMDD := 0101
  #DT-STOP-MMDD := 1231
  UDDRSH0A.SH-VALUE-P(2,1) := #DT-START-N
  UDDRSH0A.SH-VALUE-P(2,2) := #DT-STOP-N
/*
  PERFORM UDDRSH0S XXERX00A UDDRSH0A
  IF RETURN-CODE < 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*  WRITE *PROGRAM SH-NUMBER / UDDRSH0A.SH-OPER(1) UDDRSH0A.SH-VALUE-A(1) /
/*        UDDRSH0A.SH-OPER(2) UDDRSH0A.SH-VALUE-P(2,1) UDDRSH0A.SH-VALUE-P(2,2)
/*
  UDDRSH0A.DL-COMMAND := "FIRST"
  PERFORM UDDRSH0S XXERX00A UDDRSH0A
  IF RETURN-CODE < 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
  UDDRSH0A.DL-COMMAND := "CLOSE"
  PERFORM UDDRSH0S XXERX00A UDDRSH0A
  IF RETURN-CODE < 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
  IF UDDRSH0A.DR-ID EQ 0 THEN
     RETURN-CODE := EC-OBJECT-NOT-FOUND
     ESCAPE ROUTINE
  END-IF
  MOVE "READ" TO MBLKHM0A.BL-COMMAND
  MOVE UDDRSH0A.DR-ID TO MBLKHM0A.LK-ID
END-IF
/*
INCLUDE MBXXMN1C "MBLKHM0A" "LK-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC "DC-NUMBER-ATTR-ID"   "LK-NUMBER"
  INCLUDE XBDRSPDC "DC-DATE-ATTR-ID"     "LK-DATE"
  INCLUDE XBDRSPDC "DR-DT-START-ATTR-ID" "LK-DT-START"
  INCLUDE XBDRSPDC "DR-DT-STOP-ATTR-ID"  "LK-DT-STOP"
  INCLUDE XBDRSP7C "DR-PLAN-COL-ATTR-ID" "LK-COL"
  INCLUDE XBDRSPIC "DR-PLAN-EI-ATTR-ID"  "EI-ID"
  INCLUDE XBDRSP7C "DR-NORM-COL-ATTR-ID" "LK-NORM-COL"
  INCLUDE XBDRSP2C "DR-CENA-ATTR-ID"     "LK-CENA"
  INCLUDE XBDRSPAC "DR-COMMENT-ATTR-ID"  "LK-PRIM"
  INCLUDE XBDRSPIC "DR-MT-ATTR-ID"       "MT-ID"
  INCLUDE XBDRSPIC "DR-ZK-ATTR-ID"       "ZK-ID"
  INCLUDE XBDRSPIC "DR-DP-ATTR-ID"       "DP-ID"
  INCLUDE XBDRSPIC "DR-MO-ATTR-ID"       "MO-ID"
  INCLUDE XBDRSPAC "DR-LK-UZEL-ATTR-ID"  "LK-UZEL"
  INCLUDE XBDRSPAC "DR-LK-PRIZNAK-ATTR-ID" "LK-PRIZNAK"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBLKHM0A
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"   "LK-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"     "LK-DATE"
  INCLUDE XBDRSUDC "DR-DT-START-ATTR-ID" "LK-DT-START"
  INCLUDE XBDRSUDC "DR-DT-STOP-ATTR-ID"  "LK-DT-STOP"
  INCLUDE XBDRSU7C "DR-PLAN-COL-ATTR-ID" "LK-COL"
  INCLUDE XBDRSUIC "DR-PLAN-EI-ATTR-ID"  "EI-ID"
  INCLUDE XBDRSU7C "DR-NORM-COL-ATTR-ID" "LK-NORM-COL"
  INCLUDE XBDRSU2C "DR-CENA-ATTR-ID"     "LK-CENA"
  INCLUDE XBDRSUAC "DR-COMMENT-ATTR-ID"  "LK-PRIM"
  INCLUDE XBDRSUIC "DR-MT-ATTR-ID"       "MT-ID"
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID"       "ZK-ID"
  INCLUDE XBDRSUIC "DR-DP-ATTR-ID"       "DP-ID"
  INCLUDE XBDRSUIC "DR-MO-ATTR-ID"       "MO-ID"
  INCLUDE XBDRSUAC "DR-LK-UZEL-ATTR-ID"  "LK-UZEL"
  INCLUDE XBDRSUAC "DR-LK-PRIZNAK-ATTR-ID" "LK-PRIZNAK"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C "1500"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
