* >Natural Source Header 000000 /*<RO>>
* :NatName MBLKSH0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070821
* :Time 2037000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ÔÓËÒÍ Ò‡Î¸‰Ó Ë Á‡ÔÓÎÌÂÌËÂ ÒÚÂÍ‡
/*
/*  ŒÃ¿Õƒ€:
/*   ADD
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBLKST0A
PARAMETER USING MBLKSH0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UXXXEC0L
LOCAL USING XXSTMN0L
LOCAL USING MBLKST0L
/*
LOCAL USING MXDRAT0L
LOCAL USING XBDRSX0L
/*
LOCAL USING UBDRMN0A
LOCAL USING UDDRMN0L
LOCAL USING UDDRSH0A
/*LOCAL USING UDSASH0L
LOCAL USING MBLKRM0A
/*
LOCAL
1 #I          (I4)
1 #CRITERY    (I4)
END-DEFINE
DEFINE SUBROUTINE MBLKSH0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE MBLKSH0A.BL-COMMAND
VALUE "SEARCH"
  PERFORM RECORD-SEARCH
NONE VALUE
  MOVE MBLKSH0A.BL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
INCLUDE UDDRSH0C "PROCESS-RESULT" "RECORD-PROCESS"
/*
DEFINE SUBROUTINE RECORD-SEARCH
  IF MBLKST0A.STACK-COUNT EQ 0 THEN
     PERFORM LK-STACK-INIT
     IF RETURN-CODE NE 0 THEN *ERROR-NR := RETURN-CODE END-IF
  END-IF
  IF *USER EQ "ARMK01" THEN
     WRITE MBLKSH0A.LK-NUMBER MBLKSH0A.LK-NUMBER LK-DT-WORK
           MBLKSH0A.MT-ID MBLKSH0A.ZK-ID MBLKSH0A.DP-ID MBLKSH0A.MO-ID
  END-IF
  RESET UDDRSH0A #CRITERY
  IF MBLKSH0A.LK-NUMBER NE " " THEN
     ADD 1 TO #CRITERY
     MOVE "SE" TO SH-OPER(#CRITERY)
     MOVE DC-NUMBER-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE MBLKSH0A.LK-NUMBER TO SH-VALUE-A(#CRITERY)
  END-IF
  IF MBLKSH0A.LK-DT-START NE 0 THEN
     ADD 1 TO #CRITERY
     MOVE "TH" TO SH-OPER(#CRITERY)
     MOVE DC-DATE-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE EDITED MBLKSH0A.LK-DT-START (EM=YYYYMMDD) TO SX-DATE-VALUE
     MOVE SX-DATE-NUMBER TO SH-VALUE-P(#CRITERY,1)
     MOVE EDITED MBLKSH0A.LK-DT-STOP (EM=YYYYMMDD) TO SX-DATE-VALUE
     MOVE SX-DATE-NUMBER TO SH-VALUE-P(#CRITERY,2)
  END-IF
  IF LK-DT-WORK NE 0 THEN
     ADD 1 TO #CRITERY
     MOVE "IN" TO SH-OPER(#CRITERY)
     MOVE DR-DT-START-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE DR-DT-STOP-ATTR-ID TO SH-AT-ID(#CRITERY,2)
     MOVE EDITED MBLKSH0A.LK-DT-WORK (EM=YYYYMMDD) TO SX-DATE-VALUE
     MOVE SX-DATE-NUMBER TO SH-VALUE-P(#CRITERY,1)
  END-IF
  IF MBLKSH0A.MT-ID NE 0 THEN
     ADD 1 TO #CRITERY
     MOVE "EQ" TO SH-OPER(#CRITERY)
     MOVE DR-MT-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE MBLKSH0A.MT-ID TO SH-VALUE-P(#CRITERY,1)
  END-IF
  IF MBLKSH0A.ZK-ID NE 0 THEN
     ADD 1 TO #CRITERY
     MOVE "EQ" TO SH-OPER(#CRITERY)
     MOVE DR-ZK-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE MBLKSH0A.ZK-ID TO SH-VALUE-P(#CRITERY,1)
  END-IF
  IF MBLKSH0A.DP-ID NE 0 THEN
     ADD 1 TO #CRITERY
     MOVE "EQ" TO SH-OPER(#CRITERY)
     MOVE DR-DP-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE MBLKSH0A.DP-ID TO SH-VALUE-P(#CRITERY,1)
  END-IF
  IF MBLKSH0A.MO-ID NE 0 THEN
     ADD 1 TO #CRITERY
     MOVE "EQ" TO SH-OPER(#CRITERY)
     MOVE DR-MO-ATTR-ID TO SH-AT-ID(#CRITERY,1)
     MOVE MBLKSH0A.MO-ID TO SH-VALUE-P(#CRITERY,1)
  END-IF
  IF #CRITERY EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  /*
  MOVE XXCTXX0A.TX-ID TO UDDRSH0A.TX-ID
  MOVE 1500 TO UDDRSH0A.DD-ID
  MOVE *PROGRAM TO UDDRSH0A.SH-RETAIN
  MOVE "QUERY" TO UDDRSH0A.DL-COMMAND
  PERFORM UDDRSH0S XXERX00A UDDRSH0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  /*
  PERFORM PROCESS-RESULT
  /*
  MOVE XXCTXX0A.TX-ID TO UDDRSH0A.TX-ID
  MOVE "CLOSE" TO UDDRSH0A.DL-COMMAND
  PERFORM UDDRSH0S XXERX00A UDDRSH0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  /*
  IF MBLKST0A.STACK-LEN EQ 0 THEN
     RETURN-CODE := EC-OBJECT-NOT-FOUND
  END-IF
  FOR #I = 1 TO MBLKST0A.STACK-LEN
     MOVE #I TO MBLKST0L.STACK-POS
     PERFORM LK-READ
  END-ALL
  SORT MBLKST0L.LK-NUMBER USING MBLKST0L.STACK-REC-B(*)
     AT START DATA
        RESET MBLKST0L.STACK-POS-I
     END-START
     ADD 1 TO MBLKST0L.STACK-POS-I
     MOVE MBLKST0L.STACK-POS-I TO MBLKST0L.STACK-POS
     PERFORM LK-WRITE
  END-SORT
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-PROCESS
  RESET MBLKST0L.STACK-REC-G
  MOVE UBDRMN0A.DR-ID TO MBLKST0L.LK-ID
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"      "MBLKST0L.LK-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"        "MBLKST0L.LK-DATE"
  INCLUDE XBDRSUDC "DR-DT-START-ATTR-ID"    "MBLKST0L.LK-DT-START"
  INCLUDE XBDRSUDC "DR-DT-STOP-ATTR-ID"     "MBLKST0L.LK-DT-STOP"
  INCLUDE XBDRSU7C "DR-PLAN-COL-ATTR-ID"    "MBLKST0L.LK-COL"
  INCLUDE XBDRSUIC "DR-PLAN-EI-ATTR-ID"     "MBLKST0L.EI-ID"
  INCLUDE XBDRSU7C "DR-NORM-COL-ATTR-ID"    "MBLKST0L.LK-NORM-COL"
  INCLUDE XBDRSU2C "DR-CENA-ATTR-ID"        "MBLKST0L.LK-CENA"
  INCLUDE XBDRSUAC "DR-COMMENT-ATTR-ID"     "MBLKST0L.LK-PRIM"
  INCLUDE XBDRSUIC "DR-MT-ATTR-ID"          "MBLKST0L.MT-ID"
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID"          "MBLKST0L.ZK-ID"
  INCLUDE XBDRSUIC "DR-DP-ATTR-ID"          "MBLKST0L.DP-ID"
  INCLUDE XBDRSUIC "DR-MO-ATTR-ID"          "MBLKST0L.MO-ID"
  INCLUDE XBDRSUAC "DR-LK-UZEL-ATTR-ID"     "MBLKST0L.LK-UZEL"
  INCLUDE XBDRSUAC "DR-LK-PRIZNAK-ATTR-ID"  "MBLKST0L.LK-PRIZNAK"
  /*
  MOVE MBLKST0L.LK-ID TO MBLKRM0A.LKR-ID
  MOVE "READ-TR" TO MBLKRM0A.BL-COMMAND
  PERFORM MBLKRM0S XXERX00A XXCTXX0A MBLKRM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBLKRM0A.PLAN-COL TO MBLKST0L.LKR-PLAN-COL
  /*
  IF MBLKSH0A.STATUS EQ " " OR
     MBLKSH0A.STATUS EQ "0"  AND MBLKST0L.LKR-PLAN-COL =   0 OR
     MBLKSH0A.STATUS EQ "<"  AND MBLKST0L.LKR-PLAN-COL <   MBLKST0L.LK-COL OR
     MBLKSH0A.STATUS EQ "<=" AND MBLKST0L.LKR-PLAN-COL <=  MBLKST0L.LK-COL OR
     MBLKSH0A.STATUS EQ "="  AND MBLKST0L.LKR-PLAN-COL =   MBLKST0L.LK-COL OR
     MBLKSH0A.STATUS EQ ">=" AND MBLKST0L.LKR-PLAN-COL >=  MBLKST0L.LK-COL OR
     MBLKSH0A.STATUS EQ ">"  AND MBLKST0L.LKR-PLAN-COL >   MBLKST0L.LK-COL THEN
     PERFORM LK-PUSH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXSTMN4C "MBLKST0A" "MBLKST0L-CONST" "MBLKST0L"
        "LK-STACK-INIT" "LK-STACK-FREE" "LK-STACK-REALLOC"
        "LK-PUSH" "LK-READ" "LK-WRITE" "LK-LOCATE"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
