* >Natural Source Header 000000 /*<RO>>
* :NatName MBLKRM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — ÔËıÓ‰ÌÓ„Ó Ó‰Â‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBLKRM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBLKRM0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBLKRM0A.LKH-ID
/*
INCLUDE MBXXMN1C "MBLKRM0A" "LKR-ID"
/*
MBLKRM0A.LKH-ID := UBDRMN0A.DR-UP-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC "DR-GM-ATTR-ID"          "GM-ID"
  INCLUDE XBDRSPIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSPIC "DR-MO-OUT-ATTR-ID"      "OUT-MO-ID"
  INCLUDE XBDRSPDC "DR-RL-DATE-ATTR-ID"     "RL-DATE"
  INCLUDE XBDRSPIC "DR-DOC-RL-ATTR-ID"      "RL-ID"
  INCLUDE XBDRSPIC "DR-MT-ATTR-ID"          "MT-ID"
  INCLUDE XBDRSPIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSP2C "DR-CENA-ATTR-ID"        "CENA"
  INCLUDE XBDRSP2C "DR-CENA-SUMMA-ATTR-ID"  "CENA-SUMMA"
  INCLUDE XBDRSP7C "DR-PRIH-COL-ATTR-ID"    "PRIH-COL"
  INCLUDE XBDRSPIC "DR-PRIH-EI-ATTR-ID"     "PRIH-EI-ID"
  INCLUDE XBDRSP7C "DR-PLAN-COL-ATTR-ID"    "PLAN-COL"
  INCLUDE XBDRSPIC "DR-PLAN-EI-ATTR-ID"     "PLAN-EI-ID"
  INCLUDE XBDRSP7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSPIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBLKRM0A
  INCLUDE XBDRSUIC "DR-GM-ATTR-ID"          "GM-ID"
  INCLUDE XBDRSUIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSUIC "DR-MO-OUT-ATTR-ID"      "OUT-MO-ID"
  INCLUDE XBDRSUDC "DR-RL-DATE-ATTR-ID"     "RL-DATE"
  INCLUDE XBDRSUIC "DR-DOC-RL-ATTR-ID"      "RL-ID"
  INCLUDE XBDRSUIC "DR-MT-ATTR-ID"          "MT-ID"
  INCLUDE XBDRSUIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSU2C "DR-CENA-ATTR-ID"        "CENA"
  INCLUDE XBDRSU2C "DR-CENA-SUMMA-ATTR-ID"  "CENA-SUMMA"
  INCLUDE XBDRSU7C "DR-PRIH-COL-ATTR-ID"    "PRIH-COL"
  INCLUDE XBDRSUIC "DR-PRIH-EI-ATTR-ID"     "PRIH-EI-ID"
  INCLUDE XBDRSU7C "DR-PLAN-COL-ATTR-ID"    "PLAN-COL"
  INCLUDE XBDRSUIC "DR-PLAN-EI-ATTR-ID"     "PLAN-EI-ID"
  INCLUDE XBDRSU7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSUIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IF MT-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  IF OUT-MO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
/*  IF DT-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  IF RL-DATE EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  IF PR-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  IF PLAN-COL EQ 0 THEN *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED  END-IF
  IF PLAN-EI-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  IF BASE-COL EQ 0 THEN *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED  END-IF
  IF BASE-EI-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  IF MBLKRM0A.BL-COMMAND EQ "UPDATE" THEN
     IF RL-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED  END-IF
  END-IF
END-SUBROUTINE
/*
INCLUDE MBXXMN0C "1501"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

