* >Natural Source Header 000000 /*<RO>>
* :NatName MBMTSA1S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070106
* :Time 2039000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: ÔÓËÒÍ lifo fifo ÓÒÚ‡ÚÍÓ‚ ÔÓ Ï‡ÚÂË‡ÎÛ
/*
/*  ŒÃ¿Õƒ€:
/*   ADD
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBSAST0A
PARAMETER USING MBMTSA1A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XXSTMN0L
LOCAL USING MBSAST0L
LOCAL USING MBSASH0A
LOCAL
1 #IS-REVERSE    (L)
1 #I             (I4)
1 #SORT-DT       (P15)
1 #SORT-PR       (P15)
1 #IS-FOUND      (L)
END-DEFINE
DEFINE SUBROUTINE MBMTSA1S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE MBMTSA1A.BL-COMMAND
VALUE "FIFO"
  PERFORM SALDO-SEARCH
VALUE "LIFO"
  #IS-REVERSE := TRUE
  PERFORM SALDO-SEARCH
NONE VALUE
  MOVE MBMTSA1A.BL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE SALDO-SEARCH
/*  IF MBMTSA1A.MO-ID EQ 0 THEN
/*     *ERROR-NR := EC-OBJECT-ID-REQUIRED
/*  END-IF
/*  IF MBMTSA1A.MT-ID EQ 0 THEN
/*     *ERROR-NR := EC-OBJECT-ID-REQUIRED
/*  END-IF
  MOVE BY NAME MBMTSA1A TO MBSASH0A
  MOVE "SEARCH" TO MBSASH0A.BL-COMMAND
  PERFORM MBSASH0S XXERX00A XXCTXX0A MBSASH0A MBSAST0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  FOR #I = 1 TO STACK-LEN
     MOVE #I TO STACK-POS
     CALL "RWSX" STACK-POS STACK-REC-B(1) STACK-READ  STACK-NUMBER
     IF #IS-REVERSE THEN
        #SORT-DT := MBSAST0L.DT-ID * -1
        #SORT-PR := MBSAST0L.PR-ID * -1
     ELSE
        #SORT-DT := MBSAST0L.DT-ID
        #SORT-PR := MBSAST0L.PR-ID
     END-IF
  END-ALL
  SORT #SORT-DT #SORT-PR USING STACK-REC-B(*)
     AT START DATA
        RESET STACK-LEN
     END-START
     IF MBMTSA1A.PRIH-EI-ID NE 0 AND
        MBMTSA1A.PRIH-EI-ID NE MBSAST0L.PRIH-EI-ID THEN
        ESCAPE TOP
     END-IF
     IF MBMTSA1A.BASE-EI-ID NE 0 AND
        MBMTSA1A.BASE-EI-ID NE MBSAST0L.BASE-EI-ID THEN
        ESCAPE TOP
     END-IF
     IF MBMTSA1A.PLAN-EI-ID NE 0 AND
        MBMTSA1A.PLAN-EI-ID NE MBSAST0L.PLAN-EI-ID THEN
        ESCAPE TOP
     END-IF
/*     WRITE *PROGRAM MBSAST0L.BASE-COL
/*     IF MBSAST0L.BASE-COL NE 0 THEN
     ADD 1 TO STACK-LEN
     MOVE STACK-LEN TO STACK-POS
     CALL "RWSX" STACK-POS STACK-REC-B(1) STACK-WRITE STACK-NUMBER
/*     END-IF
  END-SORT
  IF STACK-LEN = 0 THEN
     RETURN-CODE := EC-OBJECT-NOT-FOUND
  END-IF
END-SUBROUTINE
/*
INCLUDE XXSTMN4C "MBSAST0A" "MBSAST0L-CONST" "MBSAST0L"
        "STACK-INIT" "STACK-FREE" "STACK-REALLOC"
        "STACK-PUSH" "STACK-READ" "STACK-WRITE" "STACK-LOCATE"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

