* >Natural Source Header 000000 /*<RO>>
* :NatName MBMZMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070109
* :Time 1418000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿: XBPRMN0S
/*
/* –¿«–¿¡Œ“◊» :   Œ¬¿À‹◊”  Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*   - ADD
/*   - READ
/*   - UPDADE
/*   - DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBMZMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MDMZMN0A
END-DEFINE
DEFINE SUBROUTINE MBMZMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE MBMZMN0A.BL-COMMAND
  VALUE "ADD"
     PERFORM RECORD-ADD
  VALUE "READ"
     PERFORM RECORD-READ
  VALUE "LOCATE"
     PERFORM RECORD-LOCATE
  VALUE "CHANGE"
     PERFORM RECORD-CHANGE
  VALUE "UPDATE"
     PERFORM RECORD-UPDATE
  VALUE "DELETE"
     PERFORM RECORD-DELETE
  NONE VALUE
     MOVE MBMZMN0A.BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-PREPARE
  IF MBMZMN0A.FROM-MT-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF MBMZMN0A.TO-MT-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF MBMZMN0A.ZK-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF MBMZMN0A.COL = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-ADD
  PERFORM RECORD-PREPARE
  MOVE *DATX TO MBMZMN0A.MZ-DATE-CREATED
  MOVE BY NAME MBMZMN0A TO MDMZMN0A
  MOVE "ADD" TO MDMZMN0A.DL-COMMAND
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDMZMN0A TO MBMZMN0A
/*
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHANGE
  MOVE BY NAME MBMZMN0A TO MDMZMN0A
  MOVE "CHANGE" TO MDMZMN0A.DL-COMMAND
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
     MOVE "ADD" TO MDMZMN0A.DL-COMMAND
  ELSE IF RETURN-CODE EQ 0 THEN
     MOVE MDMZMN0A.MZ-ID TO MBMZMN0A.MZ-ID
     MOVE BY NAME MBMZMN0A TO MDMZMN0A
     MOVE "UPDATE" TO MDMZMN0A.DL-COMMAND
  ELSE
     *ERROR-NR := EC-QUIT-STACK-TRACE
  END-IF END-IF
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDMZMN0A TO MBMZMN0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOCATE
  MOVE BY NAME MBMZMN0A TO MDMZMN0A
  MOVE "LOCATE" TO MDMZMN0A.DL-COMMAND
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
        ESCAPE ROUTINE
     ELSE
        *ERROR-NR := EC-QUIT-STACK-TRACE
     END-IF
  END-IF
  MOVE BY NAME MDMZMN0A TO MBMZMN0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  MOVE MBMZMN0A.MZ-ID TO MDMZMN0A.MZ-ID
  MOVE "READ" TO MDMZMN0A.DL-COMMAND
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDMZMN0A TO MBMZMN0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UPDATE
  PERFORM RECORD-PREPARE
  MOVE BY NAME MBMZMN0A TO MDMZMN0A
  MOVE "UPDATE" TO MDMZMN0A.DL-COMMAND
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDMZMN0A TO MBMZMN0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-DELETE
  MOVE BY NAME MBMZMN0A TO MDMZMN0A
  MOVE "DELETE" TO MDMZMN0A.DL-COMMAND
  PERFORM MDMZMN0S XXERX00A MDMZMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
