**C               *>Natural Source Header 000000
**C               *:NatName MBOSDL0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070304
**C               *:Time 1204000
**C               *<Natural Source Header
**DS          0000      1MBOSDL0A
**DK          0000P  15 2CVT-MO-ID
**DK          0000D     2DT-START
**DK          0000D     2DT-STOP
