**C               *>Natural Source Header 000000
**C               *:NatName MBOSXS0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070304
**C               *:Time 1208000
**C               *<Natural Source Header
**DS          0000      1MBOSXS0A
**DK          0000B   4 2STACK-NUMBER
**DK          0000I   4 2STACK-COUNT
**DK          0000I   4 2STACK-LEN
**DK          0000I   4 2STACK-ID
