* >Natural Source Header 000000 /*<RO>>
* :NatName MBOTMT1C
* :UID PAUL
* :Mode S
* :CP
* :Date 20061101
* :Time 1804000
* <Natural Source Header /*<<RO>
  IF CXMTS0DL.MT-CODE NE ' '
     MOVE CXMTS0DL.MT-CODE TO XPOTMT0L.MT-CODE(#I)
     MOVE CXMTS0DL.MT-NAME TO XPOTMT0L.MT-NAME(#I)
     MOVE CXMTS0DL.MT-ID TO XPOTMT0L.MT-ID(#I)
     RESET XPOTMT0L.OT-CMD-C(#I)
  ELSE
     MOVE '0' TO  XPOTMT0L.MT-CODE(#I)
     MOVE 'Не определен' TO XPOTMT0L.MT-NAME(#I)
  END-IF




