* >Natural Source Header 000000 /*<RO>>
* :NatName MBOTGM1C
* :UID Админист
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
     MOVE CXGMS0DL.GM-CODE TO XPOTGM0L.GM-CODE(#I)
     MOVE CXGMS0DL.GM-NAME TO XPOTGM0L.GM-NAME(#I)
     MOVE CXGMS0DL.GM-ID TO XPOTGM0L.GM-ID(#I)
     RESET XPOTGM0L.OT-CMD-C(#I)

