* >Natural Source Header 000000 /*<RO>>
* :NatName MBOTBS1C
* :UID PAUL
* :Mode S
* :CP
* :Date 20061101
* :Time 1806000
* <Natural Source Header /*<<RO>
  IF CXBSS0DL.BS-CODE NE 0
     MOVE CXBSS0DL.BS-CODE TO XPOTBS0L.BS-CODE(#I)
     MOVE CXBSS0DL.BS-NAME TO XPOTBS0L.BS-NAME(#I)
     MOVE CXBSS0DL.BS-ID TO XPOTBS0L.BS-ID(#I)
     RESET XPOTBS0L.OT-CMD-C(#I)
  ELSE
     MOVE 0 TO  XPOTBS0L.BS-CODE(#I)
     MOVE 'Не определен' TO XPOTBS0L.BS-NAME(#I)
  END-IF

