* >Natural Source Header 000000 /*<RO>>
* :NatName MBOTDF1C
* :UID OLEG
* :Mode S
* :CP
* :Date 20070110
* :Time 1702000
* <Natural Source Header /*<<RO>
  IF CXDFS0DL.DF-CODE NE 0
     MOVE CXDFS0DL.DF-CODE TO XPOTDF0L.DF-CODE(#I)
     MOVE CXDFS0DL.DF-NAME TO XPOTDF0L.DF-NAME(#I)
     MOVE CXDFS0DL.DF-ID TO XPOTDF0L.DF-ID(#I)
     RESET XPOTDF0L.OT-CMD-C(#I)
  ELSE
     MOVE 0 TO  XPOTDF0L.DF-CODE(#I)
     MOVE 'Не определен' TO XPOTDF0L.DF-NAME(#I)
  END-IF

