* >Natural Source Header 000000 /*<RO>>
* :NatName MBOTMT9C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060612
* :Time 0154000
* <Natural Source Header /*<<RO>
RESET &1&.STRING(*) &1&.POKAZAT(*)
  &1&.OT-CMD-C(*) := (AD=PN)
  #J := MBOTXX0A.OT-NUMBER-ELEMENT
  FOR #I 1 TO #KOL-STROK
     /* ◊“≈Õ»≈ Œ—ÕŒ¬ÕŒ√Œ —“≈ ¿
     MBXXDO0L.STACK-POS-I := MBXXDO0L.STACK-POS-I + 1
     MOVE MBOTXX0A.STACK-LEN TO #STACK-LEN
     IF MBXXDO0L.STACK-POS-I > #STACK-LEN
        MBXXDO0L.STACK-POS-I := MBXXDO0L.STACK-POS-I - 1
        #END := TRUE
        ESCAPE BOTTOM
     END-IF
     MOVE MBXXDO0L.STACK-POS-I TO MBXXDO0L.STACK-POS
     MOVE MBOTXX0A.STACK-OUT TO #STEK
     CALL 'RWSX' MBXXDO0L.STACK-POS STACK-REC(1) MBXXDO0L.STACK-READ
                 #STEK
     /*********************************************************************
     /* ‘Œ–Ã»–Œ¬¿Õ»≈ «¿√ŒÀŒ¬ ¿ ƒÀﬂ œŒ ¿«¿“≈À≈…
     /*********************************************************************
     RESET #M #K #P
     FOR #L = 1 TO 20
        IF MBXXOP0A.OP-ATTR-NAME(#L) = ' '
           ESCAPE BOTTOM
        END-IF
        IF MBXXOP0A.OP-ATTR-SHOW(*) = MBXXOP0A.OP-ATTR-NAME(#L)
        /*
        IF MBXXOP0A.OP-TYPE-STEK(#L) = ' ' AND MBXXOP0A.OP-ATTR(#L) = ' ' THEN
           #EL-POK := (MBXXOP0A.OP-POR-NUMBER(#L) - MBXXOP0A.OP-KOL-AN) +
                       MBXXOP0A.OP-KOL-EAN
              DECIDE ON FIRST VALUE MBXXOP0A.OP-ATTR-NAME(#L)
              VALUE "BASE"
                 #SUMM-POK(1) := MBXXDO0L.POKAZAT(#EL-POK) + #SUMM-POK(1)
                 MOVE MBXXDO0L.POKAZAT(#EL-POK) TO #POK-N7
                 MOVE EDITED #POK-N7 (EM=-ZZZZZZZ9.9999999)
                       TO XPOTMT0L.OT-BASE-COL(#I)
              VALUE "PRIH"
                 #SUMM-POK(2) := MBXXDO0L.POKAZAT(#EL-POK) + #SUMM-POK(2)
                 MOVE  MBXXDO0L.POKAZAT(#EL-POK)TO #POK-N7
                 MOVE EDITED #POK-N7(EM=-ZZZZZZZ9.9999999)
                       TO XPOTMT0L.OT-PRIH-COL(#I)
              VALUE "SUMMA"
                 #SUMM-POK(3) := MBXXDO0L.POKAZAT(#EL-POK) + #SUMM-POK(3)
                 MOVE  MBXXDO0L.POKAZAT(#EL-POK)TO #POK-N2
                 MOVE EDITED #POK-N2 (EM=-ZZZZZZZZZZZZ9.99)
                       TO XPOTMT0L.OT-BALC-SUMMA(#I)
              NONE VALUE
                 WRITE 'Œÿ»¡ ¿ ¬ MBOTMT9C '
              END-DECIDE

           RESET #ATTR-IND
           COMPRESS "EI-" MBXXOP0A.OP-ATTR-NAME(#L) TO #OP-ATTR-NAME LEAVING NO
           EXAMINE MBXXOP0A.OP-ATTR-NAME(*) FOR #OP-ATTR-NAME GIVING INDEX #ATTR-IND
           /* ≈ƒ≈Õ»÷¿ »«Ã≈–≈Õ»ﬂ
           IF #ATTR-IND NE 0
              #EL-POK := (MBXXOP0A.OP-POR-NUMBER(#ATTR-IND) - MBXXOP0A.OP-KOL-AN) +
                          MBXXOP0A.OP-KOL-EAN
              MOVE MBXXDO0L.POKAZAT(#EL-POK) TO MBEIMN0A.EI-ID
              MOVE "READ" TO MBEIMN0A.BL-COMMAND
              PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
              DECIDE ON FIRST VALUE MBXXOP0A.OP-ATTR-NAME(#ATTR-IND)
                 VALUE "EI-BASE"
                    MOVE MBEIMN0A.EI-SHORT-NAME TO XPOTMT0L.OT-BASE-EI(#I)
                 VALUE "EI-PRIH"
                    MOVE MBEIMN0A.EI-SHORT-NAME TO XPOTMT0L.OT-PRIH-EI(#I)
                 NONE VALUE
                    WRITE 'Œÿ»¡ ¿ ¬ MBOTMT9C '
              END-DECIDE
           END-IF
        END-IF
        END-IF
     END-FOR
     /*********************************************************************
     /*  ŒÕ≈÷ ‘Œ–Ã»–Œ¬¿Õ»ﬂ «¿√ŒÀŒ¬ ¿
     /*********************************************************************
     /* ÕŒÃ≈– ›À≈Ã≈Õ“¿ ¬ —“≈ ≈
     MOVE MBXXDO0L.ANALITIK(#J) TO MBXXDO0L.STACK-POS

     EXAMINE MBXXSS0A.DS-TYPE-STEK(*) FOR &4& GIVING INDEX #NS
     MOVE MBXXSS0A.STACK-NUMBER(#NS) TO #STEK

     RESET &2&.STACK-REC-A(*)
     &2&.STACK-FIELD-POS := 1
     &2&.STACK-FIELD-LEN := 4
     CALL 'CMPXF' MBXXDO0L.STACK-POS &2&.STACK-FIELD-POS
               &2&.STACK-FIELD-LEN #STEK

     CALL 'RWSX'  &2&.STACK-FIELD-POS &2&.STACK-REC-A(1) MBXXDO0L.STACK-READ
                  #STEK

     INCLUDE &3&
  END-FOR
/*
#I := 6
  MOVE #SUMM-POK(1) TO #POK-N7
  MOVE EDITED #POK-N7 (EM=-ZZZZZZZ9.9999999)
        TO XPOTMT0L.OT-BASE-COL(#I)
  MOVE #SUMM-POK(2) TO #POK-N7
  MOVE EDITED #POK-N7 (EM=-ZZZZZZZ9.9999999)
        TO XPOTMT0L.OT-PRIH-COL(#I)
  MOVE #SUMM-POK(3) TO #POK-N2
  MOVE EDITED #POK-N2 (EM=-ZZZZZZZZZZZZ9.99)
        TO XPOTMT0L.OT-BALC-SUMMA(#I)
RESET #POK1 #POK2 #P #SUMM-POK(*) #POKAZAT7 #POKAZAT2

