* >Natural Source Header 000000 /*<RO>>
* :NatName MBPHMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20081215
* :Time 0153000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — ÔËıÓ‰ÌÓ„Ó Ó‰Â‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBPHMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL USING MXDRAT0L
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBPHMN0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C 'MBPHMN0A' 'PO-ID'
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC '10000' 'PO-NUMBER'
  INCLUDE XBDRSPDC '10001' 'PO-DATE'
  INCLUDE XBDRSPIC "DR-DOC-PO-ATTR-ID" "STORNO-PO-ID"
  INCLUDE XBDRSPIC "DR-DP-ATTR-ID" "ORDER-DP-ID"
  INCLUDE XBDRSPIC '20002' 'VO-ID'
  INCLUDE XBDRSPIC '20070' 'REAL-VO-ID'
  INCLUDE XBDRSPIC "DR-DOC-REAL-TT-ATTR-ID" "REAL-TT-ID"
  INCLUDE XBDRSPIC '30002' 'MBPHMN0A.OG-ID'
  INCLUDE XBDRSPIC '30003' 'MO-ID'
  INCLUDE XBDRSPIC "DR-MO-IN-ATTR-ID" "IN-MO-ID"
  INCLUDE XBDRSPIC '10004' 'SF-ID'
  INCLUDE XBDRSPIC '10005' 'TT-ID'
  INCLUDE XBDRSPIC '10006' 'DV-ID'
  INCLUDE XBDRSPIC '10006' 'DV-ID'
  INCLUDE XBDRSPIC '10007' 'PP-ID'
  INCLUDE XBDRSP2C '10008' 'PP-SUMM'
  INCLUDE XBDRSPIC '10023' 'OTV-TB-ID'
  INCLUDE XBDRSP2C '10025' "REAL-VO-SUMMA"
  INCLUDE XBDRSPIC '10026' "TP-ID"
/*
  IF IS-DC-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DC-CONFIRMED" "#CONFIRM"
/*
  IF IS-DR-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DR-CONFIRMED" "#CONFIRM"
/*
  INCLUDE XBDRSPIC "DR-BS-OUT-ATTR-ID" "OUT-BS-ID"
  INCLUDE XBDRSPIC "DR-NDS-BS-ATTR-ID" "NDS-BS-ID"
  INCLUDE XBDRSPIC "DR-ZK-ATTR-ID" "ZK-ID"
  INCLUDE XBDRSP2C "DR-CONF-CENA-SUMMA-ATTR-ID"   "CONF-CENA-SUMMA"
  INCLUDE XBDRSP2C "DR-CONF-NDS-SUMMA-ATTR-ID"    "CONF-NDS-SUMMA"
  INCLUDE XBDRSPIC "DC-PACKAGE-ATTR-ID"    "DC-PACKAGE"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBPHMN0A
  INCLUDE XBDRSUAC '10000' 'PO-NUMBER'
  INCLUDE XBDRSUDC '10001' 'PO-DATE'
  INCLUDE XBDRSUIC "DR-DOC-PO-ATTR-ID" "STORNO-PO-ID"
  INCLUDE XBDRSUIC "DR-DP-ATTR-ID" "ORDER-DP-ID"
  INCLUDE XBDRSUIC '20002' 'VO-ID'
  INCLUDE XBDRSUIC '20070' 'REAL-VO-ID'
  INCLUDE XBDRSUIC "DR-DOC-REAL-TT-ATTR-ID" "REAL-TT-ID"
  INCLUDE XBDRSUIC '30002' 'MBPHMN0A.OG-ID'
  INCLUDE XBDRSUIC '30003' 'MO-ID'
  INCLUDE XBDRSUIC "DR-MO-IN-ATTR-ID" "IN-MO-ID"
  INCLUDE XBDRSUIC '10004' 'SF-ID'
  INCLUDE XBDRSUIC '10005' 'TT-ID'
  INCLUDE XBDRSUIC '10006' 'DV-ID'
  INCLUDE XBDRSUIC '10007' 'PP-ID'
  INCLUDE XBDRSU2C '10008' 'PP-SUMM'
  INCLUDE XBDRSUIC '10023' 'OTV-TB-ID'
  INCLUDE XBDRSU2C '10025' "REAL-VO-SUMMA"
  INCLUDE XBDRSUIC '10026' "TP-ID"
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DC-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DC-CONFIRMED := TRUE
  ELSE IS-DC-CONFIRMED := FALSE END-IF
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DR-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DR-CONFIRMED := TRUE
  ELSE IS-DR-CONFIRMED := FALSE END-IF
/*
  INCLUDE XBDRSUIC "DR-BS-OUT-ATTR-ID" "OUT-BS-ID"
  INCLUDE XBDRSUIC "DR-NDS-BS-ATTR-ID" "NDS-BS-ID"
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID" "ZK-ID"
  INCLUDE XBDRSU2C "DR-CONF-CENA-SUMMA-ATTR-ID"   "CONF-CENA-SUMMA"
  INCLUDE XBDRSU2C "DR-CONF-NDS-SUMMA-ATTR-ID"    "CONF-NDS-SUMMA"
  INCLUDE XBDRSUIC "DC-PACKAGE-ATTR-ID"    "DC-PACKAGE"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1001'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
