* >Natural Source Header 000000 /*<RO>>
* :NatName MBPMMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070627
* :Time 2011000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBPMMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL USING MXDRAT0L
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBPMMN0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBPMMN0A.PO-ID
/*
INCLUDE MBXXMN1C 'MBPMMN0A' 'PM-ID'
/*
MBPMMN0A.PO-ID := UBDRMN0A.DR-UP-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC '10050' 'MT-ID'
  INCLUDE XBDRSP2C '10051' 'DR-CENA'
  INCLUDE XBDRSP2C '10052' 'DR-CENA-SUMMA'
  INCLUDE XBDRSP2C '10053' 'DR-NDS'
  INCLUDE XBDRSP2C '10054' 'DR-NDS-SUMMA'
  INCLUDE XBDRSP2C '10055' 'DR-ALL-SUMMA'
  INCLUDE XBDRSP7C '10056' 'DR-COL'
  INCLUDE XBDRSPIC '10057' 'ND-ID'
  INCLUDE XBDRSPIC '10058' 'EI-ID'
  INCLUDE XBDRSPIC '10060' 'PR-ID'
  INCLUDE XBDRSPIC '10061' 'GM-ID'
  INCLUDE XBDRSP7C '10062' 'BASE-COL'
  INCLUDE XBDRSPIC '10063' 'BASE-EI-ID'
  INCLUDE XBDRSPIC '10064' 'BASE-COL-TYPE'
  INCLUDE XBDRSPIC "DR-DOC-POM-ATTR-ID" "STORNO-POM-ID"
  INCLUDE XBDRSPIC "DR-BS-IN-ATTR-ID"             "IN-BS-ID"
  INCLUDE XBDRSPIC "DR-BS-OUT-ATTR-ID"            "OUT-BS-ID"
  INCLUDE XBDRSPIC "DR-NDS-BS-ATTR-ID"            "NDS-BS-ID"
  INCLUDE XBDRSP7C "DR-CONF-COL-ATTR-ID"          "CONF-COL"
  INCLUDE XBDRSP2C "DR-CONF-CENA-SUMMA-ATTR-ID"   "CONF-CENA-SUMMA"
  INCLUDE XBDRSP2C "DR-CONF-NDS-SUMMA-ATTR-ID"    "CONF-NDS-SUMMA"
/*  INCLUDE XBDRSP7C '40056' 'BUH-COL'
/*  INCLUDE XBDRSP2C '40052' 'BUH-CENA-SUMMA'
/*  INCLUDE XBDRSP2C '40054' 'BUH-NDS-SUMMA'
/*  INCLUDE XBDRSP2C '40055' 'BUH-SUMMA'
/*
  IF IS-DR-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DR-CONFIRMED" "#CONFIRM"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBPMMN0A
  INCLUDE XBDRSUIC '10050' 'MT-ID'
  INCLUDE XBDRSU2C '10051' 'DR-CENA'
  INCLUDE XBDRSU2C '10052' 'DR-CENA-SUMMA'
  INCLUDE XBDRSU2C '10053' 'DR-NDS'
  INCLUDE XBDRSU2C '10054' 'DR-NDS-SUMMA'
  INCLUDE XBDRSU2C '10055' 'DR-ALL-SUMMA'
  INCLUDE XBDRSU7C '10056' 'DR-COL'
  INCLUDE XBDRSUIC '10057' 'ND-ID'
  INCLUDE XBDRSUIC '10058' 'EI-ID'
  INCLUDE XBDRSUIC '10060' 'PR-ID'
  INCLUDE XBDRSUIC '10061' 'GM-ID'
  INCLUDE XBDRSU7C '10062' 'BASE-COL'
  INCLUDE XBDRSUIC '10063' 'BASE-EI-ID'
  INCLUDE XBDRSUIC '10064' 'BASE-COL-TYPE'
  INCLUDE XBDRSUIC "DR-DOC-POM-ATTR-ID" "STORNO-POM-ID"
/*
  INCLUDE XBDRSUIC "DR-BS-IN-ATTR-ID"          "IN-BS-ID"
  INCLUDE XBDRSUIC "DR-BS-OUT-ATTR-ID"         "OUT-BS-ID"
  INCLUDE XBDRSUIC "DR-NDS-BS-ATTR-ID"         "NDS-BS-ID"
/*  INCLUDE XBDRSUIC '10009' 'BS-ID'
/*  INCLUDE XBDRSUIC '20009' 'KOR-BS-ID'
/*  INCLUDE XBDRSUIC '40009' 'NDS-BS-ID'
  INCLUDE XBDRSU7C "DR-CONF-COL-ATTR-ID"          "CONF-COL"
  INCLUDE XBDRSU2C "DR-CONF-CENA-SUMMA-ATTR-ID"   "CONF-CENA-SUMMA"
  INCLUDE XBDRSU2C "DR-CONF-NDS-SUMMA-ATTR-ID"    "CONF-NDS-SUMMA"
/*  INCLUDE XBDRSU2C "" 'BUH-SUMMA'
/*
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DR-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DR-CONFIRMED := TRUE
  ELSE IS-DR-CONFIRMED := FALSE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1002'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END


