**C               *>Natural Source Header 000000
**C               *:NatName MBPOSH0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060725
**C               *:Time 1752000
**C               *<Natural Source Header
**DS          0000      1MBPOSH0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2PO-ID
**DK          0000A   6 2PO-NUMBER
**DK          0000D     2PO-DT-START
**DK          0000D     2PO-DT-STOP
