**C               *>Natural Source Header 000000
**C               *:NatName MBPOXS0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070228
**C               *:Time 1830000
**C               *<Natural Source Header
**DS          0000      1MBPOXS0A
**DK          0000P  15 2ASUM-DOC
