* >Natural Source Header 000000 /*<RO>>
* :NatName MBPPMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060620
* :Time 1830000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBPPMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
END-DEFINE
DEFINE SUBROUTINE MBPPMN0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C 'MBPPMN0A' 'PP-ID'
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC '10000' 'PP-NUMBER'
  INCLUDE XBDRSPDC '10001' 'PP-DATE'
  INCLUDE XBDRSPIC '20002' 'VO-ID'
  INCLUDE XBDRSPIC '30002' 'MBPPMN0A.OG-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  INCLUDE XBDRSUIC '10000' 'PP-NUMBER'
  INCLUDE XBDRSUDC '10001' 'PP-DATE'
  INCLUDE XBDRSUIC '20002' 'VO-ID'
  INCLUDE XBDRSUIC '30002' 'MBPPMN0A.OG-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1300'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END



