* >Natural Source Header 000000 /*<RO>>
* :NatName MBPRMN0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20070304
* :Time 1644000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿: XBPRMN0S
/*
/* –¿«–¿¡Œ“◊» :   Œ¬¿À‹◊”  Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*   - ADD
/*   - READ
/*   - UPDADE
/*   - DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBPRMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MDPRMN0A
LOCAL USING MBDMMN0A
LOCAL USING MBEIMN0A
LOCAL
1 #I    (I4)
1 #J    (I4)
1 #NUMBER (P9)
END-DEFINE
DEFINE SUBROUTINE MBPRMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE MBPRMN0A.BL-COMMAND
  VALUE 'ADD'
     PERFORM RECORD-ADD
  VALUE "SET"
     PERFORM RECORD-SET
  VALUE 'READ'
     PERFORM RECORD-READ
  VALUE 'LOCATE'
     PERFORM RECORD-LOCATE
  VALUE 'UPDATE'
     PERFORM RECORD-UPDATE
  VALUE 'DELETE'
     PERFORM RECORD-DELETE
  NONE VALUE
     MOVE MBPRMN0A.BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-EXTEND
  MOVE BY NAME MDPRMN0A TO MBPRMN0A
  /* –¿—ÿ»‘–Œ¬€¬¿≈Ã —Œ¡—“¬≈ÕÕ€≈ ¿“–»¡”“€
  FOR #I = 1 TO 5
     IF MBPRMN0A.DM-ID(#I) = 0
        RESET MBPRMN0A.DM-G(#I)
        ESCAPE TOP
     END-IF
     MOVE MBPRMN0A.DM-ID(#I) TO MBDMMN0A.DM-ID
     MOVE 'READ' TO MBDMMN0A.BL-COMMAND
     PERFORM MBDMMN0S XXERX00A XXCTXX0A MBDMMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBDMMN0A.DM-CODE TO MBPRMN0A.DM-CODE(#I)
     MOVE MBDMMN0A.DM-NAME TO MBPRMN0A.DM-NAME(#I)
     MOVE MBPRMN0A.DM-EI-ID(#I) TO MBEIMN0A.EI-ID
     MOVE 'READ' TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBEIMN0A.EI-SHORT-NAME TO MBPRMN0A.DM-EI-SHORT-NAME(#I)
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-SET
/*WRITE MBPRMN0A.PR-CODE
  MOVE MBPRMN0A.PR-CODE TO MDPRMN0A.PR-CODE
  MOVE 'LOCATE' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
     MOVE BY NAME MBPRMN0A TO MDPRMN0A
     MOVE "ADD" TO MDPRMN0A.DL-COMMAND
     PERFORM MDPRMN0S XXERX00A MDPRMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  ELSE
     IF RETURN-CODE EQ 0 THEN
        MOVE MDPRMN0A.PR-ID TO MBPRMN0A.PR-ID
        MOVE BY NAME MBPRMN0A TO MDPRMN0A
/*      WRITE "UPDATE"
        MOVE "UPDATE" TO MDPRMN0A.DL-COMMAND
        PERFORM MDPRMN0S XXERX00A MDPRMN0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     ELSE
        *ERROR-NR := EC-QUIT-STACK-TRACE
     END-IF
  END-IF
  MOVE BY NAME MDPRMN0A TO MBPRMN0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-ADD
  /* œŒ»—  “≈’Õ»◊≈— Œ… «¿œ»—»
  IF MBPRMN0A.MT-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
/*  IF MBPRMN0A.DC-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
/*  IF MBPRMN0A.DR-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  MOVE 'GETNUMBER' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MDPRMN0A.PR-CODE-COUNTER TO MBPRMN0A.PR-CODE
/*
  MOVE BY NAME MBPRMN0A TO MDPRMN0A
  MOVE 'ADD' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDPRMN0A TO MBPRMN0A
  PERFORM RECORD-EXTEND
/*
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  MOVE MBPRMN0A.PR-ID TO MDPRMN0A.PR-ID
  MOVE 'READ' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDPRMN0A TO MBPRMN0A
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOCATE
  MOVE BY NAME MBPRMN0A TO MDPRMN0A
  MOVE 'LOCATE' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN ESCAPE ROUTINE END-IF
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDPRMN0A TO MBPRMN0A
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UPDATE
  IF MBPRMN0A.MT-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
/*IF MBPRMN0A.DC-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
/*IF MBPRMN0A.DR-ID = 0 *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  MOVE BY NAME MBPRMN0A TO MDPRMN0A
  MOVE 'UPDATE' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MDPRMN0A TO MBPRMN0A
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-DELETE
  MOVE BY NAME MBPRMN0A TO MDPRMN0A
  MOVE 'DELETE' TO MDPRMN0A.DL-COMMAND
  PERFORM MDPRMN0S XXERX00A MDPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
