* >Natural Source Header 000000 /*<RO>>
* :NatName MBPZMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20061224
* :Time 1649000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBPZMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL USING MXDRAT0L
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBPZMN0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBPZMN0A.PO-ID
/*
INCLUDE MBXXMN1C "MBPZMN0A" "PZ-ID"
/*WRITE *PROGRAM MBPZMN0A.BL-COMMAND PZ-ID
/*
MBPZMN0A.PO-ID := UBDRMN0A.DR-UP-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC '10073' 'ZR-ID'
  INCLUDE XBDRSP2C '10052' 'DR-CENA-SUMMA'
  INCLUDE XBDRSP2C '10054' 'DR-NDS-SUMMA'
  INCLUDE XBDRSP2C '10055' 'DR-ALL-SUMMA'
  INCLUDE XBDRSPIC '10057' 'ND-ID'
/*
  INCLUDE XBDRSPIC "DR-BS-IN-ATTR-ID"             "IN-BS-ID"
  INCLUDE XBDRSPIC "DR-BS-OUT-ATTR-ID"            "OUT-BS-ID"
  INCLUDE XBDRSPIC "DR-NDS-BS-ATTR-ID"            "NDS-BS-ID"
  INCLUDE XBDRSP2C "DR-CONF-CENA-SUMMA-ATTR-ID"   "CONF-CENA-SUMMA"
  INCLUDE XBDRSP2C "DR-CONF-NDS-SUMMA-ATTR-ID"    "CONF-NDS-SUMMA"
/*
  IF IS-DR-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DR-CONFIRMED" "#CONFIRM"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBPZMN0A
  INCLUDE XBDRSUIC '10073' 'ZR-ID'
  INCLUDE XBDRSU2C '10052' 'DR-CENA-SUMMA'
  INCLUDE XBDRSU2C '10054' 'DR-NDS-SUMMA'
  INCLUDE XBDRSU2C '10055' 'DR-ALL-SUMMA'
  INCLUDE XBDRSUIC '10057' 'ND-ID'
/*
  INCLUDE XBDRSUIC "DR-BS-IN-ATTR-ID"          "IN-BS-ID"
  INCLUDE XBDRSUIC "DR-BS-OUT-ATTR-ID"         "OUT-BS-ID"
  INCLUDE XBDRSUIC "DR-NDS-BS-ATTR-ID"         "NDS-BS-ID"
  INCLUDE XBDRSU2C "DR-CONF-CENA-SUMMA-ATTR-ID"   "CONF-CENA-SUMMA"
  INCLUDE XBDRSU2C "DR-CONF-NDS-SUMMA-ATTR-ID"    "CONF-NDS-SUMMA"
/*
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DR-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DR-CONFIRMED := TRUE
  ELSE IS-DR-CONFIRMED := FALSE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1003'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END


