* >Natural Source Header 000000 /*<RO>>
* :NatName MBREHM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070219
* :Time 1056000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — ÔËıÓ‰ÌÓ„Ó Ó‰Â‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBREHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBREHM0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C "MBREHM0A" "REH-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC "DC-NUMBER-ATTR-ID"   "REH-NUMBER"
  INCLUDE XBDRSPDC "DC-DATE-ATTR-ID"     "REH-DATE"
  INCLUDE XBDRSPIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSPIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
  INCLUDE XBDRSPIC "DR-VO-ATTR-ID"       "VO-ID"
/*
  IF IS-DC-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DC-CONFIRMED" "#CONFIRM"
/*
  IF IS-DR-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DR-CONFIRMED" "#CONFIRM"
/*
  INCLUDE XBDRSPIC "DR-BS-OUT-ATTR-ID" "OUT-BS-ID"
  INCLUDE XBDRSPIC "DR-NDS-BS-ATTR-ID" "NDS-BS-ID"
  INCLUDE XBDRSPIC "DR-ZK-ATTR-ID" "ZK-ID"
  INCLUDE XBDRSPIC "DC-PACKAGE-ATTR-ID"    "DC-PACKAGE"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBREHM0A
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"   "REH-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"     "REH-DATE"
  INCLUDE XBDRSUIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSUIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
  INCLUDE XBDRSUIC "DR-VO-ATTR-ID"       "VO-ID"
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DC-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DC-CONFIRMED := TRUE
  ELSE IS-DC-CONFIRMED := FALSE END-IF
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DR-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DR-CONFIRMED := TRUE
  ELSE IS-DR-CONFIRMED := FALSE END-IF
/*
  INCLUDE XBDRSUIC "DR-BS-OUT-ATTR-ID" "OUT-BS-ID"
  INCLUDE XBDRSUIC "DR-NDS-BS-ATTR-ID" "NDS-BS-ID"
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID" "ZK-ID"
  INCLUDE XBDRSUIC "DC-PACKAGE-ATTR-ID"    "DC-PACKAGE"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1801'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

