* >Natural Source Header 000000 /*<RO>>
* :NatName MBRKSL0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20061110
* :Time 1218000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  Ó‚‡Î¸˜ÛÍ Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: ¬€¡Œ– ”◊≈“ÕŒ√Œ –≈√»—“–¿
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - VIEW
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING MBRKSL0A
/* Œœ»—¿Õ»≈ › –¿ÕÕŒ… ‘Œ–Ã€
LOCAL USING MBRKSL0L
LOCAL USING UBITMN0A
LOCAL USING XXXXEC0L
LOCAL USING XXCTXX0A
LOCAL USING UXCSXX0A
LOCAL
1 #I          (I4)
1 #J          (I4)
1 #K          (I4)
END-DEFINE
DEFINE SUBROUTINE MBRKSL0S
RESET XXERX00A MBRKSL0A.XX-COMMAND
SET KEY PF4 NAMED 'SEL'
SET KEY ENTR NAMED 'SEL'
SET KEY PF3 NAMED 'EXIT'
SET CONTROL "M03"
SET CONTROL 'M=RE'
MOVE *PROGRAM TO MBRKSL0L.RK-VIEW-PROGRAM
MOVE MBRKSL0A.RK-FUNCTION-NAME TO MBRKSL0L.RK-FUNCTION-NAME
/*
MBRKSL0L.SL-CMD-C(*) := (AD=PN)
FOR #I = 1 TO 10
     IF MBRKSL0A.IT-ID-ONCE(#I) = 0 THEN ESCAPE BOTTOM END-IF
     MOVE "READ" TO UBITMN0A.BL-COMMAND
     MOVE MBRKSL0A.IT-ID-ONCE(#I) TO UBITMN0A.IT-ID
     PERFORM UBITMN0S XXERX00A XXCTXX0A UBITMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     RESET MBRKSL0L.SL-CMD-C(#I)
     MOVE UBITMN0A.IT-ID TO MBRKSL0L.IT-ID(#I)
     MOVE UBITMN0A.IT-CODE TO MBRKSL0L.IT-CODE(#I)
     MOVE UBITMN0A.IT-NAME TO MBRKSL0L.IT-NAME(#I)
END-FOR
/*
REPEAT
/*
INPUT USING MAP "MBRKSL0M"
/*
DECIDE ON FIRST VALUE *PF-KEY
  VALUE 'PF3'
     MBRKSL0A.XX-COMMAND := 'EXIT'
     ESCAPE ROUTINE
  VALUE 'PF4' , 'ENTR'
     RESET MBRKSL0A.IT-ID(*)  #K
     FOR #I = 1 TO 10
        IF MBRKSL0L.SL-CMD(#I) NE ' '
           ADD 1 TO #K
           MBRKSL0A.IT-ID(#K) := MBRKSL0L.IT-ID(#I)
        END-IF
     END-FOR
     IF #K = 0 THEN MBRKSL0A.XX-COMMAND := 'EXIT' END-IF

     ESCAPE BOTTOM
  NONE VALUE IGNORE
END-DECIDE
END-REPEAT
INCLUDE XXERSY1C
END-SUBROUTINE
END


