* >Natural Source Header 000000 /*<RO>>
* :NatName MBRLPM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070125
* :Time 0125000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  œÓÁËˆË  ‡ÒıÓ‰‡ ÔÓ À« 
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBRLPM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBRLPM0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBRLPM0A.RLM-ID
/*
INCLUDE MBXXMN1C "MBRLPM0A" "RLP-ID"
/*
MBRLPM0A.RLM-ID := UBDRMN0A.DR-UP-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC "DR-DOC-LKR-ATTR-ID"     "LKR-ID"
  INCLUDE XBDRSPIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSPIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSP2C "DR-CENA-ATTR-ID"        "CENA"
  INCLUDE XBDRSP2C "DR-CENA-SUMMA-ATTR-ID"  "CENA-SUMMA"
/*
  INCLUDE XBDRSP7C "DR-PRIH-COL-ATTR-ID"    "COL"
  INCLUDE XBDRSPIC "DR-PRIH-EI-ATTR-ID"     "EI-ID"
  INCLUDE XBDRSP7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSPIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSP7C "DR-PLAN-COL-ATTR-ID"    "PLAN-COL"
  INCLUDE XBDRSPIC "DR-PLAN-EI-ATTR-ID"     "PLAN-EI-ID"
  INCLUDE XBDRSP2C "DR-BALC-SUMMA-ATTR-ID"  "BALC-SUMMA"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBRLPM0A
  INCLUDE XBDRSUIC "DR-DOC-LKR-ATTR-ID"     "LKR-ID"
  INCLUDE XBDRSUIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSUIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSU2C "DR-CENA-ATTR-ID"        "CENA"
  INCLUDE XBDRSU2C "DR-CENA-SUMMA-ATTR-ID"  "CENA-SUMMA"
/*
  INCLUDE XBDRSU7C "DR-PRIH-COL-ATTR-ID"    "COL"
  INCLUDE XBDRSUIC "DR-PRIH-EI-ATTR-ID"     "EI-ID"
  INCLUDE XBDRSU7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSUIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSU7C "DR-PLAN-COL-ATTR-ID"    "PLAN-COL"
  INCLUDE XBDRSUIC "DR-PLAN-EI-ATTR-ID"     "PLAN-EI-ID"
  INCLUDE XBDRSU2C "DR-BALC-SUMMA-ATTR-ID"  "BALC-SUMMA"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1703'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

