* >Natural Source Header 000000 /*<RO>>
* :NatName MBRLHM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070219
* :Time 1056000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  «‡„ÓÎÓ‚ÓÍ ‡ÒıÓ‰‡ ÔÓ À« 
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBRLHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBRLHM0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C "MBRLHM0A" "RL-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC "DC-NUMBER-ATTR-ID"   "RL-NUMBER"
  INCLUDE XBDRSPDC "DC-DATE-ATTR-ID"     "RL-DATE"
  INCLUDE XBDRSPDC "DC-DATE-OTR-ATTR-ID" "RL-DATE-OTR"
  INCLUDE XBDRSPIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSPIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
  INCLUDE XBDRSPIC "DR-ZK-ATTR-ID"       "ZK-ID"
  INCLUDE XBDRSPIC "DR-BS-ATTR-ID"       "BS-ID"
  INCLUDE XBDRSPIC "DR-MT-ATTR-ID"       "MT-ID"
/*
  IF IS-DC-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DC-CONFIRMED" "#CONFIRM"
/*
  IF IS-DR-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DR-CONFIRMED" "#CONFIRM"
  INCLUDE XBDRSPIC "DC-PACKAGE-ATTR-ID"    "DC-PACKAGE"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBRLHM0A
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"   "RL-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"     "RL-DATE"
  INCLUDE XBDRSUDC "DC-DATE-OTR-ATTR-ID" "RL-DATE-OTR"
  INCLUDE XBDRSUIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSUIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID"       "ZK-ID"
  INCLUDE XBDRSUIC "DR-BS-ATTR-ID"       "BS-ID"
  INCLUDE XBDRSUIC "DR-MT-ATTR-ID"       "MT-ID"
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DC-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DC-CONFIRMED := TRUE
  ELSE IS-DC-CONFIRMED := FALSE END-IF
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DR-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DR-CONFIRMED := TRUE
  ELSE IS-DR-CONFIRMED := FALSE END-IF
  INCLUDE XBDRSUIC "DC-PACKAGE-ATTR-ID"    "DC-PACKAGE"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IF RL-NUMBER EQ " " THEN *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF RL-DATE EQ 0 THEN *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF IN-MO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF OUT-MO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF ZK-ID EQ 0 AND MT-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1701'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

