* >Natural Source Header 000000 /*<RO>>
* :NatName MBRMMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070924
* :Time 1325000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — ÔËıÓ‰ÌÓ„Ó Ó‰Â‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBRMMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBRMMN0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBRMMN0A.RO-ID
/*
INCLUDE MBXXMN1C "MBRMMN0A" "RM-ID"
/*
MBRMMN0A.RO-ID := UBDRMN0A.DR-UP-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC "DR-ZK-ATTR-ID"          "ZK-ID"
  INCLUDE XBDRSPIC "DR-MT-ATTR-ID"          "MT-ID"
  INCLUDE XBDRSPIC "DR-GM-ATTR-ID"          "GM-ID"
  INCLUDE XBDRSP7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSPIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSP7C "DR-CONF-COL-ATTR-ID"    "CONF-COL"
  INCLUDE XBDRSP2C "DR-CONF-ALL-SUMMA-ATTR-ID"  "CONF-SUMMA"
  IF IS-DR-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DR-CONFIRMED" "#CONFIRM"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBRMMN0A
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID"          "ZK-ID"
  INCLUDE XBDRSUIC "DR-MT-ATTR-ID"          "MT-ID"
  INCLUDE XBDRSUIC "DR-GM-ATTR-ID"          "GM-ID"
  INCLUDE XBDRSU7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSUIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSU7C "DR-CONF-COL-ATTR-ID"    "CONF-COL"
  INCLUDE XBDRSU2C "DR-CONF-ALL-SUMMA-ATTR-ID"  "CONF-SUMMA"
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DR-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DR-CONFIRMED := TRUE
  ELSE IS-DR-CONFIRMED := FALSE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1602'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

