* >Natural Source Header 000000 /*<RO>>
* :NatName MBROPM0S
* :UID ARMK523
* :Mode S
* :CP
* :Date 20070208
* :Time 1041000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  œ‡ÚË  ‡ÒıÓ‰‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBROPM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBROPM0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBROPM0A.ROM-ID
/*
INCLUDE MBXXMN1C "MBROPM0A" "ROP-ID"
/*
MBROPM0A.ROM-ID := UBDRMN0A.DR-UP-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSPIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSP2C "DR-CENA-ATTR-ID"        "CENA"
/*INCLUDE XBDRSP2C "DR-BALC-SUMMA-ATTR-ID"  "CENA-SUMMA"
/*
  INCLUDE XBDRSP7C "DR-PRIH-COL-ATTR-ID"    "COL"
  INCLUDE XBDRSPIC "DR-PRIH-EI-ATTR-ID"     "EI-ID"
  INCLUDE XBDRSP7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSPIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBROPM0A
  INCLUDE XBDRSUIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSUIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSU2C "DR-CENA-ATTR-ID"        "CENA"
  INCLUDE XBDRSU2C "DR-BALC-SUMMA-ATTR-ID"  "CENA-SUMMA"
/*
  INCLUDE XBDRSU7C "DR-PRIH-COL-ATTR-ID"    "COL"
  INCLUDE XBDRSUIC "DR-PRIH-EI-ATTR-ID"     "EI-ID"
  INCLUDE XBDRSU7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSUIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSU2C "DR-BALC-SUMMA-ATTR-ID"  "BALC-SUMMA"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1603'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
