* >Natural Source Header 000000 /*<RO>>
* :NatName MBRXPM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070530
* :Time 1323000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”ÌË‚ÂÒ‡Î¸Ì‡  ÛÔ‡‚Î ÎÍ‡ Ô‡ÚË ÏË ‡ÒıÓ‰‡
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBRXPM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBRXPM0S
RESET XXERX00A
/*
UBDRMN0A.DR-UP-ID := MBRXPM0A.DR-UP-ID
/*
INCLUDE MBXXMN1C "MBRXPM0A" "DR-ID"
/*
MBRXPM0A.DR-UP-ID := UBDRMN0A.DR-UP-ID
MBRXPM0A.DD-ID := UBDRMN0A.DR-TYPE-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPIC "DR-DOC-LKR-ATTR-ID"     "LKR-ID"
  INCLUDE XBDRSPIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSPIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSPIC "DR-IX-ATTR-ID"          "IX-ID"
  INCLUDE XBDRSPIC "DR-MT-BASE-ATTR-ID"     "BASE-MT-ID"
  INCLUDE XBDRSP2C "DR-BALC-SUMMA-ATTR-ID"  "BALC-SUMMA"
/*
  INCLUDE XBDRSP7C "DR-PRIH-COL-ATTR-ID"    "PRIH-COL"
  INCLUDE XBDRSPIC "DR-PRIH-EI-ATTR-ID"     "PRIH-EI-ID"
  INCLUDE XBDRSP7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSPIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSP7C "DR-PLAN-COL-ATTR-ID"    "PLAN-COL"
  INCLUDE XBDRSPIC "DR-PLAN-EI-ATTR-ID"     "PLAN-EI-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBRXPM0A
  INCLUDE XBDRSUIC "DR-DOC-LKR-ATTR-ID"     "LKR-ID"
  INCLUDE XBDRSUIC "DR-PR-ATTR-ID"          "PR-ID"
  INCLUDE XBDRSUIC "DR-DT-ATTR-ID"          "DT-ID"
  INCLUDE XBDRSUIC "DR-IX-ATTR-ID"          "IX-ID"
  INCLUDE XBDRSUIC "DR-MT-BASE-ATTR-ID"     "BASE-MT-ID"
  INCLUDE XBDRSU2C "DR-BALC-SUMMA-ATTR-ID"  "BALC-SUMMA"
/*
  INCLUDE XBDRSU7C "DR-PRIH-COL-ATTR-ID"    "PRIH-COL"
  INCLUDE XBDRSUIC "DR-PRIH-EI-ATTR-ID"     "PRIH-EI-ID"
  INCLUDE XBDRSU7C "DR-BASE-COL-ATTR-ID"    "BASE-COL"
  INCLUDE XBDRSUIC "DR-BASE-EI-ATTR-ID"     "BASE-EI-ID"
  INCLUDE XBDRSU7C "DR-PLAN-COL-ATTR-ID"    "PLAN-COL"
  INCLUDE XBDRSUIC "DR-PLAN-EI-ATTR-ID"     "PLAN-EI-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C "MBRXPM0A.DD-ID"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

