* >Natural Source Header 000000 /*<RO>>
* :NatName MBRXHM0S
* :UID ARMK523
* :Mode S
* :CP
* :Date 20070228
* :Time 1032000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  «‡„ÓÎÓ‚ÓÍ ‡ÒıÓ‰‡ ÔÓ À« 
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBRXHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
LOCAL
1 #CONFIRM (P15)
/*
END-DEFINE
DEFINE SUBROUTINE MBRXHM0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C "MBRXHM0A" "DR-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC "DC-NUMBER-ATTR-ID"   "RX-NUMBER"
  INCLUDE XBDRSPDC "DC-DATE-ATTR-ID"     "RX-DATE"
  INCLUDE XBDRSPDC "DC-DATE-OTR-ATTR-ID" "RX-DATE-OTR"
  INCLUDE XBDRSPIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSPIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
  INCLUDE XBDRSPIC "DR-ZK-ATTR-ID"       "ZK-ID"
  INCLUDE XBDRSPIC "DR-BS-ATTR-ID"       "BS-ID"
  INCLUDE XBDRSPIC "DR-MT-ATTR-ID"       "MT-ID"
  INCLUDE XBDRSPIC "DR-VO-ATTR-ID"       "VO-ID"
/*
  IF IS-DC-CONFIRMED THEN #CONFIRM := 0
  ELSE #CONFIRM := 1 END-IF
  INCLUDE XBDRSPIC "DC-CONFIRMED" "#CONFIRM"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBRXHM0A
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"   "RX-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"     "RX-DATE"
  INCLUDE XBDRSUDC "DC-DATE-OTR-ATTR-ID" "RX-DATE-OTR"
  INCLUDE XBDRSUIC "DR-MO-IN-ATTR-ID"    "IN-MO-ID"
  INCLUDE XBDRSUIC "DR-MO-OUT-ATTR-ID"   "OUT-MO-ID"
  INCLUDE XBDRSUIC "DR-ZK-ATTR-ID"       "ZK-ID"
  INCLUDE XBDRSUIC "DR-BS-ATTR-ID"       "BS-ID"
  INCLUDE XBDRSUIC "DR-MT-ATTR-ID"       "MT-ID"
  INCLUDE XBDRSUIC "DR-VO-ATTR-ID"       "VO-ID"
/*
  RESET #CONFIRM
  INCLUDE XBDRSUIC "DC-CONFIRMED" "#CONFIRM"
  IF #CONFIRM EQ 0 THEN IS-DC-CONFIRMED := TRUE
  ELSE IS-DC-CONFIRMED := FALSE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IF RX-NUMBER EQ " " THEN *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF RX-DATE EQ 0 THEN *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  IF IN-MO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF OUT-MO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF ZK-ID EQ 0 AND MT-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
END-SUBROUTINE
/*
INCLUDE MBXXMN0C "MBRXHM0A.DD-ID"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

