* >Natural Source Header 000000 /*<RO>>
* :NatName MBSASH2S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070115
* :Time 1646000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: ÔÓËÒÍ lifo fifo ÓÒÚ‡ÚÍÓ‚ ÔÓ Ï‡ÚÂË‡ÎÛ
/*
/*  ŒÃ¿Õƒ€:
/*   ADD
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBSASH0A
PARAMETER USING MBSAMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XXSTMN0L
LOCAL USING MBSAST0L
LOCAL USING MBSAST0A
LOCAL
1 #I    (I4)
END-DEFINE
DEFINE SUBROUTINE MBSASH2S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE MBSASH0A.BL-COMMAND
VALUE "SUMMA"
  PERFORM SALDO-SUMMA
NONE VALUE
  MOVE MBSASH0A.BL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE SALDO-SUMMA
  RESET MBSAMN0A
  MOVE BY NAME MBSASH0A TO MBSAMN0A
  RESET MBSASH0A.DF-ID
  PERFORM STACK-INIT
  MOVE "SEARCH" TO MBSASH0A.BL-COMMAND
  PERFORM MBSASH0S XXERX00A XXCTXX0A MBSASH0A MBSAST0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBSAMN0A.DF-ID TO MBSASH0A.DF-ID
  FOR #I = 1 TO STACK-LEN
     MOVE #I TO STACK-POS
     CALL "RWSX" STACK-POS STACK-REC-B(1) STACK-READ  STACK-NUMBER
     IF MBSASH0A.DF-ID NE 0 AND
        MBSASH0A.DF-ID NE MBSAST0L.DF-ID THEN
        ESCAPE TOP
     END-IF
     IF MBSASH0A.BASE-EI-ID NE 0 AND
        MBSASH0A.BASE-EI-ID NE MBSAST0L.BASE-EI-ID THEN
        ESCAPE TOP
     END-IF
     IF MBSASH0A.PRIH-EI-ID NE 0 AND
        MBSASH0A.PRIH-EI-ID NE MBSAST0L.PRIH-EI-ID THEN
        ESCAPE TOP
     END-IF
     IF MBSASH0A.PLAN-EI-ID NE 0 AND
        MBSASH0A.PLAN-EI-ID NE MBSAST0L.PLAN-EI-ID THEN
        ESCAPE TOP
     END-IF
     ADD MBSAST0L.BASE-COL TO MBSAMN0A.BASE-COL
     ADD MBSAST0L.PRIH-COL TO MBSAMN0A.PRIH-COL
     ADD MBSAST0L.PLAN-COL TO MBSAMN0A.PLAN-COL
     ADD MBSAST0L.BALC-SUMMA TO MBSAMN0A.BALC-SUMMA
  END-FOR
  PERFORM STACK-FREE
END-SUBROUTINE
/*
INCLUDE XXSTMN4C "MBSAST0A" "MBSAST0L-CONST" "MBSAST0L"
        "STACK-INIT" "STACK-FREE" "STACK-REALLOC"
        "STACK-PUSH" "STACK-READ" "STACK-WRITE" "STACK-LOCATE"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

