* >Natural Source Header 000000 /*<RO>>
* :NatName MBSARK0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070106
* :Time 2054000
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX0A
PARAMETER USING MBSARK0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“‹ › –¿Õ¿
LOCAL USING MBSARK0L
LOCAL USING XPMXSM0L
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»— 
LOCAL USING XPMOSH0A
LOCAL USING XPMTSH0A
LOCAL USING MBMTMN0A
LOCAL USING XPZKSH0A
LOCAL USING XPGMSH0A
/*
LOCAL USING MBPRMN0A
LOCAL USING MBBSMN0A
LOCAL USING MBLKHM0A
LOCAL USING MBMOMN0A
/*LOCAL USING MBGMMN0A
LOCAL USING MBZKMN0A
LOCAL USING UXCSXX0A
LOCAL USING XXSOXX0L
LOCAL USING XPSOSH0A
LOCAL
1 #I   (I4)
1 #DATE (D)
END-DEFINE
DEFINE SUBROUTINE MBSARK0S
/*
MX-EDITOR-NAME := '    Œ—“¿“ »'
/*
INCLUDE XPMFMN0C '"""MBSARK0M"""'
/* STANDART COMMANDS
INCLUDE XPRKMP0C
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  IF RETURN-CODE EQ 2501 THEN
    PERFORM SCREEN-LOAD
    RETURN-CODE := 2501
  ELSE
    PERFORM SCREEN-LOAD
  END-IF
END-SUBROUTINE
/***********************************************************************
DEFINE SUBROUTINE SCREEN-CHECK /* œ–Œ¬≈– ¿ › –¿Õ¿
  /* œ–Œ¬≈– ¿ Õ¿À»◊»ﬂ «¿œŒÀÕ≈Õ»ﬂ  –»“≈–»≈¬ œŒ»— ¿
  IF MBSARK0L.SA-DT-N EQ 0 THEN
     MOVE *DATX TO #DATE
     ADD 1 TO #DATE
     MOVE EDITED #DATE (EM=YYYYMMDD) TO MBSARK0L.SA-DT-A
  END-IF
  INCLUDE XPDTCH0C 'MBSARK0L.SA-DT-N' 'TRUE'
  /* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  MOVE MBSARK0L.MO-CODE TO CP-CHECK-SEARCH
  IF MBSARK0L.MO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MBSARK0L.MO-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MBSARK0L.MT-CODE TO CP-CHECK-SEARCH
  IF MBSARK0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MBSARK0L.MT-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MBSARK0L.GM-CODE TO CP-CHECK-SEARCH
  IF MBSARK0L.GM-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPGMSH0A.SH-COMMAND
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MBSARK0L.GM-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
/* œ¿–“»ﬂ
  IF MBSARK0L.PR-OBJECT-C MODIFIED OR
     MBSARK0L.PR-CODE NE 0 AND MBSARK0L.PR-ID EQ 0 THEN
     RESET MBSARK0L.PR-ID
     MOVE BY NAME MBSARK0L TO MBPRMN0A
     MOVE "LOCATE" TO MBPRMN0A.BL-COMMAND
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ EC-OBJECT-NOT-FOUND THEN
        MOVE 2415 TO RETURN-CODE
     END-IF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MBSARK0L.PR-CODE)
        ESCAPE ROUTINE
     END-IF
     IF MBPRMN0A.PR-ID NE 0 THEN
        MOVE MBPRMN0A.PR-ID TO MBSARK0L.PR-ID
        MOVE MBPRMN0A.PR-CODE TO MBSARK0L.PR-CODE
     END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT  /* ¬€¡Œ– Œ¡⁄≈ “¿
/* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  IF CP-CURS-FIELD EQ POS(MBSARK0L.MO-SEARCH) THEN
     MOVE "SELECT" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MBSARK0L.MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MBSARK0L.GM-SEARCH)THEN
     XPGMSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-LOAD /* «¿√–”« ¿ › –¿Õ¿
  MOVE BY NAME MBSARK0A TO MBSARK0L
  MOVE EDITED MBSARK0A.SA-DT (EM=YYYYMMDD) TO MBSARK0L.SA-DT-A
/*
  IF MBSARK0L.MO-ID NE 0  THEN
     MOVE BY NAME MBSARK0L TO MBMOMN0A
     MBMOMN0A.BL-COMMAND := 'READ'
     PERFORM MBMOMN0S XXERX00A XXCTXX0A MBMOMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBMOMN0A TO MBSARK0L
     MOVE MBMOMN0A.MO-CODE TO MBSARK0L.MO-SEARCH
  END-IF
  /* Ã¿“≈–»¿À€
  IF MBSARK0L.MT-ID NE 0 THEN
     MOVE BY NAME MBSARK0L TO MBMTMN0A
     MBMTMN0A.BL-COMMAND := 'READ'
     PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBMTMN0A TO MBSARK0L
     MOVE MBMTMN0A.MT-CODE TO MBSARK0L.MT-SEARCH
  END-IF
/* œ¿–“»ﬂ
  IF MBSARK0L.PR-ID NE 0 THEN
     MOVE BY NAME MBSARK0L TO MBPRMN0A
     MBPRMN0A.BL-COMMAND := 'READ'
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBPRMN0A TO MBSARK0L
  END-IF
/*
  IF MBSARK0L.ZK-ID NE 0  THEN
     MOVE BY NAME MBSARK0L TO MBZKMN0A
     MBZKMN0A.BL-COMMAND := 'READ'
     PERFORM MBZKMN0S XXERX00A XXCTXX0A MBZKMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBZKMN0A TO MBSARK0L
  END-IF
/*
  IF MBSARK0L.LK-ID NE 0 THEN
     MOVE BY NAME MBSARK0L TO MBLKHM0A
     MBLKHM0A.BL-COMMAND := 'READ'
     PERFORM MBLKHM0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBLKHM0A TO MBSARK0L
  END-IF
/*
  IF MBSARK0L.BS-ID NE 0 THEN
     MOVE BY NAME MBSARK0L TO MBBSMN0A
     MBBSMN0A.BL-COMMAND := 'READ'
     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBBSMN0A TO MBSARK0L
  END-IF
/*
  MOVE MBSARK0L.DF-CODE TO CP-CHECK-SEARCH
  IF MBSARK0L.DF-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPSOSH0A.SH-COMMAND
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN
/*        cp-curs-pos := pos(MBSARK0L.df-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
/*
/*  IF MBSARK0L.GM-ID NE 0 THEN
/*     MBGMMN0A.BL-COMMAND := 'READ'
/*     MOVE BY NAME MBSARK0L TO MBGMMN0A
/*     PERFORM MBGMMN0S XXERX00A XXCTXX0A MBGMMN0A UXCSXX0A
/*     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
/*     MOVE BY NAME MBGMMN0A TO MBSARK0L
/*  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOAD  /* –¿«√–”« ¿ › –¿Õ¿
  MOVE BY NAME MBSARK0L TO MBSARK0A
  IF SA-DT-A NE ' '
     MOVE EDITED SA-DT-A TO SA-DT(EM=YYYYMMDD)
  END-IF
END-SUBROUTINE
/*
/*
DEFINE SUBROUTINE SEARCH-MO
  IF XPMOSH0A.SH-COMMAND EQ "LOCATE" AND
     MBSARK0L.MO-SEARCH EQ " " THEN
     RESET MBSARK0L.MO-ID MBSARK0L.MO-CODE
           MBSARK0L.MO-NAME MBSARK0L.MO-SEARCH
     ESCAPE ROUTINE
  END-IF
  IF XXCTXX0A.US-MO-ID NE 0 OR MX-COMMAND EQ "EDIT" THEN
     ESCAPE ROUTINE
  END-IF
  RESET XPMOSH0A.MO-ID
  MOVE MBSARK0L.MO-SEARCH TO XPMOSH0A.MO-SEARCH
  PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
  IF RETURN-CODE EQ 0 AND XPMOSH0A.MO-ID NE 0 THEN
     MOVE XPMOSH0A.MO-ID TO MBSARK0L.MO-ID
     MOVE XPMOSH0A.MO-CODE TO MBSARK0L.MO-CODE
     MOVE XPMOSH0A.MO-NAME TO MBSARK0L.MO-NAME
     MOVE XPMOSH0A.MO-CODE TO MBSARK0L.MO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MBSARK0L.MT-SEARCH EQ " " THEN
     RESET MBSARK0L.MT-ID MBSARK0L.MT-CODE MBSARK0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MBSARK0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE BY NAME MBMTMN0A TO MBSARK0L
     MOVE MBMTMN0A.MT-CODE TO MBSARK0L.MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-GM
  IF XPGMSH0A.SH-COMMAND EQ "LOCATE" AND
     MBSARK0L.GM-SEARCH EQ " " THEN
     RESET MBSARK0L.GM-ID MBSARK0L.GM-CODE MBSARK0L.GM-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPGMSH0A.GM-ID
  MOVE MBSARK0L.GM-SEARCH TO XPGMSH0A.GM-SEARCH
  PERFORM XPGMSH0S XXERX00A XXCTXX0A XPGMSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPGMSH0A.GM-ID NE 0 THEN
     MOVE XPGMSH0A.GM-ID TO MBSARK0L.GM-ID
     MOVE XPGMSH0A.GM-CODE TO MBSARK0L.GM-CODE
     MOVE XPGMSH0A.GM-NAME TO MBSARK0L.GM-NAME
     MOVE XPGMSH0A.GM-CODE TO MBSARK0L.GM-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-DF
  IF XPSOSH0A.SH-COMMAND EQ "LOCATE" AND
     MBSARK0L.DF-SEARCH EQ " " THEN
     RESET MBSARK0L.DF-ID MBSARK0L.DF-CODE MBSARK0L.DF-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPSOSH0A.SO-ID
  MOVE MBSARK0L.DF-SEARCH TO XPSOSH0A.SO-SEARCH
  MOVE SO-TYPE-DF TO XPSOSH0A.SO-TYPE
  PERFORM XPSOSH0S XXERX00A XXCTXX0A XPSOSH0A
  IF RETURN-CODE EQ 0 AND XPSOSH0A.SO-ID NE 0 THEN
     MOVE XPSOSH0A.SO-ID TO MBSARK0L.DF-ID
     MOVE XPSOSH0A.SO-CODE TO MBSARK0L.DF-CODE
     MOVE XPSOSH0A.SO-NAME TO MBSARK0L.DF-NAME
     MOVE XPSOSH0A.SO-CODE TO MBSARK0L.DF-SEARCH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END


