* >Natural Source Header 000000 /*<RO>>
* :NatName MBSDHM0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20070215
* :Time 1505000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  «‡„ÓÎÓ‚ÓÍ ‡ÒıÓ‰‡ ÔÓ À« 
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*   LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBSDHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MXDRAT0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBSDHM0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C "MBSDHM0A" "SD-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC "DC-NUMBER-ATTR-ID"   "SD-NUMBER"
  INCLUDE XBDRSPDC "DC-DATE-ATTR-ID"     "SD-DATE"
  INCLUDE XBDRSPIC "DR-MO-ATTR-ID"       "MO-ID"
  INCLUDE XBDRSPIC "DR-GM-ATTR-ID"       "GM-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  RESET MBSDHM0A
  INCLUDE XBDRSUAC "DC-NUMBER-ATTR-ID"   "SD-NUMBER"
  INCLUDE XBDRSUDC "DC-DATE-ATTR-ID"     "SD-DATE"
  INCLUDE XBDRSUIC "DR-MO-ATTR-ID"       "MO-ID"
  INCLUDE XBDRSUIC "DR-GM-ATTR-ID"       "GM-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C "2001"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

