* >Natural Source Header 000000 /*<RO>>
* :NatName MBSFMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20100321
* :Time 2016000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - ADD
/*  - CHEK
/*  - LOCATE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBSFMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
END-DEFINE
DEFINE SUBROUTINE MBSFMN0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C 'MBSFMN0A' 'SF-ID'
/*WRITE "SF" MBSFMN0A.BL-COMMAND SF-ID SF-DATE VO-ID MBSFMN0A.OG-ID TD-ID
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC '10000' 'SF-NUMBER'
  INCLUDE XBDRSPDC '10001' 'SF-DATE'
  INCLUDE XBDRSPIC '20002' 'VO-ID'
  INCLUDE XBDRSPIC '30002' 'MBSFMN0A.OG-ID'
  INCLUDE XBDRSPIC '10145' "TD-ID"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  INCLUDE XBDRSUAC '10000' 'SF-NUMBER'
  INCLUDE XBDRSUDC '10001' 'SF-DATE'
  INCLUDE XBDRSUIC '20002' 'VO-ID'
  INCLUDE XBDRSUIC '30002' 'MBSFMN0A.OG-ID'
  INCLUDE XBDRSUIC "10145" 'TD-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1100'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END


