* >Natural Source Header 000000 /*<RO>>
* :NatName MBSODF1C
* :UID Админист
* :Mode S
* :CP
* :Date 20070110
* :Time 2338000
* <Natural Source Header /*<<RO>
     MOVE CXDFS0DL.DF-CODE TO XPOTDF1L.DF-CODE(#I)
     MOVE CXDFS0DL.DF-NAME TO XPOTDF1L.DF-NAME(#I)
     MOVE CXDFS0DL.DF-ID TO XPOTDF1L.DF-ID(#I)
     RESET XPOTDF1L.OT-CMD-C(#I)

