* >Natural Source Header 000000 /*<RO>>
* :NatName MBTDMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20100321
* :Time 1932000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBTDMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBTDMN0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C "MBTDMN0A" "TD-ID"
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC '10000' "TD-NUMBER"
  INCLUDE XBDRSPDC '10001' "TD-DATE"
  INCLUDE XBDRSPAC '10144' "TD-COUNTRY"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  INCLUDE XBDRSUAC '10000' "TD-NUMBER"
  INCLUDE XBDRSUDC '10001' "TD-DATE"
  INCLUDE XBDRSUAC '10144' "TD-COUNTRY"
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1250'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

