* >Natural Source Header 000000 /*<RO>>
* :NatName MBTTMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060620
* :Time 1831000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBTTMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRMN0A
LOCAL USING XBDRSX0L
LOCAL USING XBLTMN0A
/*
END-DEFINE
DEFINE SUBROUTINE MBTTMN0S
RESET XXERX00A
/*
INCLUDE MBXXMN1C 'MBTTMN0A' 'TT-ID'
/*
DEFINE SUBROUTINE RECORD-PACK
  INCLUDE XBDRSPAC '10000' 'TT-NUMBER'
  INCLUDE XBDRSPDC '10001' 'TT-DATE'
  INCLUDE XBDRSPIC '20002' 'VO-ID'
  INCLUDE XBDRSPIC '30002' 'MBTTMN0A.OG-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNPACK
  INCLUDE XBDRSUAC '10000' 'TT-NUMBER'
  INCLUDE XBDRSUDC '10001' 'TT-DATE'
  INCLUDE XBDRSUIC '20002' 'VO-ID'
  INCLUDE XBDRSUIC '30002' 'MBTTMN0A.OG-ID'
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE MBXXMN0C '1200'
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

