* >Natural Source Header 000000 /*<RO>>
* :NatName MBXXDO2C
* :UID OLEG
* :Mode S
* :CP
* :Date 20061025
* :Time 1303000
* <Natural Source Header /*<<RO>
  IF &1& NE 0 THEN
     ADD 1 TO ATTR-COUNTER
     MOVE &2& TO MBXXDO1L.ATTR-CODE(ATTR-COUNTER)
     MOVE &1& TO MBXXDO1L.ATTR-VALUE(ATTR-COUNTER)
     MOVE &3& TO MBXXDO1L.OP-ATTR(ATTR-COUNTER)
  END-IF

