* >Natural Source Header 000000 /*<RO>>
* :NatName MBXXDS0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070531
* :Time 1333000
* <Natural Source Header /*<<RO>
/* ƒ»—œ≈◊≈– –¿¡Œ“€ —Œ —“≈ ¿Ã»
/* Õ¿ ¬’Œƒ≈
/*      -  ¿ Œ… —“≈ 

DEFINE DATA
  PARAMETER USING XXERX00A
  PARAMETER USING MBXXDS0A
  PARAMETER USING MBXXSS0A
  PARAMETER USING MBXXOP0A
  PARAMETER USING XXCTXX0A
  LOCAL USING CXMOS0XA
  LOCAL USING CXGMS0XA
  LOCAL USING CXBSS0XA
  LOCAL USING CXMTS0XA
  LOCAL USING CXXXS0CA
  LOCAL USING CXPRS0XA
  LOCAL USING CXITS0XA
  LOCAL USING XXXXEC0L
  LOCAL USING MBXXOP0L
  LOCAL USING CXZKS0XA
  LOCAL USING CXDFS0XA
  LOCAL USING XXSOXX0L
LOCAL
1 #I         (I4)
1 #INDEX     (I4)
1 #K   (I4)
END-DEFINE
DEFINE SUBROUTINE MBXXDS0S
/* Œœ–≈ƒ≈Àﬂ≈Ã  ¿ Œ… “»œ —“≈ ¿ Õ¿ƒŒ »—œŒÀ‹«Œ¬¿“‹
  DECIDE ON FIRST MBXXDS0A.OP-TYPE-STEK
     VALUE "STEK-MO"
        PERFORM STEK-MO
     VALUE "STEK-MT"   /* Ã¿“≈–»¿À
        PERFORM STEK-MT
     VALUE "STEK-GM"   /* √–”œœ¿ Ã¿“≈–»¿ÀŒ¬
        PERFORM STEK-GM
     VALUE "STEK-PR"   /*
        PERFORM STEK-PR
     VALUE "STEK-BS"   /*
        PERFORM STEK-BS
     VALUE "STEK-IT"   /*
        PERFORM STEK-IT
     VALUE "STEK-ZK"   /*
        PERFORM STEK-ZK
     VALUE "STEK-DF"   /*
        PERFORM STEK-DF
     VALUE "MT-BASE"   /* ŒÒÌÓ‚ÌÓÈ ÒÚÂÍ
        PERFORM STEK-MB
     NONE VALUE
        WRITE 'Õ≈ ’¬¿“¿≈“ ¿Õ¿À»“»◊≈— »’ —“≈ Œ¬'
        IGNORE
  END-DECIDE
/********************************

DEFINE SUBROUTINE STEK-MO
  INCLUDE MBXXDS0C "'STEK-MO'" "CXMOS0XA.MO-COMMAND" "CXMOS0XA"
                 "CXMOS0XS" "CXMOS0XA.MO-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-MT
  INCLUDE MBXXDS0C "'STEK-MT'" "CXMTS0XA.MT-COMMAND" "CXMTS0XA"
                 "CXMTS0XS" "CXMTS0XA.MT-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-MB
  INCLUDE MBXXDS0C "'STEK-MB'" "CXMTS0XA.MT-COMMAND" "CXMTS0XA"
                 "CXMTS0XS" "CXMTS0XA.MT-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-GM
  INCLUDE MBXXDS0C "'STEK-GM'" "CXGMS0XA.GM-COMMAND" "CXGMS0XA"
                 "CXGMS0XS" "CXGMS0XA.GM-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-BS
  INCLUDE MBXXDS0C "'STEK-BS'" "CXBSS0XA.BS-COMMAND" "CXBSS0XA"
                 "CXBSS0XS" "CXBSS0XA.BS-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-PR
  INCLUDE MBXXDS0C "'STEK-PR'" "CXPRS0XA.PR-COMMAND" "CXPRS0XA"
                 "CXPRS0XS" "CXPRS0XA.PR-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-IT
  INCLUDE MBXXDS0C "'STEK-IT'" "CXITS0XA.IT-COMMAND" "CXITS0XA"
                 "CXITS0XS" "CXITS0XA.IT-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-ZK
  INCLUDE MBXXDS0C "'STEK-ZK'" "CXZKS0XA.ZK-COMMAND" "CXZKS0XA"
                 "CXZKS0XS" "CXZKS0XA.ZK-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE STEK-DF
  MOVE SO-TYPE-DF TO CXDFS0XA.SO-TYPE
  INCLUDE MBXXDS0C "'STEK-DF'" "CXDFS0XA.DF-COMMAND" "CXDFS0XA"
                 "CXDFS0XS" "CXDFS0XA.DF-SEARCH"
END-SUBROUTINE
INCLUDE XXERSY1C

END-SUBROUTINE
END
