* >Natural Source Header 000000 /*<RO>>
* :NatName MBXXDO0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20070605
* :Time 1629000
* <Natural Source Header /*<<RO>
/* √ŒÀŒ¬Õ¿ﬂ œ–Œ√–¿ÃÃ¿ «¿œŒÀÕ≈Õ»ﬂ Œ—ÕŒ¬ÕŒ√Œ —“≈ ¿ » ”œ–¿¬À≈Õ»ﬂ ¬—œŒÃŒ√¿“≈À‹Õ€Ã» —“≈ ¿Ã»
/* Õ¿ Œ—ÕŒ¬≈ Œœ»—¿Õ»ﬂ
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MBXXSS0A
PARAMETER USING MBSAST0A
PARAMETER USING MBXXOP0A
/*
LOCAL USING MXITAT0L
LOCAL USING MBXXDS0A
LOCAL USING MBXXDO0L
/*LOCAL USING CXXXS0CA
LOCAL USING MBSAST0L
LOCAL USING XPPBXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING MBXXDO1L
LOCAL USING MBXXOP0L
LOCAL
/*
1 #I (I4)
/* 1 #J (I4)
1 #RECORD-A (B8)
1 REDEFINE #RECORD-A
  2 #REC-1  (B4)
  2 #REC-2  (B4)
1 #K   (I4)
1 #STACK (I4)
1 #VALUE-N    (N20/1:40)
1 REDEFINE #VALUE-N
  2 #VALUE-A (A20/1:40)
1 #VALUE-N1   (N16)
1 REDEFINE #VALUE-N1
  2 #VALUE-A1 (A16)
1 #KOL-POK    (I4)
1 #KOL-AN     (I4)
1 #KOL-EA     (I4)  /*  ŒÀ-¬Œ ›À≈Ã≈Õ“Œ¬ —“≈ ¿ œŒƒ ¿Õ¿À»“» »
1 #FLAG-A     (L)   INIT <FALSE>
1 #Q          (I4)
1 #W          (I2)
1 #EL-M       (I4)
1 #AN-ELEM    (I4)
1 #OUT-STEK   (B4)
1 #STEK       (B4)
/***********
1 #BS-ID1  (N15)
1 REDEFINE #BS-ID1
2 BLANK (N5)
2 OG-ID1 (N5)
2 BS-ID1 (N5)
1 #RECODR-VIEW (L) INIT <FALSE>
1 #POKAZAT7    (N15)
1 REDEFINE #POKAZAT7
  2 #POK-N7    (N8.7)
1 #POKAZAT2    (N15)
1 REDEFINE #POKAZAT2
  2 #POK-N2    (N13.2)
END-DEFINE
DEFINE SUBROUTINE MBXXDO0S
 #BS-ID1.OG-ID1 := 1000
 #BS-ID1.BS-ID1 := 311
MOVE FALSE TO MBXXOP0A.OP-PRIZNAK(*)
/* ¬€◊»“€¬¿≈Ã Œœ»—¿Õ»≈
  MOVE 'LOCATE' TO MBXXOP0A.OP-COMMAND
  MOVE XXCTXX0A.OP-ID TO MBXXOP0A.OP-ID
  PERFORM MBXXOP0S XXERX00A MBXXOP0A
/*
INCLUDE MBXXDO0C /* ƒÀ»Õ¿ «¿œ»—»
/* ◊»“¿≈Ã »—’ŒƒÕ€… —“≈ 
INCLUDE XPPBIN0C "MBSAST0A.STACK-LEN" '"–‡Ò¯ËÙÓ‚Í‡ ÒÔ‡‚Ó˜ÌËÍÓ‚"'
/*
/* –¿—œ–≈ƒ≈À≈Õ»≈ Œ—ÕŒ¬ÕŒ√Œ —“≈ ¿
  EXAMINE MBXXSS0A.DS-TYPE-STEK(*) FOR 'ONCE' GIVING INDEX #STACK
  IF #STACK = 0 THEN
     CALL 'GTNX' #OUT-STEK
     ADD 1 TO MBXXSS0A.C-STACK
     #STACK := MBXXSS0A.C-STACK
     MOVE #OUT-STEK TO MBXXSS0A.STACK-NUMBER(#STACK)
     MOVE 'ONCE' TO MBXXSS0A.DS-TYPE-STEK(#STACK)
  ELSE
     MOVE MBXXSS0A.STACK-NUMBER(#STACK) TO #OUT-STEK
  END-IF
  MOVE MBXXDO0L.STACK-REC-LENR TO MBXXDO0L.STACK-FIELD-LEN
  MOVE MBSAST0A.STACK-LEN TO MBXXDO0L.STACK-FIELD-POS
  CALL 'GTSX' MBXXDO0L.STACK-FIELD-LEN MBXXDO0L.STACK-FIELD-POS #OUT-STEK
  MOVE MBSAST0A.STACK-LEN TO MBXXSS0A.STACK-COUNT(#STACK)
  RESET MBXXSS0A.STACK-LEN(#STACK)
/*
FOR  MBSAST0L.STACK-POS-I = 1 TO MBSAST0A.STACK-LEN
  /*
  INCLUDE XPPBST0C "MBSAST0L.STACK-POS-I"
  /*
  MOVE  MBSAST0L.STACK-POS-I TO MBSAST0L.STACK-POS
  CALL "RWSX" MBSAST0L.STACK-POS MBSAST0L.STACK-REC-B(1) MBXXDO0L.STACK-READ
              MBSAST0A.STACK-NUMBER
/*   MOVE #BS-ID1 TO MBSAST0L.BS-ID
/*
/*  WRITE '=' MBSAST0L.PRIH-COL '=' MBSAST0L.BASE-COL
/*     '=' MBSAST0L.PLAN-COL '=' MBSAST0L.BALC-SUMMA
  IF MBSAST0L.PRIH-COL EQ 0 AND MBSAST0L.BASE-COL EQ 0 AND
     MBSAST0L.PLAN-COL EQ 0 AND MBSAST0L.BALC-SUMMA EQ 0 THEN
     ESCAPE TOP
  END-IF
  IF #RECODR-VIEW = FALSE
     #RECODR-VIEW := TRUE
  END-IF
  RESET MBXXDO0L.OS-NPP MBXXDO0L.OS-SORT
  RESET MBXXDO0L.ANALITIK(1:#KOL-AN)
  RESET MBXXDO0L.POKAZAT(#KOL-EA+1:75)
/*  WRITE #KOL-AN #KOL-EA #KOL-POK
  PERFORM RECORD-PACK
/*  WRITE BASE-MT-ID MT-ID BASE-EI-ID BASE-COL PLAN-EI-ID PLAN-COL
/***********************************************************************
/* Õ¿ Œ—ÕŒ¬¿Õ»» Œœ»—¿Õ»ﬂ ‘Œ–Ã»–”≈Ã ¿Õ¿À»“»◊≈— »≈ —“≈ »
/***********************************************************************
  FOR MBXXOP0A.OP-ID-ARRAY = 1 TO MBXXOP0L-CONST.OP-ARRAY-ELEM
     IF MBXXOP0A.OP-POR-NUMBER(OP-ID-ARRAY) = 0
        ESCAPE BOTTOM
     END-IF
     DECIDE ON FIRST VALUE MBXXOP0A.OP-ATTR(OP-ID-ARRAY)
     VALUE "AN"
        PERFORM FIND-ELEM-STACK
        IF MBXXDS0A.SEARCH-ID NE 0
           MOVE TRUE TO MBXXOP0A.OP-PRIZNAK(OP-ID-ARRAY)
           MOVE MBXXOP0A.OP-TYPE-STEK(OP-ID-ARRAY) TO MBXXDS0A.OP-TYPE-STEK
           MOVE 'LOCATE' TO MBXXDS0A.DS-COMMAND
           PERFORM MBXXDS0S XXERX00A MBXXDS0A MBXXSS0A MBXXOP0A XXCTXX0A
           IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
           /* «¿œŒÀÕﬂ≈Ã «¿œ»—‹ ƒÀﬂ «¿œ»—» ¬ —“≈ 
           MOVE MBXXOP0A.OP-ID-ARRAY TO #K
           IF *USER EQ "ARMK01" THEN
              IF MBXXOP0A.OP-CODE-AT(OP-ID-ARRAY) EQ MT-BASE-ATTR-ID
                 AND MBXXDS0A.DS-ELEM-STEK EQ 0 THEN
                 WRITE *PROGRAM MBXXOP0A.OP-POR-NUMBER(#K)
                       MBXXDS0A.SEARCH-ID MBXXDS0A.DS-ELEM-STEK
              END-IF
           END-IF
           IF MBXXDS0A.DS-ELEM-STEK NE 0
              #EL-M := MBXXOP0A.OP-POR-NUMBER(#K)
              MOVE MBXXDS0A.DS-ELEM-STEK TO MBXXDO0L.ANALITIK(#EL-M)
           ELSE
              WRITE '›À≈Ã≈Õ“ Õ≈ Õ¿…ƒ≈Õ ¬ —“≈ ≈'
           END-IF
        END-IF
     VALUE "EI" , "PK"
        #EL-M := (MBXXOP0A.OP-POR-NUMBER(OP-ID-ARRAY) - #KOL-AN) + #KOL-EA
        PERFORM FIND-ELEM-STACK
        MOVE MBXXDS0A.SEARCH-ID TO MBXXDO0L.POKAZAT(#EL-M)
     NONE VALUE
        WRITE 'Œÿ»¡ ¿ ¬ Œœ»—¿Õ»»!!!'
     END-DECIDE
  END-FOR
  /*
  /* «¿œŒÀÕ≈Õ»≈ Œ—ÕŒ¬ÕŒ√Œ —“≈ ¿
  MOVE MBXXSS0A.STACK-LEN(#STACK) TO MBXXDO0L.STACK-POS-I
  ADD 1 TO MBXXDO0L.STACK-POS-I
  MOVE MBXXDO0L.STACK-POS-I TO MBXXSS0A.STACK-LEN(#STACK)
  MOVE MBXXDO0L.STACK-POS-I TO MBXXDO0L.OS-NPP
  MOVE MBXXDO0L.STACK-POS-I TO MBXXDO0L.OS-SORT
  /*
  CALL 'RWSX' MBXXSS0A.STACK-LEN(#STACK) MBXXDO0L.STACK-REC-B(1)
        MBXXDO0L.STACK-WRITE  MBXXSS0A.STACK-NUMBER(#STACK)
/*  RESET MBXXDO0L.STACK-REC-G
END-FOR
  IF #RECODR-VIEW = FALSE
     *ERROR-NR := EC-OBJECT-NOT-FOUND
  END-IF
  /* —Œ’–¿Õﬂ≈Ã œ¿–¿Ã≈“–€ Œ—ÕŒ¬ÕŒ√Œ —“≈ ¿
/*  MOVE CXXXS0CA.STACK-NUMBER TO MBXXSS0A.STACK-NUMBER(#K)
/*  MOVE CXXXS0CA.STACK-COUNT  TO MBXXSS0A.STACK-COUNT(#K)
/*  MOVE CXXXS0CA.STACK-LEN    TO MBXXSS0A.STACK-LEN(#K)
/*  MOVE CXXXS0CA.STACK-ID     TO MBXXSS0A.STACK-ID(#K)
/*
/* Û‰‡ÎÂÌËÂ ‚ıÓ‰ÌÓ„Ó ÒÚÂÍ‡
CALL "FRSX" MBSAST0A.STACK-NUMBER
RESET MBSAST0A
/*
DEFINE SUBROUTINE FIND-ELEM-STACK
  RESET MBXXDS0A.SEARCH-ID
  FOR #I = 1 TO ATTR-COUNTER
     IF MBXXOP0A.OP-CODE-AT(OP-ID-ARRAY) = MBXXDO1L.ATTR-CODE(#I) AND
        MBXXOP0A.OP-ATTR(OP-ID-ARRAY) = MBXXDO1L.OP-ATTR(#I)
        MOVE ATTR-VALUE(#I) TO MBXXDS0A.SEARCH-ID
        ESCAPE BOTTOM
     END-IF
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-PACK
  RESET MBXXDO1L.ATTR-COUNTER MBXXDO1L.ATTR-G(*)
  INCLUDE MBXXDO2C "MO-ID" "10003" "'AN'"
  INCLUDE MBXXDO2C "MT-ID" "10050" "'AN'"
/*IF *USER EQ "ARMK01" THEN
/*  WRITE MBXXDO1L.ATTR-CODE(ATTR-COUNTER)
/*        MBXXDO1L.ATTR-VALUE(ATTR-COUNTER)
/*END-IF
  INCLUDE MBXXDO2C "GM-ID" "10061" "'AN'"
  INCLUDE MBXXDO2C "PR-ID" "10060" "'AN'"
  INCLUDE MBXXDO2C "LK-ID" "10065" "'AN'"
  INCLUDE MBXXDO2C "ZK-ID" "10066" "'AN'"
  INCLUDE MBXXDO2C "BS-ID" "10009" "'AN'"
  INCLUDE MBXXDO2C "DF-ID" "10067" "'AN'"
  INCLUDE MBXXDO2C "BASE-MT-ID" "MT-BASE-ATTR-ID" "'AN'"
/*IF *USER EQ "ARMK01" THEN
/*  WRITE MBXXDO1L.ATTR-CODE(ATTR-COUNTER)
/*        MBXXDO1L.ATTR-VALUE(ATTR-COUNTER)
/*END-IF
  INCLUDE MBXXDO2C "BASE-EI-ID" "10103" "'EI'"
  MOVE BASE-COL TO #POK-N7
  INCLUDE MBXXDO2C "#POKAZAT7" "10103" "'PK'"
  INCLUDE MBXXDO2C "PRIH-EI-ID" "10102" "'EI'"
  MOVE PRIH-COL TO #POK-N7
  INCLUDE MBXXDO2C "#POKAZAT7" "10102" "'PK'"
  INCLUDE MBXXDO2C "PLAN-EI-ID" "10104" "'EI'"
  MOVE PLAN-COL TO #POK-N7
  INCLUDE MBXXDO2C "#POKAZAT7" "10104" "'PK'"
  MOVE BALC-SUMMA TO #POK-N2
  INCLUDE MBXXDO2C "#POKAZAT2" "10105" "'PK'"
  INCLUDE MBXXDO2C "IT-ID" "50000" "'AN'"
END-SUBROUTINE
INCLUDE XXERSY1C
END-SUBROUTINE
END
