* >Natural Source Header 000000 /*<RO>>
* :NatName MELKHM0S
* :UID ARMK522
* :Mode S
* :CP
* :Date 20080714
* :Time 0935000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — «¿√ŒÀŒ¬ ŒÃ œ–»’ŒƒÕŒ√Œ Œ–ƒ≈–¿
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MELKHM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING MBLKHM0A
LOCAL USING MBLKRM0A
LOCAL USING MBZKMN0A
LOCAL USING MBMTMN0A
LOCAL USING MBMOMN0A
LOCAL USING MBEIMN0A
LOCAL USING XBDPMN0A
/*
LOCAL USING XXXXEC0L
/*
LOCAL
1 #DATA (A8)
1 REDEFINE #DATA
2 #DATA-YYYY (N4)
1 #ADD-IS-REQUIRED (L)
/*
END-DEFINE
DEFINE SUBROUTINE MELKHM0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE ME-COMMAND
  VALUE "LOCK"
     PERFORM RECORD-LOCK
  VALUE "SET"
     RESET MELKHM0A.LK-ID
     PERFORM RECORD-SET
  VALUE "UPDATE"
     PERFORM RECORD-SET
  VALUE "READ"
     PERFORM RECORD-READ
  NONE VALUE
     MOVE ME-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-LOCK
  MOVE MELKHM0A.LK-ID TO MBLKHM0A.LK-ID
  MOVE "LOCK" TO MBLKHM0A.BL-COMMAND
  PERFORM MBLKHM0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
  IF RETURN-CODE EQ EC-OBJECT-ALREADY-LOCKED THEN ESCAPE ROUTINE END-IF
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-SET
/* Ã¿“≈–»¿À
  MOVE BY NAME MELKHM0A TO MBMTMN0A
  IF MBMTMN0A.MT-CODE EQ ' ' THEN
    RETURN-CODE := 2402 ESCAPE ROUTINE END-IF
  MOVE 'LOCATE' TO MBMTMN0A.BL-COMMAND
  PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
         RETURN-CODE := 2402 ESCAPE ROUTINE
     ELSE  *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  END-IF
/* ≈ƒ»Õ»÷¿ »«Ã≈–≈Õ»ﬂ
  MOVE MBMTMN0A.EI-ID TO MBEIMN0A.EI-ID
  MOVE "READ" TO MBEIMN0A.BL-COMMAND
  PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* œŒƒ–¿«ƒ≈À≈Õ»≈
  MOVE BY NAME MELKHM0A TO XBDPMN0A
IF XBDPMN0A.DP-CODE EQ 0 THEN RETURN-CODE := 2417 ESCAPE ROUTINE END-IF
  MOVE 'LOCATE' TO XBDPMN0A.BL-COMMAND
  PERFORM XBDPMN0S XXERX00A XXCTXX0A XBDPMN0A
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
         RETURN-CODE := 2417 ESCAPE ROUTINE
     ELSE  *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  END-IF
/* MATEP»AÀ‹HO OTBETCTBEHH€…
  MOVE BY NAME MELKHM0A TO MBMOMN0A
IF MBMOMN0A.MO-CODE EQ 0 THEN RETURN-CODE := 2406 ESCAPE ROUTINE END-IF
  MOVE 'LOCATE' TO MBMOMN0A.BL-COMMAND
  PERFORM MBMOMN0S XXERX00A XXCTXX0A MBMOMN0A
/*WRITE RETURN-CODE MBMOMN0A.MO-ID MBMOMN0A.MO-CODE
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
         RETURN-CODE := 2406 ESCAPE ROUTINE
     ELSE  *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  END-IF
/* «¿ ¿«
  MOVE BY NAME MELKHM0A TO MBZKMN0A
  IF MBZKMN0A.ZK-CODE EQ ' ' THEN
    RETURN-CODE := 2410 ESCAPE ROUTINE END-IF
  MOVE 'LOCATE' TO MBZKMN0A.BL-COMMAND
  PERFORM MBZKMN0S XXERX00A XXCTXX0A MBZKMN0A
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
         RETURN-CODE := 2410 ESCAPE ROUTINE
     ELSE  *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  END-IF
/* »Ÿ≈Ã —¿Ã ƒŒ ”Ã≈Õ“
  IF MELKHM0A.LK-ID NE 0 THEN
     MOVE "READ" TO MBLKHM0A.BL-COMMAND
     MOVE MELKHM0A.LK-ID TO MBLKHM0A.LK-ID
  ELSE
     MOVE MELKHM0A.LK-NUMBER TO MBLKHM0A.LK-NUMBER
     MOVE MELKHM0A.LK-DATE TO MBLKHM0A.LK-DATE
     MOVE "LOCATE" TO MBLKHM0A.BL-COMMAND
  END-IF
  PERFORM MBLKHM0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
        MOVE "ADD" TO MBLKHM0A.BL-COMMAND
   ELSE IF RETURN-CODE EQ 8006 THEN ESCAPE ROUTINE END-IF
   *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  ELSE
     MOVE "UPDATE" TO MBLKHM0A.BL-COMMAND
     MOVE MBLKHM0A.LK-ID TO MELKHM0A.LK-ID
  END-IF
  MOVE BY NAME MBMTMN0A TO MELKHM0A
  MOVE BY NAME MBEIMN0A TO MELKHM0A
  MOVE BY NAME MBMOMN0A TO MELKHM0A
  MOVE BY NAME XBDPMN0A TO MELKHM0A
  MOVE BY NAME MBZKMN0A TO MELKHM0A
     IF MELKHM0A.LK-NUMBER EQ MBLKHM0A.LK-NUMBER AND
        MELKHM0A.LK-DATE EQ MBLKHM0A.LK-DATE AND
        MELKHM0A.LK-DT-START EQ MBLKHM0A.LK-DT-START AND
        MELKHM0A.LK-DT-STOP EQ MBLKHM0A.LK-DT-STOP AND
        MELKHM0A.LK-COL EQ MBLKHM0A.LK-COL AND
        MELKHM0A.MT-ID EQ MBLKHM0A.MT-ID AND
        MELKHM0A.ZK-ID EQ MBLKHM0A.ZK-ID AND
        MELKHM0A.DP-ID EQ MBLKHM0A.DP-ID AND
        MELKHM0A.MO-ID EQ MBLKHM0A.MO-ID THEN
/*      WRITE 'skip' MELKHM0A.LK-NUMBER MELKHM0A.LK-DATE
        ESCAPE ROUTINE
/*   ELSE
/*       WRITE MBLKHM0A.BL-COMMAND MELKHM0A.LK-NUMBER MELKHM0A.LK-DATE
     END-IF
  MOVE BY NAME MELKHM0A TO MBLKHM0A
  PERFORM MBLKHM0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
/*  WRITE MBLKHM0A.BL-COMMAND RETURN-CODE
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MBLKHM0A TO MELKHM0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
/* ◊»“¿≈Ã ƒŒ ”Ã≈Õ“
  MOVE MELKHM0A.LK-ID TO MBLKHM0A.LK-ID
  MOVE 'READ' TO MBLKHM0A.BL-COMMAND
  PERFORM MBLKHM0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* ◊»“¿≈Ã ÚÂıÌË˜ÂÒÍÛ˛ Á‡ÔËÒ¸
  MOVE MELKHM0A.LK-ID TO MBLKRM0A.LKR-ID
  MOVE "READ-TR" TO MBLKRM0A.BL-COMMAND
  PERFORM MBLKRM0S XXERX00A XXCTXX0A MBLKRM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* Ã¿“≈–»¿À
  MOVE MBLKHM0A.MT-ID TO MBMTMN0A.MT-ID
  MOVE 'READ' TO MBMTMN0A.BL-COMMAND
  PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* ≈ƒ»Õ»÷¿ »«Ã≈–≈Õ»ﬂ
  MOVE MBLKHM0A.EI-ID TO MBEIMN0A.EI-ID
  MOVE 'READ' TO MBEIMN0A.BL-COMMAND
  PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* MATEP»AÀ‹HO OTBETCTBEHH€…
  MOVE MBLKHM0A.MO-ID TO MBMOMN0A.MO-ID
  MOVE 'READ' TO MBMOMN0A.BL-COMMAND
  PERFORM MBMOMN0S XXERX00A XXCTXX0A MBMOMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* œŒƒ–¿«ƒ≈À≈Õ»≈
  MOVE MBLKHM0A.DP-ID TO XBDPMN0A.DP-ID
  MOVE 'READ' TO XBDPMN0A.BL-COMMAND
  PERFORM XBDPMN0S XXERX00A XXCTXX0A XBDPMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* «¿ ¿«
  MOVE MBLKHM0A.ZK-ID TO MBZKMN0A.ZK-ID
  MOVE 'READ' TO MBZKMN0A.BL-COMMAND
  PERFORM MBZKMN0S XXERX00A XXCTXX0A MBZKMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* »Ÿ≈Ã —¿Ã ƒŒ ”Ã≈Õ“
  RESET MELKHM0A
  MOVE BY NAME MBLKHM0A TO MELKHM0A
  MOVE BY NAME MBMTMN0A TO MELKHM0A
  MOVE BY NAME MBEIMN0A TO MELKHM0A
  MOVE BY NAME XBDPMN0A TO MELKHM0A
  MOVE BY NAME MBZKMN0A TO MELKHM0A
  MOVE MBLKRM0A.PLAN-COL TO MELKHM0A.FACT-COL
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
