* >Natural Source Header 000000 /*<RO>>
* :NatName MEPMMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20071030
* :Time 1054000
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MEPMMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XBTXMN0A
LOCAL USING MBMTMN0A
LOCAL USING MBNDMN0A
LOCAL USING MBEIMN0A
LOCAL USING MBPHMN0A
LOCAL USING MBPMMN0A
LOCAL USING MBPRMN0A
LOCAL USING MBBSMN0A
LOCAL USING UBODMN0A
LOCAL USING MXPXXODL
LOCAL USING MBSASH0A
LOCAL USING MBSAMN0A
LOCAL
1 #OD-IS-NOT-USED   (L)
1 #I (I2)
1 #IS-FOUND (L)
END-DEFINE
DEFINE SUBROUTINE MEPMMN0S
/*
RESET XXERX00A
DECIDE ON FIRST VALUE ME-COMMAND
  VALUE 'INIT'
     PERFORM RECORD-INIT
     PERFORM OP-EXTEND
  VALUE "CHECK-MTEI"
     PERFORM CHECK-MTEI
  VALUE 'READ'
     PERFORM RECORD-READ
  VALUE 'UPDATE'
     PERFORM RECORD-UPDATE
  VALUE 'ADD'
     PERFORM RECORD-ADD
  VALUE 'DELETE'
     PERFORM RECORD-DELETE
  VALUE "CONFIRM"
     PERFORM RECORD-CONFIRM
  VALUE "UNLOAD"
     PERFORM RECORD-UNLOAD
  NONE VALUE
     MOVE ME-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE CHECK-MT-COL
  RESET RETURN-CODE
  MOVE MBPMMN0A.PO-ID TO MBPHMN0A.PO-ID
  MOVE "READ" TO MBPHMN0A.BL-COMMAND
  PERFORM MBPHMN0S XXERX00A XXCTXX0A MBPHMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  RESET MBSASH0A
  MOVE UBODMN0A.OD-IT-ID(2) TO MBSASH0A.IT-ID(1)
  MOVE MBPHMN0A.PO-ID TO MBSASH0A.DR-EXCLUDE
  MOVE MBPHMN0A.MO-ID TO MBSASH0A.MO-ID
  MOVE MBPMMN0A.PR-ID TO MBSASH0A.PR-ID
  MOVE MBPMMN0A.MT-ID TO MBSASH0A.MT-ID
  MOVE MBPMMN0A.BASE-EI-ID TO MBSASH0A.BASE-EI-ID
  MOVE MBPMMN0A.EI-ID TO MBSASH0A.PRIH-EI-ID
  MOVE "SUMMA" TO MBSASH0A.BL-COMMAND
  PERFORM MBSASH2S XXERX00A XXCTXX0A MBSASH0A MBSAMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OP-EXTEND
  RESET IS-NOT-PRICE
  IF XXCTXX0A.OD-ID NE 0 THEN
     MOVE XXCTXX0A.OD-ID TO UBODMN0A.OD-ID
     MOVE "READ" TO UBODMN0A.BL-COMMAND
     PERFORM UBODMN0S XXERX00A XXCTXX0A UBODMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE UBODMN0A.OD-IT-ID(1) TO PX-OD-TYPE
     IF PRICE-NOT-REQUIRED NE 0 THEN
        MOVE TRUE TO MEPMMN0A.IS-NOT-PRICE
     END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-INIT
/* Õ¿◊¿À‹ÕŒ≈ «¿œŒÀÕ≈Õ»≈ «¿œ»—»
  MOVE BY NAME MEPMMN0A TO MBPMMN0A
/*  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-EXTEND
  /* œ¿–“»ﬂ
  IF MBPMMN0A.PR-ID NE MBPRMN0A.PR-ID THEN
     MOVE MBPMMN0A.PR-ID TO MBPRMN0A.PR-ID
     MOVE "READ" TO MBPRMN0A.BL-COMMAND
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  END-IF
  MOVE BY NAME MBPRMN0A TO MEPMMN0A
  MOVE BY NAME MBPMMN0A TO MEPMMN0A
  /* ≈ƒ»Õ»÷¿ »«Ã≈–≈Õ»ﬂ
  MOVE MBPMMN0A.EI-ID TO MBEIMN0A.EI-ID
  MOVE "READ" TO MBEIMN0A.BL-COMMAND
  PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  /* Ã¿“≈–»¿À
  IF MBPMMN0A.MT-ID NE MBMTMN0A.MT-ID THEN
     MOVE MBPMMN0A.MT-ID TO MBMTMN0A.MT-ID
     MOVE "READ" TO MBMTMN0A.BL-COMMAND
     PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  END-IF
  MOVE MBMTMN0A.MT-CODE TO MEPMMN0A.MT-CODE
  MOVE MBMTMN0A.MT-NAME TO MEPMMN0A.MT-NAME
  MOVE MBMTMN0A.PLACE TO MEPMMN0A.MT-PLACE
  /* ¬Œ——“¿ÕŒ¬»Ã ≈ƒ»Õ»÷” »«Ã≈–≈Õ»ﬂ
  MOVE BY NAME MBEIMN0A TO MEPMMN0A
  /* Œ—ÕŒ¬Õ¿ﬂ ≈ƒ»Õ»÷¿ »«Ã≈–≈Õ»ﬂ
  MOVE MBPMMN0A.BASE-EI-ID TO MBEIMN0A.EI-ID
  MOVE "READ" TO MBEIMN0A.BL-COMMAND
  PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBEIMN0A.EI-ID TO MEPMMN0A.BASE-EI-ID
  MOVE MBEIMN0A.EI-CODE TO MEPMMN0A.BASE-EI-CODE
  MOVE MBEIMN0A.EI-SHORT-NAME TO MEPMMN0A.BASE-EI-SHORT-NAME
  /* —“¿¬ ¿ Õƒ—
  IF MBPMMN0A.ND-ID NE 0 THEN
     MOVE MBPMMN0A.ND-ID TO MBNDMN0A.ND-ID
     MOVE "READ" TO MBNDMN0A.BL-COMMAND
     PERFORM MBNDMN0S XXERX00A XXCTXX0A MBNDMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE BY NAME MBNDMN0A TO MEPMMN0A
  END-IF
  /*
  IF MBPMMN0A.IN-BS-ID EQ 0 THEN
     MOVE MBMTMN0A.BS-ID TO MBPMMN0A.IN-BS-ID
  END-IF
  MOVE MBPMMN0A.IN-BS-ID TO MBBSMN0A.BS-ID
  MOVE "READ" TO MBBSMN0A.BL-COMMAND
  PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBBSMN0A.BS-ID TO MEPMMN0A.IN-BS-ID
  MOVE MBBSMN0A.BS-CODE TO MEPMMN0A.IN-BS-CODE
/* READ header
  MOVE MEPMMN0A.PO-ID TO MBPHMN0A.PO-ID
  MOVE 'READ' TO MBPHMN0A.BL-COMMAND
  PERFORM MBPHMN0S XXERX00A XXCTXX0A MBPHMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  IF MBPMMN0A.OUT-BS-ID EQ 0 THEN
     MOVE MBPHMN0A.OUT-BS-ID TO MBPMMN0A.OUT-BS-ID
  END-IF
  /*
  IF MBPMMN0A.OUT-BS-ID NE 0 THEN
     MOVE MBPMMN0A.OUT-BS-ID TO MBBSMN0A.BS-ID
     MOVE "READ" TO MBBSMN0A.BL-COMMAND
     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBBSMN0A.BS-ID TO MEPMMN0A.OUT-BS-ID
     MOVE MBBSMN0A.BS-CODE TO MEPMMN0A.OUT-BS-CODE
  END-IF
  IF MBPMMN0A.NDS-BS-ID EQ 0 THEN
     MOVE MBPHMN0A.NDS-BS-ID TO MBPMMN0A.NDS-BS-ID
  END-IF
  IF MBPMMN0A.NDS-BS-ID NE 0 THEN
     MOVE MBPMMN0A.NDS-BS-ID TO MBBSMN0A.BS-ID
     MOVE "READ" TO MBBSMN0A.BL-COMMAND
     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBBSMN0A.BS-ID TO MEPMMN0A.NDS-BS-ID
     MOVE MBBSMN0A.BS-CODE TO MEPMMN0A.NDS-BS-CODE
  END-IF
  IF MEPMMN0A.CONF-CENA-SUMMA EQ 0 THEN
     MEPMMN0A.CONF-CENA-SUMMA := MEPMMN0A.DR-CENA-SUMMA
  END-IF
  IF MEPMMN0A.CONF-NDS-SUMMA EQ 0 THEN
     MEPMMN0A.CONF-NDS-SUMMA := MEPMMN0A.DR-NDS-SUMMA
  END-IF
  MEPMMN0A.CONF-ALL-SUMMA := MEPMMN0A.CONF-CENA-SUMMA +
        MEPMMN0A.CONF-NDS-SUMMA
  PERFORM OP-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE CHECK-MTEI
  PERFORM OP-EXTEND
  IF MEPMMN0A.MT-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.EI-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.DR-COL EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  /*
  MOVE MEPMMN0A.MT-ID TO MBMTMN0A.MT-ID
  MOVE "READ" TO MBMTMN0A.BL-COMMAND
  PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBMTMN0A.BS-ID TO MEPMMN0A.IN-BS-ID
  MOVE MBMTMN0A.GM-ID TO MEPMMN0A.GM-ID
  MOVE MBMTMN0A.EI-ID TO MEPMMN0A.BASE-EI-ID
  RESET MEPMMN0A.BASE-COL-TYPE
  IF MEPMMN0A.BASE-EI-ID NE MEPMMN0A.EI-ID THEN
     RESET #IS-FOUND
     FOR #I = 1 TO 10
        IF MEPMMN0A.EI-ID EQ MBMTMN0A.CVT-EI-ID(#I) THEN
           #IS-FOUND := TRUE
           COMPUTE ROUNDED MEPMMN0A.BASE-COL =
                 MBMTMN0A.CVT-COL(#I) * MEPMMN0A.DR-COL
           MEPMMN0A.BASE-COL-TYPE := 1
        END-IF
     END-FOR
     IF NOT #IS-FOUND THEN
        MEPMMN0A.BASE-COL-TYPE := 2
     END-IF
  ELSE
     MEPMMN0A.BASE-COL := MEPMMN0A.DR-COL
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  /*
  MOVE MEPMMN0A.PM-ID TO MBPMMN0A.PM-ID
  MOVE 'READ' TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  /*
  RESET MEPMMN0A
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UNLOAD
  PERFORM RECORD-READ
  WRITE WORK FILE 7 MEPMMN0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-PREPARE
  PERFORM CHECK-MTEI
  IF MEPMMN0A.BASE-COL-TYPE EQ 2 AND MEPMMN0A.BASE-COL EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
/*
  MEPMMN0A.DR-ALL-SUMMA := MEPMMN0A.DR-NDS-SUMMA +
        MEPMMN0A.DR-CENA-SUMMA
  MEPMMN0A.CONF-ALL-SUMMA := MEPMMN0A.CONF-NDS-SUMMA +
        MEPMMN0A.CONF-CENA-SUMMA
  IF MEPMMN0A.DR-COL EQ MEPMMN0A.CONF-COL AND
     MEPMMN0A.DR-CENA-SUMMA EQ MEPMMN0A.CONF-CENA-SUMMA AND
     MEPMMN0A.DR-NDS-SUMMA EQ MEPMMN0A.CONF-NDS-SUMMA AND
     MEPMMN0A.IN-BS-ID NE 0 AND MEPMMN0A.OUT-BS-ID NE 0 AND
     MEPMMN0A.NDS-BS-ID NE 0 THEN
     MEPMMN0A.IS-DR-CONFIRMED := TRUE
  ELSE
     MEPMMN0A.IS-DR-CONFIRMED := FALSE
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-ADD
  IF MEPMMN0A.PO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  RESET MEPMMN0A.CONF-CENA-SUMMA
   MEPMMN0A.CONF-NDS-SUMMA
   MEPMMN0A.CONF-ALL-SUMMA
  PERFORM RECORD-PREPARE
  RESET  MEPMMN0A.CONF-COL MEPMMN0A.CONF-CENA-SUMMA
        MEPMMN0A.CONF-NDS-SUMMA MEPMMN0A.CONF-ALL-SUMMA
/* ƒŒ¡¿¬»Ã œ¿–“»ﬁ
  MOVE BY NAME MEPMMN0A TO MBPRMN0A
  MOVE "ADD" TO MBPRMN0A.BL-COMMAND
  PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBPRMN0A.PR-ID TO MEPMMN0A.PR-ID
/* ƒŒ¡¿¬»Ã «¿œ»—‹
  MOVE BY NAME MEPMMN0A TO MBPMMN0A
  MBPMMN0A.IS-DR-CONFIRMED := FALSE
  MOVE 'ADD' TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* Œ¡ÕŒ¬»Ã œ¿–“»ﬂ
  MOVE MBPMMN0A.PO-ID TO MBPRMN0A.DC-ID
  MOVE MBPMMN0A.PM-ID TO MBPRMN0A.DR-ID
  MOVE 'UPDATE' TO MBPRMN0A.BL-COMMAND
  PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UPDATE
/*
  IF MEPMMN0A.PO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.PM-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  PERFORM RECORD-PREPARE
/* READ
  MOVE MEPMMN0A.PM-ID TO MBPMMN0A.PM-ID
  MOVE 'READ' TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
  MOVE MBPMMN0A.CONF-COL TO MEPMMN0A.CONF-COL
  MOVE MBPMMN0A.CONF-CENA-SUMMA TO MEPMMN0A.CONF-CENA-SUMMA
  MOVE MBPMMN0A.CONF-NDS-SUMMA TO MEPMMN0A.CONF-NDS-SUMMA
  MOVE MBPMMN0A.CONF-ALL-SUMMA TO MEPMMN0A.CONF-ALL-SUMMA
/* UPDATE PARTY
  MOVE MBPMMN0A.PR-ID TO MBPRMN0A.PR-ID
  MOVE "READ" TO MBPRMN0A.BL-COMMAND
  PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  PERFORM CHECK-MT-COL
  IF MBPRMN0A.MT-ID EQ MEPMMN0A.MT-ID AND
     MEPMMN0A.BASE-EI-ID EQ MBPMMN0A.BASE-EI-ID AND
     MEPMMN0A.EI-ID EQ MBPMMN0A.EI-ID THEN
     ADD MEPMMN0A.BASE-COL TO MBSAMN0A.BASE-COL
  END-IF
  IF MBSAMN0A.BASE-COL < 0 THEN
     RETURN-CODE := 2421
     ESCAPE ROUTINE
  END-IF
  IF MBPRMN0A.MT-ID NE MEPMMN0A.MT-ID THEN
     MOVE "ADD" TO MBPRMN0A.BL-COMMAND
  ELSE
     MOVE MBPMMN0A.PR-ID TO MBPRMN0A.PR-ID
     MOVE MBPMMN0A.PR-ID TO MEPMMN0A.PR-ID
     MOVE "UPDATE" TO MBPRMN0A.BL-COMMAND
  END-IF
  MOVE BY NAME MEPMMN0A TO MBPRMN0A
  MOVE MBPMMN0A.PO-ID TO MBPRMN0A.DC-ID
  MOVE MBPMMN0A.PM-ID TO MBPRMN0A.DR-ID
  PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBPRMN0A.PR-ID TO MBPMMN0A.PR-ID
  MOVE MBPRMN0A.PR-ID TO MEPMMN0A.PR-ID
/* UPDATE RECORD
  MOVE BY NAME MEPMMN0A TO MBPMMN0A
  MOVE 'UPDATE' TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-CONFIRM
/*
  IF MEPMMN0A.PO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.PM-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.IN-BS-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.OUT-BS-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.NDS-BS-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF MEPMMN0A.CONF-COL EQ 0 THEN
        *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
/*IF MEPMMN0A.CONF-CENA-SUMMA EQ 0 THEN
/*      *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
/*IF MEPMMN0A.CONF-NDS-SUMMA EQ 0 THEN
/*      *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED END-IF
  PERFORM RECORD-PREPARE
/* READ position
  MOVE MEPMMN0A.PM-ID TO MBPMMN0A.PM-ID
  MOVE 'READ' TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MEPMMN0A.IN-BS-ID TO MBPMMN0A.IN-BS-ID
  MOVE MEPMMN0A.OUT-BS-ID TO MBPMMN0A.OUT-BS-ID
  MOVE MEPMMN0A.NDS-BS-ID TO MBPMMN0A.NDS-BS-ID
  MOVE MEPMMN0A.CONF-COL TO MBPMMN0A.CONF-COL
  MOVE MEPMMN0A.CONF-CENA-SUMMA TO MBPMMN0A.CONF-CENA-SUMMA
  MOVE MEPMMN0A.CONF-NDS-SUMMA TO MBPMMN0A.CONF-NDS-SUMMA
  MOVE MEPMMN0A.CONF-ALL-SUMMA TO MBPMMN0A.CONF-ALL-SUMMA
  MOVE MEPMMN0A.IS-DR-CONFIRMED TO MBPMMN0A.IS-DR-CONFIRMED
/* UPDATE RECORD
/*  MOVE BY NAME MEPMMN0A TO MBPMMN0A
  /* ÕÂ ÔÓËÁ‚Ó‰ËÏ ÔÂÂÒ˜ÂÚ ÔÓ‚Ó‰ÓÍ
  #OD-IS-NOT-USED := XXCTXX0A.OD-IS-NOT-USED
  XXCTXX0A.OD-IS-NOT-USED := TRUE
/*
  MOVE 'UPDATE' TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  /* ‚ÓÒÚ‡ÌÓ‚ËÏ Ó·‡·ÓÚÍÛ ÔÓ‚Ó‰ÓÍ ‰Ó ‚ÓÁÏÓÊÌÓ„Ó ËÒÍÎ˛˜ÂÌË
  XXCTXX0A.OD-IS-NOT-USED := #OD-IS-NOT-USED
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/* ”ƒ¿À»“‹ «¿œ»—‹
DEFINE SUBROUTINE RECORD-DELETE
  PERFORM OP-EXTEND
  MOVE MEPMMN0A.PM-ID TO MBPMMN0A.PM-ID
  MOVE "READ" TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*IF MBPMMN0A.IS-DR-CONFIRMED THEN
/*   RETURN-CODE := 2409
/*   ESCAPE ROUTINE
/*END-IF
  PERFORM CHECK-MT-COL
  IF MBSAMN0A.BASE-COL < 0 THEN
     RETURN-CODE := 2421
     ESCAPE ROUTINE
  END-IF
  MOVE "DELETE" TO MBPMMN0A.BL-COMMAND
  PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
