* >Natural Source Header 000000 /*<RO>>
* :NatName MEPOPM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070628
* :Time 1145000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MEPOPLSA
PARAMETER USING MEPOPM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
/* ŒÒÌÓ‚ÌÓÈ ÒÚÂÍ
LOCAL USING MEPOPLSL
/* —ÚÂÍ Ò‡Î¸‰Ó
LOCAL USING MBMTSA1A
LOCAL USING MBSAST0A
LOCAL USING MBSAST0L
/* ƒÓÒÚÛÔ Í ‰ÓÍÛÏÂÌÚÛ
/*LOCAL USING MBRLHM0A
LOCAL USING MBRXPM0A
LOCAL USING MBDRXL0A
LOCAL USING MBPMMN0A
LOCAL USING MBPMLS0A
/* À« 
LOCAL USING MBLKHM0A
/*
LOCAL USING MBMOMN0A
/*
LOCAL USING UBODMN0A
LOCAL USING MBPRMN0A
LOCAL USING MBMTMN0A
LOCAL USING MBGMMN0A
LOCAL USING MBNDMN0A
LOCAL USING MBEIMN0A
LOCAL USING MXPXXODL
LOCAL USING XBSOMN0A
LOCAL USING XXSOXX0L
LOCAL
1 #I       (I4)
1 #J       (I4)
1 #K       (I4)
END-DEFINE
DEFINE SUBROUTINE MEPOPM0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE MEPOPM0A.ME-COMMAND
VALUE "READ"
  PERFORM RECORD-READ
VALUE "UPDATE"
  PERFORM RECORD-UPDATE
  PERFORM RECORD-READ
NONE VALUE
  MOVE MBMTSA1A.BL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-READ
  IF MEPOPM0A.STACK-POS < 1 OR MEPOPM0A.STACK-POS > MEPOPLSA.STACK-LEN THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  MOVE MEPOPM0A.STACK-POS TO MEPOPLSL.STACK-POS
  PERFORM STACK-READ
  MOVE BY NAME MEPOPLSL TO MEPOPM0A
  /*
  MOVE MEPOPLSL.PR-ID TO MBPRMN0A.PR-ID
  MOVE "READ" TO MBPRMN0A.BL-COMMAND
  PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MBPRMN0A TO MEPOPM0A
  /* ≈ƒ»Õ»÷¿ »«Ã≈–≈Õ»ﬂ
  MOVE MEPOPLSL.EI-ID TO MBEIMN0A.EI-ID
  MOVE "READ" TO MBEIMN0A.BL-COMMAND
  PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  /* Ã¿“≈–»¿À
  MOVE MEPOPLSL.MT-ID TO MBMTMN0A.MT-ID
  MOVE "READ" TO MBMTMN0A.BL-COMMAND
  PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBMTMN0A.MT-CODE TO MEPOPM0A.MT-CODE
  MOVE MBMTMN0A.MT-NAME TO MEPOPM0A.MT-NAME
  /* ¬Œ——“¿ÕŒ¬»Ã ≈ƒ»Õ»÷” »«Ã≈–≈Õ»ﬂ
  MOVE BY NAME MBEIMN0A TO MEPOPM0A
  /* Œ—ÕŒ¬Õ¿ﬂ ≈ƒ»Õ»÷¿ »«Ã≈–≈Õ»ﬂ
  MOVE MEPOPLSL.BASE-EI-ID TO MBEIMN0A.EI-ID
  MOVE "READ" TO MBEIMN0A.BL-COMMAND
  PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBEIMN0A.EI-ID TO MEPOPM0A.BASE-EI-ID
  MOVE MBEIMN0A.EI-CODE TO MEPOPM0A.BASE-EI-CODE
  MOVE MBEIMN0A.EI-SHORT-NAME TO MEPOPM0A.BASE-EI-SHORT-NAME
  /* —“¿¬ ¿ Õƒ—
  IF MEPOPLSL.ND-ID NE 0 THEN
     MOVE MEPOPLSL.ND-ID TO MBNDMN0A.ND-ID
     MOVE "READ" TO MBNDMN0A.BL-COMMAND
     PERFORM MBNDMN0S XXERX00A XXCTXX0A MBNDMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE BY NAME MBNDMN0A TO MEPOPM0A
  END-IF
  MEPOPM0A.COL := MEPOPM0A.BASE-COL + MEPOPM0A.DC-BASE-COL
  MEPOPM0A.COL-LIMIT := MEPOPM0A.BASE-COL - MEPOPM0A.OST-BASE-COL
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UPDATE
  MOVE MEPOPM0A.STACK-POS TO MEPOPLSL.STACK-POS
  PERFORM STACK-READ
  IF MEPOPM0A.COL NE MEPOPLSL.BASE-COL + MEPOPLSL.DC-BASE-COL THEN
     IF MEPOPM0A.COL < MEPOPLSL.BASE-COL - MEPOPLSL.OST-BASE-COL THEN
        MEPOPM0A.COL := MEPOPLSL.BASE-COL - MEPOPLSL.OST-BASE-COL
     END-IF
     MOVE BY NAME MEPOPLSL.STACK-REC-G TO MBPMMN0A
     COMPUTE ROUNDED MEPOPLSL.DC-BASE-COL =
           MEPOPM0A.COL - MEPOPLSL.BASE-COL
     COMPUTE ROUNDED MEPOPLSL.DC-PRIH-COL =
           MEPOPLSL.DR-COL * MEPOPLSL.DC-BASE-COL / MEPOPLSL.BASE-COL
     COMPUTE ROUNDED MEPOPLSL.DC-CENA-SUMMA =
           MEPOPLSL.DR-CENA-SUMMA * MEPOPLSL.DC-BASE-COL / MEPOPLSL.BASE-COL
     COMPUTE ROUNDED MEPOPLSL.DC-NDS-SUMMA =
           MEPOPLSL.DR-NDS-SUMMA * MEPOPLSL.DC-BASE-COL / MEPOPLSL.BASE-COL
/*     WRITE MEPOPLSL.DC-BASE-COL MEPOPLSL.DC-PRIH-COL MEPOPLSL.DC-CENA-SUMMA
     MOVE MEPOPLSL.DC-BASE-COL TO MBPMMN0A.BASE-COL
     MOVE MEPOPLSL.DC-PRIH-COL TO MBPMMN0A.DR-COL
     MOVE MEPOPLSL.DC-CENA-SUMMA TO MBPMMN0A.DR-CENA-SUMMA
     MOVE MEPOPLSL.DC-NDS-SUMMA TO MBPMMN0A.DR-NDS-SUMMA
     MBPMMN0A.DR-ALL-SUMMA := MBPMMN0A.DR-CENA-SUMMA + MBPMMN0A.DR-NDS-SUMMA
     MBPMMN0A.STORNO-POM-ID := MEPOPLSL.PM-ID
     IF MEPOPLSL.DC-PM-ID NE 0 THEN
        MOVE MEPOPLSL.DC-PM-ID TO MBPMMN0A.PM-ID
        IF MBPMMN0A.BASE-COL EQ 0 THEN
           MOVE "DELETE" TO MBPMMN0A.BL-COMMAND
        ELSE
           MOVE "UPDATE" TO MBPMMN0A.BL-COMMAND
        END-IF
     ELSE
        RESET MBPMMN0A.PM-ID
        MOVE "ADD" TO MBPMMN0A.BL-COMMAND
     END-IF
     PERFORM MBPMMN0S XXERX00A XXCTXX0A MBPMMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBPMMN0A.PM-ID TO MEPOPLSL.DC-PM-ID
     PERFORM STACK-WRITE
  END-IF
END-SUBROUTINE
/* ”Ô‡‚ÎÂÌËÂ ÓÒÌÓ‚Ì˚Ï ÒÚÂÍÓÏ
INCLUDE XXSTMN4C "MEPOPLSA" "MEPOPLSL-CONST" "MEPOPLSL"
        "STACK-INIT" "STACK-FREE" "STACK-REALLOC"
        "STACK-PUSH" "STACK-READ" "STACK-WRITE" "STACK-LOCATE"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
