* >Natural Source Header 000000 /*<RO>>
* :NatName MERLPM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070125
* :Time 0125000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — «¿√ŒÀŒ¬ ŒÃ
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MERLPM0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XBTXMN0A
/*
LOCAL USING MBRLPM0A
LOCAL USING MBPRMN0A
LOCAL USING MBEIMN0A
/*
LOCAL
1 #DATA             (A8)
1 REDEFINE #DATA
2 #DATA-YYYY        (N4)
END-DEFINE
DEFINE SUBROUTINE MERLPM0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE ME-COMMAND
  VALUE "LOCK"
     PERFORM RECORD-LOCK
  VALUE "EXTEND"
     PERFORM RECORD-EXTEND
  VALUE "READ"
     PERFORM RECORD-READ
  NONE VALUE
     MOVE ME-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-LOCK
  MOVE MERLPM0A.RLP-ID TO MBRLPM0A.RLP-ID
  MOVE "LOCK" TO MBRLPM0A.BL-COMMAND
  PERFORM MBRLPM0S XXERX00A XXCTXX0A MBRLPM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-EXTEND
  MOVE MERLPM0A.PR-ID TO MBPRMN0A.PR-ID
  MOVE "READ" TO MBPRMN0A.BL-COMMAND
  PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE MBPRMN0A.PR-CODE TO MERLPM0A.PR-CODE
  IF MERLPM0A.EI-ID NE 0 THEN
     MOVE MERLPM0A.EI-ID TO MBEIMN0A.EI-ID
     MOVE "READ" TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBEIMN0A.EI-CODE TO MERLPM0A.EI-CODE
     MOVE MBEIMN0A.EI-SHORT-NAME TO MERLPM0A.EI-SHORT-NAME
  END-IF
  IF MERLPM0A.BASE-EI-ID NE 0 THEN
     MOVE MERLPM0A.BASE-EI-ID TO MBEIMN0A.EI-ID
     MOVE "READ" TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBEIMN0A.EI-CODE TO MERLPM0A.BASE-EI-CODE
     MOVE MBEIMN0A.EI-SHORT-NAME TO MERLPM0A.BASE-EI-SHORT-NAME
  END-IF
  IF MERLPM0A.PLAN-EI-ID NE 0 THEN
     MOVE MERLPM0A.PLAN-EI-ID TO MBEIMN0A.EI-ID
     MOVE "READ" TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBEIMN0A.EI-CODE TO MERLPM0A.PLAN-EI-CODE
     MOVE MBEIMN0A.EI-SHORT-NAME TO MERLPM0A.PLAN-EI-SHORT-NAME
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  /* ¬€«€¬¿≈Ã œ–Œ÷≈ƒ”–€ ◊“≈Õ»ﬂ œ–»’ŒƒÕŒ√Œ Œ–ƒ≈–¿
  MOVE MERLPM0A.RLP-ID TO MBRLPM0A.RLP-ID
  MOVE "READ" TO MBRLPM0A.BL-COMMAND
  PERFORM MBRLPM0S XXERX00A XXCTXX0A MBRLPM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MBRLPM0A TO MERLPM0A
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-DELETE
  *ERROR-NR  := EC-UNKNOW-COMMAND
  IF MERLPM0A.RLP-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
