* >Natural Source Header 000000 /*<RO>>
* :NatName MERLZM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20071030
* :Time 1326000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— –¿¡Œ“¿ — «¿√ŒÀŒ¬ ŒÃ
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   ADD
/*   UPDATE
/*   DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING MERLZM0A
PARAMETER USING MERLZLSA
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
/*
LOCAL USING MERLZLSL
/*
LOCAL USING MBMTMN0A
LOCAL USING MBMZMN0A
LOCAL USING MBEIMN0A
LOCAL USING MBLKHM0A
LOCAL USING MERLMM0A
LOCAL USING MBRLMM0A
/*
LOCAL
1 #DATA             (A8)
1 REDEFINE #DATA
2 #DATA-YYYY        (N4)
END-DEFINE
DEFINE SUBROUTINE MERLZM0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE MERLZM0A.ME-COMMAND
  VALUE "READ"
     PERFORM RECORD-READ
  VALUE "UPDATE"
     PERFORM RECORD-UPDATE
  NONE VALUE
     MOVE MERLZM0A.ME-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-EXTEND
  IF MERLZM0A.MT-ID NE 0 THEN
     MOVE MERLZM0A.MT-ID TO MBMTMN0A.MT-ID
     MOVE "READ" TO MBMTMN0A.BL-COMMAND
     PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE BY NAME MBMTMN0A TO MERLZM0A
     MOVE MBMTMN0A.PLACE TO MERLZM0A.MT-PLACE
  END-IF
  IF MERLZM0A.BASE-EI-ID NE 0 THEN
     MOVE MERLZM0A.BASE-EI-ID TO MBEIMN0A.EI-ID
     MOVE "READ" TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBEIMN0A.EI-CODE TO MERLZM0A.BASE-EI-CODE
     MOVE MBEIMN0A.EI-SHORT-NAME TO MERLZM0A.BASE-EI-SHORT-NAME
  END-IF
  IF MERLZM0A.PLAN-EI-ID NE 0 THEN
     MOVE MERLZM0A.PLAN-EI-ID TO MBEIMN0A.EI-ID
     MOVE "READ" TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBEIMN0A.EI-CODE TO MERLZM0A.PLAN-EI-CODE
     MOVE MBEIMN0A.EI-SHORT-NAME TO MERLZM0A.PLAN-EI-SHORT-NAME
  END-IF
  IF MERLZM0A.MZ-ID NE 0 THEN
     MOVE MERLZM0A.MZ-ID TO MBMZMN0A.MZ-ID
     MOVE "READ" TO MBMZMN0A.BL-COMMAND
     PERFORM MBMZMN0S XXERX00A XXCTXX0A MBMZMN0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE MBMZMN0A.KART-NUMBER TO MERLZM0A.MZ-KART-NUMBER
     MOVE MBMZMN0A.COMMENT TO MERLZM0A.MZ-COMMENT
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  MOVE MERLZM0A.STACK-POS TO MERLZLSL.STACK-POS
  PERFORM STACK-READ
/*  WRITE MERLZM0A.MT-ID MERLZM0A.BASE-COL MERLZM0A.BASE-COL-LIMIT
  /*
  MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLZM0A
/*  WRITE MERLZM0A.MT-ID
  PERFORM RECORD-EXTEND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-UPDATE
  IF MERLZM0A.RL-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  MOVE MERLZM0A.STACK-POS TO MERLZLSL.STACK-POS
  PERFORM STACK-READ
/*  MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLZM0A
/*  WRITE MERLZM0A.MT-ID MERLZM0A.BASE-COL MERLZM0A.BASE-COL-LIMIT
  /*
  DECIDE FOR FIRST CONDITION
  WHEN MERLZM0A.BASE-COL EQ MERLZLSL.BASE-COL
     ESCAPE ROUTINE
  WHEN MERLZM0A.BASE-COL EQ 0 AND MERLZLSL.RLM-ID NE 0
/*     WRITE 'delete'
     MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLMM0A
     MOVE MERLZM0A.BASE-COL TO MERLMM0A.BASE-COL
     MOVE MERLZM0A.RL-ID TO MERLMM0A.RL-ID
     MOVE "DELETE" TO MERLMM0A.ME-COMMAND
     PERFORM MERLMM0S XXERX00A XXCTXX0A MERLMM0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     RESET MERLZLSL.RLM-ID MERLZLSL.BASE-COL
  WHEN MERLZM0A.BASE-COL NE 0 AND MERLZLSL.RLM-ID EQ 0
/*     WRITE 'add'
     MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLMM0A
     MOVE MERLZM0A.BASE-COL TO MERLMM0A.BASE-COL
     MOVE MERLZM0A.RL-ID TO MERLMM0A.RL-ID
     MOVE "ADD" TO MERLMM0A.ME-COMMAND
     PERFORM MERLMM0S XXERX00A XXCTXX0A MERLMM0A UXCSXX0A
     IF RETURN-CODE LT 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     IF RETURN-CODE EQ 0 THEN
        MOVE BY NAME MERLMM0A TO MERLZLSL.STACK-REC-G
     ELSE
        MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLZM0A
     END-IF
  WHEN MERLZM0A.BASE-COL NE 0 AND MERLZLSL.RLM-ID NE 0
/*     WRITE 'update'
     MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLMM0A
     MOVE MERLZM0A.BASE-COL TO MERLMM0A.BASE-COL
     MOVE MERLZM0A.RL-ID TO MERLMM0A.RL-ID
     MOVE "UPDATE" TO MERLMM0A.ME-COMMAND
     PERFORM MERLMM0S XXERX00A XXCTXX0A MERLMM0A UXCSXX0A
     IF RETURN-CODE LT 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     IF RETURN-CODE EQ 0 THEN
        MOVE BY NAME MERLMM0A TO MERLZLSL.STACK-REC-G
     ELSE
        MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLZM0A
     END-IF
  WHEN NONE
     IGNORE
  END-DECIDE
  IF RETURN-CODE EQ 0 THEN
     /*
     PERFORM STACK-WRITE
     MOVE BY NAME MERLZLSL.STACK-REC-G TO MERLZM0A
     PERFORM RECORD-EXTEND
  END-IF
END-SUBROUTINE
/* ”Ô‡‚ÎÂÌËÂ ÓÒÌÓ‚Ì˚Ï ÒÚÂÍÓÏ
INCLUDE XXSTMN4C "MERLZLSA" "MERLZLSL-CONST" "MERLZLSL"
        "STACK-INIT" "STACK-FREE" "STACK-REALLOC"
        "STACK-PUSH" "STACK-READ" "STACK-WRITE" "STACK-LOCATE"
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
