**C               *>Natural Source Header 000000
**C               *:NatName MEROSLSA
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070925
**C               *:Time 1148000
**C               *<Natural Source Header
**DS          0000      1MEROSLSA
**DK          0000B   4 2STACK-NUMBER
**DK          0000I   4 2STACK-COUNT
**DK          0000I   4 2STACK-LEN
**DK          0000I   4 2STACK-ID
