**C               *>Natural Source Header 000000
**C               *:NatName MERXPLSA
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060930
**C               *:Time 1244000
**C               *<Natural Source Header
**DS          0000      1MERXPLSA
**DK          0000B   4 2STACK-NUMBER
**DK          0000I   4 2STACK-COUNT
**DK          0000I   4 2STACK-LEN
**DK          0000I   4 2STACK-ID
