* >Natural Source Header 000000 /*<RO>>
* :NatName MMXXMN4C
* :UID OLEG
* :Mode S
* :CP
* :Date 20050113
* :Time 2228000
* <Natural Source Header /*<<RO>
/* ярюмдюпрмши бшунд
BM-COMMAND := MX-COMMAND
BM-OBJECT  := MX-OBJECT

