* >Natural Source Header 000000 /*<RO>>
* :NatName MOPPML0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070617
* :Time 1721000
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING UXCSXX0A
PARAMETER USING XMXPXX0A
END-DEFINE
DEFINE SUBROUTINE MOPPML0S
  IGNORE
END-SUBROUTINE
END
