* >Natural Source Header 000000 /*<RO>>
* :NatName MPOSRK0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX0A
PARAMETER USING MPOSRK0A
PARAMETER USING MPXXTB0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“‹ › –¿Õ¿
LOCAL USING MPOSRK0L
LOCAL USING XPMXSM0L
LOCAL USING MBMTMN0A
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»— 
LOCAL USING XPVOSH0A
LOCAL USING XPMOSH0A
LOCAL USING XPMTSH0A
LOCAL USING XPGMSH0A
/*
LOCAL USING MBSFMN0A
LOCAL USING MBTTMN0A
LOCAL USING MBPPMN0A
LOCAL USING UXCSXX0A
LOCAL USING MBLKHM0A
LOCAL
1 #DATE (D)
1 #DATE_A (A8)
1 REDEFINE #DATE_A
  2 #BLANK (A4)
  2 #MMDD  (A4)
1 #COUNT   (I2)
1 #RETURN-CODE (I4)
END-DEFINE
DEFINE SUBROUTINE MPOSRK0S
MOVE XXERX00A.RETURN-CODE TO #RETURN-CODE
RESET XXERX00A
/*
MX-EDITOR-NAME := '”ÒÎÓ‚Ë  ÓÚ·Ó‡ ‰ÓÍÛÏÂÌÚÓ‚'
/*
INCLUDE XPMFMN0C '"""MPOSRK0M"""'
/* STANDART COMMANDS
INCLUDE XPRKMP0C
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  DECIDE ON FIRST VALUE MX-COMMAND
     VALUE 'VIEW'
        PERFORM SCREEN-LOAD
        RETURN-CODE := #RETURN-CODE   /* «¿œ»—‹ Õ≈ Õ¿…ƒ≈Õ¿
     VALUE 'EDIT'
        PERFORM SCREEN-LOAD
     VALUE 'NEW'
        PERFORM SCREEN-INIT
     NONE VALUE
        MOVE XPMXXX0A.MX-COMMAND TO ERROR-ADDITION(1)
        *ERROR-NR := EC-UNKNOW-COMMAND
  END-DECIDE
  RESET MX-COMMAND
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-INIT
  /*CP-CURS-FIELD := POS(MPSARK0L.SA-DT-N)
  MOVE *DATX TO #DATE
  ADD 1 TO #DATE
  MOVE EDITED #DATE (EM=YYYYMMDD) TO MPOSRK0L.PO-DATE-AP
  MOVE EDITED #DATE (EM=YYYYMMDD) TO #DATE_A
  MOVE '0101' TO #MMDD
  MOVE #DATE_A TO MPOSRK0L.PO-DATE-AS
END-SUBROUTINE
/***********************************************************************
DEFINE SUBROUTINE SCREEN-CHECK /* œ–Œ¬≈– ¿ › –¿Õ¿
  /* œ–Œ¬≈– ¿ Õ¿À»◊»ﬂ «¿œŒÀÕ≈Õ»ﬂ  –»“≈–»≈¬ œŒ»— ¿
/*  IF MPOSRK0L.PO-DATE-NS = 0 AND MPOSRK0L.PO-DATE-NP = 0 AND
/*     MPOSRK0L.SF-DATE-N = 0 AND MPOSRK0L.TT-DATE-N = 0 AND
/*     MPOSRK0L.PP-DATE-N = 0 AND MPOSRK0L.PO-TYPE-DOC = 0 AND
/*     MPOSRK0L.PO-NUMBER = 0 AND MPOSRK0L.VO-SEARCH = ' ' AND
/*     MPOSRK0L.VO-INN = ' ' AND MPOSRK0L.MO-CODE = 0 AND
/*     MPOSRK0L.MT-CODE = ' ' AND MPOSRK0L.GM-CODE = 0 AND
/*     MPOSRK0L.SF-NUMBER = ' ' AND MPOSRK0L.TT-NUMBER = ' ' AND
/*     MPOSRK0L.PP-NUMBER = 0
/*        XXERX00A.RETURN-CODE := 2509  /*
/*        CP-CURS-FIELD := POS(MPOSRK0L.PO-TYPE-DOC)
/*        ESCAPE ROUTINE
/*  END-IF
  INCLUDE XPDTCH0C 'MPOSRK0L.PO-DATE-NS' 'TRUE'
  INCLUDE XPDTCH0C 'MPOSRK0L.PO-DATE-NP' 'FALSE'
  IF MPOSRK0L.PO-DATE-NP < MPOSRK0L.PO-DATE-NS THEN
     MPOSRK0L.PO-DATE-NP := MPOSRK0L.PO-DATE-NS
  END-IF
  /*
  MOVE MPOSRK0L.VO-CODE TO CP-CHECK-SEARCH
  IF MPOSRK0L.VO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPVOSH0A.SH-COMMAND
     PERFORM SEARCH-VO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  /* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  MOVE MPOSRK0L.MO-CODE TO CP-CHECK-SEARCH
  IF MPOSRK0L.MO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  /*
  MOVE MPOSRK0L.MT-CODE TO CP-CHECK-SEARCH
  IF MPOSRK0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  /*
  MOVE MPOSRK0L.GM-CODE TO CP-CHECK-SEARCH
  IF MPOSRK0L.GM-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPGMSH0A.SH-COMMAND
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  /*
  INCLUDE XPDTCH0C 'MPOSRK0L.SF-DATE-N' 'FALSE'
  INCLUDE XPDTCH0C 'MPOSRK0L.TT-DATE-N' 'FALSE'
  INCLUDE XPDTCH0C 'MPOSRK0L.PP-DATE-N' 'FALSE'
  /*
  IF MPOSRK0L.LK-SEARCH NE " " THEN
     INCLUDE XPDTCH0C 'MPOSRK0L.LK-SEARCH-DATE-N' "FALSE"
  ELSE
     RESET MPOSRK0L.LK-SEARCH-DATE-N
  END-IF
  MOVE MPOSRK0L.LK-NUMBER TO CP-CHECK-SEARCH
  MOVE MPOSRK0L.LK-DATE-N TO CP-CHECK-SEARCH-D
  /*
  IF MPOSRK0L.LK-SEARCH NE CP-CHECK-SEARCH OR
        MPOSRK0L.LK-DATE-N NE CP-CHECK-SEARCH-D THEN
     MOVE "LOC2" TO MBLKHM0A.BL-COMMAND
     PERFORM SEARCH-LK
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPOSRK0L.LK-SEARCH) ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT  /* ¬€¡Œ– Œ¡⁄≈ “¿
  /* ¬Õ≈ÿÕﬂﬂ Œ–√¿Õ»«¿÷»ﬂ
  IF CP-CURS-FIELD EQ POS(MPOSRK0L.VO-SEARCH) THEN
     MOVE "SELECT" TO XPVOSH0A.SH-COMMAND
     PERFORM SEARCH-VO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD EQ POS(MPOSRK0L.MO-SEARCH) THEN
     MOVE "SELECT" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPOSRK0L.MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPOSRK0L.GM-SEARCH)THEN
     XPGMSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
/* —◊≈“ ‘¿ “”–¿
  IF CP-CURS-FIELD EQ POS(MPOSRK0L.SF-NUMBER) THEN
     MBSFMN0A.BL-COMMAND := 'LOCATE'
     MOVE BY NAME MPOSRK0L TO MBSFMN0A
     IF MPOSRK0L.SF-DATE-N NE 0 THEN
        MOVE EDITED MPOSRK0L.SF-DATE-A TO MBSFMN0A.SF-DATE (EM=YYYYMMDD)
     END-IF
     PERFORM MBSFMN0S XXERX00A XXCTXX0A MBSFMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     IF MBSFMN0A.SF-ID NE 0 THEN
        MOVE MBSFMN0A.SF-ID TO MPOSRK0L.SF-ID
     END-IF
  END-IF
/* ““Õ
  IF CP-CURS-FIELD EQ POS(MPOSRK0L.TT-NUMBER) THEN
     MBTTMN0A.BL-COMMAND := 'LOCATE'
     MOVE BY NAME MPOSRK0L TO MBTTMN0A
     IF MPOSRK0L.TT-DATE-N NE 0
        MOVE EDITED MPOSRK0L.TT-DATE-A TO MBTTMN0A.TT-DATE (EM=YYYYMMDD)
     END-IF
     PERFORM MBTTMN0S XXERX00A XXCTXX0A MBTTMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     IF MBTTMN0A.TT-ID NE 0 THEN
        MOVE MBTTMN0A.TT-ID TO MPOSRK0L.TT-ID
     END-IF
  END-IF
/* œÀ¿“ œŒ–”◊≈Õ»≈
  IF CP-CURS-FIELD EQ POS(MPOSRK0L.PP-NUMBER) THEN
     MBPPMN0A.BL-COMMAND := 'LOCATE'
     MOVE BY NAME MPOSRK0L TO MBPPMN0A
     IF MPOSRK0L.PP-DATE-N NE 0
        MOVE EDITED MPOSRK0L.PP-DATE-A TO MBPPMN0A.PP-DATE (EM=YYYYMMDD)
     END-IF
     PERFORM MBPPMN0S XXERX00A XXCTXX0A MBPPMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     IF MBPPMN0A.PP-ID NE 0 THEN
        MOVE MBPPMN0A.PP-ID TO MPOSRK0L.PP-ID
     END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-TO-OBJECT
  PERFORM RECORD-LOAD
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN
  PERFORM SCREEN-LOAD
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-LOAD /* «¿√–”« ¿ › –¿Õ¿
  MOVE BY NAME MPOSRK0A TO MPOSRK0L
  IF MPOSRK0A.VO-CODE NE 0 THEN
     MOVE MPOSRK0A.VO-CODE TO MPOSRK0L.VO-SEARCH
  END-IF
  IF MPOSRK0A.MO-CODE NE 0 THEN
     MOVE MPOSRK0A.MO-CODE TO MPOSRK0L.MO-SEARCH
  END-IF
  IF MPOSRK0A.MT-CODE NE " " THEN
     MOVE MPOSRK0A.MT-CODE TO MPOSRK0L.MT-SEARCH
  END-IF
  IF MPOSRK0A.GM-CODE NE 0 THEN
     MOVE MPOSRK0A.GM-CODE TO MPOSRK0L.GM-SEARCH
  END-IF
  IF MPOSRK0A.LK-NUMBER NE ' ' THEN
     MOVE MPOSRK0A.LK-NUMBER TO MPOSRK0L.LK-SEARCH
  END-IF
  MOVE EDITED MPOSRK0A.PO-DATE-S (EM=YYYYMMDD) TO MPOSRK0L.PO-DATE-AS
  MOVE EDITED MPOSRK0A.PO-DATE-P (EM=YYYYMMDD) TO MPOSRK0L.PO-DATE-AP
  MOVE EDITED MPOSRK0A.SF-DATE (EM=YYYYMMDD) TO MPOSRK0L.SF-DATE-A
  MOVE EDITED MPOSRK0A.TT-DATE (EM=YYYYMMDD) TO MPOSRK0L.TT-DATE-A
  MOVE EDITED MPOSRK0A.PP-DATE (EM=YYYYMMDD) TO MPOSRK0L.PP-DATE-A
  MOVE EDITED MPOSRK0A.LK-DATE (EM=YYYYMMDD) TO MPOSRK0L.LK-DATE-A
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOAD  /* –¿«√–”« ¿ › –¿Õ¿
  MOVE BY NAME MPOSRK0L TO MPOSRK0A
  IF MPOSRK0L.PO-DATE-NS NE 0 THEN
     MOVE EDITED MPOSRK0L.PO-DATE-AS TO MPOSRK0A.PO-DATE-S (EM=YYYYMMDD)
  END-IF
  IF MPOSRK0L.PO-DATE-NP NE 0 THEN
     MOVE EDITED MPOSRK0L.PO-DATE-AP TO MPOSRK0A.PO-DATE-P (EM=YYYYMMDD)
  END-IF
  IF MPOSRK0L.SF-DATE-N NE 0 THEN
     MOVE EDITED MPOSRK0L.SF-DATE-A TO MPOSRK0A.SF-DATE (EM=YYYYMMDD)
  END-IF
  IF MPOSRK0L.TT-DATE-N NE 0 THEN
     MOVE EDITED MPOSRK0L.TT-DATE-A TO MPOSRK0A.TT-DATE (EM=YYYYMMDD)
  END-IF
  IF MPOSRK0L.PP-DATE-N NE 0 THEN
     MOVE EDITED MPOSRK0L.PP-DATE-A TO MPOSRK0A.PP-DATE (EM=YYYYMMDD)
  END-IF
  IF MPOSRK0L.LK-DATE-N NE 0 THEN
     MOVE EDITED MPOSRK0L.LK-DATE-A TO MPOSRK0A.LK-DATE (EM=YYYYMMDD)
  END-IF
  /******************************************
  /* «¿œŒÀÕ≈Õ»≈ —“–” “”–€ ƒÀﬂ œŒ»— ¿
  /******************************************
  /*
/* 11000  “»œ ƒŒ ”Ã≈Õ“¿
/* 11001  ÕŒÃ≈– ƒŒ ”Ã≈Õ“¿
/* 11002  ƒ¿“¿ ƒŒ ”Ã≈Õ“¿
/* 11003  œŒ—“¿¬Ÿ» 
/* 11004  Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
/* 11005  √–”œœ¿ Ã¿“≈–»¿À¿
/* 11006  Ã¿“≈–»¿À¿À
/* 11007  ““Õ“Õ
/* 11008  —◊≈“ ‘¿ “”–¿
/* 11009  œÀ¿“≈∆ÕŒ≈ œŒ–”◊≈Õ»≈
/* 11010  À« 
/* 11011  œ‡˜Í‡ ‰ÓÍÛÏÂÌÚÓ‚
/*
  RESET #COUNT
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11000
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.PO-TYPE-DOC
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11001
  IF MPOSRK0A.PO-NUMBER NE ' ' THEN
     MOVE MPOSRK0A.PO-NUMBER TO MPXXTB0A.TB-VALUE-A(#COUNT)
  ELSE
     RESET MPXXTB0A.TB-VALUE-A(#COUNT)
  END-IF
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11002
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0L.PO-DATE-NS
  MPXXTB0A.TB-VALUE-P(#COUNT,2) := MPOSRK0L.PO-DATE-NP
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11003
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.VO-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11004
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.MO-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11005
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.GM-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11006
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.MT-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11007
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.TT-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11008
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.SF-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11009
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.PP-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11010
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.LK-ID
  /*
  ADD 1 TO #COUNT
  MPXXTB0A.TB-CODE(#COUNT) := 11011
  MPXXTB0A.TB-VALUE-P(#COUNT,1) := MPOSRK0A.DC-PACKAGE
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-VO
  IF XPVOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPOSRK0L.VO-SEARCH EQ " " THEN
     RESET MPOSRK0L.VO-ID MPOSRK0L.VO-CODE
           MPOSRK0L.VO-INN MPOSRK0L.VO-KPP
           MPOSRK0L.VO-NAME MPOSRK0L.VO-ADDR
     ESCAPE ROUTINE
  END-IF
  RESET XPVOSH0A.VO-ID
  MOVE MPOSRK0L.VO-SEARCH TO XPVOSH0A.VO-SEARCH
  PERFORM XPVOSH0S XXERX00A XXCTXX0A XPVOSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF RETURN-CODE EQ 0 AND XPVOSH0A.VO-ID NE 0 THEN
     MOVE BY NAME XPVOSH0A TO MPOSRK0L
     MOVE XPVOSH0A.VO-CODE TO MPOSRK0L.VO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MO
  IF XPMOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPOSRK0L.MO-SEARCH EQ " " THEN
     RESET MPOSRK0L.MO-ID MPOSRK0L.MO-CODE
           MPOSRK0L.MO-NAME MPOSRK0L.MO-SEARCH
     ESCAPE ROUTINE
  END-IF
  IF XXCTXX0A.US-MO-ID NE 0 OR MX-COMMAND EQ "EDIT" THEN
     ESCAPE ROUTINE
  END-IF
  RESET XPMOSH0A.MO-ID
  MOVE MPOSRK0L.MO-SEARCH TO XPMOSH0A.MO-SEARCH
  PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
  IF RETURN-CODE EQ 0 AND XPMOSH0A.MO-ID NE 0 THEN
     MOVE XPMOSH0A.MO-ID TO MPOSRK0L.MO-ID
     MOVE XPMOSH0A.MO-CODE TO MPOSRK0L.MO-CODE
     MOVE XPMOSH0A.MO-NAME TO MPOSRK0L.MO-NAME
     MOVE XPMOSH0A.MO-CODE TO MPOSRK0L.MO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPOSRK0L.MT-SEARCH EQ " " THEN
     RESET MPOSRK0L.MT-ID MPOSRK0L.MT-CODE MPOSRK0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPOSRK0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE MBMTMN0A.MT-ID TO MPOSRK0L.MT-ID
     MOVE MBMTMN0A.MT-CODE TO MPOSRK0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPOSRK0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPOSRK0L.MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-GM
  IF XPGMSH0A.SH-COMMAND EQ "LOCATE" AND
     MPOSRK0L.GM-SEARCH EQ " " THEN
     RESET MPOSRK0L.GM-ID MPOSRK0L.GM-CODE MPOSRK0L.GM-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPGMSH0A.GM-ID
  MOVE MPOSRK0L.GM-SEARCH TO XPGMSH0A.GM-SEARCH
  PERFORM XPGMSH0S XXERX00A XXCTXX0A XPGMSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPGMSH0A.GM-ID NE 0 THEN
     MOVE XPGMSH0A.GM-ID TO MPOSRK0L.GM-ID
     MOVE XPGMSH0A.GM-CODE TO MPOSRK0L.GM-CODE
     MOVE XPGMSH0A.GM-NAME TO MPOSRK0L.GM-NAME
     MOVE XPGMSH0A.GM-CODE TO MPOSRK0L.GM-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-LK
  IF MBLKHM0A.BL-COMMAND EQ "LOC2" AND
     MPOSRK0L.LK-SEARCH EQ " " THEN
     RESET MPOSRK0L.LK-ID MPOSRK0L.LK-NUMBER MPOSRK0L.LK-DATE-N
     ESCAPE ROUTINE
  END-IF
  RESET MBLKHM0A.LK-ID
  MOVE MPOSRK0L.LK-SEARCH TO MBLKHM0A.LK-NUMBER
  MOVE EDITED MPOSRK0L.PO-DATE-AS TO MBLKHM0A.LK-DT-START (EM=YYYYMMDD)
  MOVE EDITED MPOSRK0L.PO-DATE-AP TO MBLKHM0A.LK-DT-STOP (EM=YYYYMMDD)
  PERFORM MBLKHM0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBLKHM0A.LK-ID NE 0 THEN
     MOVE MBLKHM0A.LK-ID     TO MPOSRK0L.LK-ID
     MOVE MBLKHM0A.LK-NUMBER TO MPOSRK0L.LK-NUMBER
     MOVE EDITED MBLKHM0A.LK-DATE (EM=YYYYMMDD) TO MPOSRK0L.LK-DATE-A
     MOVE MPOSRK0L.LK-DATE-N TO MPOSRK0L.LK-SEARCH-DATE-N
     MOVE MBLKHM0A.LK-NUMBER TO MPOSRK0L.LK-SEARCH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END


