**C               *>Natural Source Header 000000
**C               *:NatName MPOSSH0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060609
**C               *:Time 2335000
**C               *<Natural Source Header
**DS          0000      1MPOSSH0A
**DK          0000A  10 2OS-COMMAND
