* >Natural Source Header 000000 /*<RO>>
* :NatName MPPMMN0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070628
* :Time 1127000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿: –≈ƒ¿ “Œ–
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: –≈ƒ¿ “Œ– «¿œ»—» Œ “Ã÷ œ–»’ŒƒÕŒ√Œ Œ–ƒ≈–¿
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - EDIT
/*  - VIEW
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX1A
PARAMETER USING MEPHMN0A
PARAMETER USING MEPMMN0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“» › –¿ÕŒ¬
LOCAL USING XPMXSM0L
LOCAL USING MPPMMN0L
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»— 
LOCAL USING MBMTMN0A
LOCAL USING MBEIMN0A
LOCAL USING MBDMMN0A
LOCAL USING XPDMSH0A
LOCAL USING XPMTSH0A
LOCAL USING XPNDSH0A
LOCAL USING XPEISH0A
/*
LOCAL
1 #POS-DM  (I4)
END-DEFINE
DEFINE SUBROUTINE MPPMMN0S
RESET BM-COMMAND-PROCESS
/*
IF MX-COMMAND NE 'NEW' AND MX-COMMAND NE 'EDIT' AND
     MX-COMMAND NE 'VIEW' THEN
  MOVE MX-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-IF
/*
MX-EDITOR-NAME := 'œÓÁËˆË  ÔËıÓ‰ÌÓ„Ó Ó‰Â‡'
/*
PERFORM SCREEN-INIT
PERFORM SCREEN-PREPARE
PERFORM OBJECT-TO-SCREEN
PERFORM SCREEN-MAIN-LOOP
/*
MOVE CP-CMD-EXIT TO BM-COMMAND-PROCESS
/* ŒÒÌÓ‚ÌÓÈ ˆËÍÎ
INCLUDE XPMXXX2C
/* ÛÔ‡‚ÎÂÌËÂ ˝Í‡ÌÓÏ Ë Ó·‡·ÓÚÍ‡ ÍÓÏÏ‡Ì‰
INCLUDE XPMTMN1C "'''MPPMMN0M'''"
/* —Ú‡Ì‰‡ÚÌ‡  Ó·‡·ÓÚÍ‡ ÍÓÏ‡Ì‰
INCLUDE XPCPMN2C
/* —Ú‡Ì‰‡ÚÌ˚Â ÔÓˆÂ‰Û˚ ‡·ÓÚ˚ Ò Á‡ÔËÒ¸˛
INCLUDE XPXXMN1C "MIPMMN0S" "MEPMMN0A"
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  IF MX-COMMAND EQ "VIEW" THEN
     MOVE (AD=P) TO PM-C
     MOVE (AD=P) TO MT-C
     MOVE (AD=P) TO EI-C
     MOVE (AD=P) TO ND-C
     MOVE (AD=P) TO BASE-COL-C
     MOVE (AD=P) TO DM-C(*)
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN
  MOVE BY NAME MEPMMN0A TO MPPMMN0L
  MOVE EDITED MEPMMN0A.PR-MAKE-DATA(EM=YYYYMMDD) TO MPPMMN0L.PR-MAKE-DATA-A
  IF MEPMMN0A.MT-CODE NE " " THEN
     MOVE MEPMMN0A.MT-CODE TO MPPMMN0L.MT-SEARCH
  END-IF
  IF MEPMMN0A.EI-CODE NE 0 THEN
     MOVE MEPMMN0A.EI-CODE TO MPPMMN0L.EI-SEARCH
  END-IF
  IF MEPMMN0A.ND-CODE NE 0 THEN
     MOVE MEPMMN0A.ND-STAVKA TO MPPMMN0L.ND-SEARCH
  END-IF
  IF MEPMMN0A.BASE-COL-TYPE EQ 2 THEN
     RESET BASE-COL-C
  ELSE
     MOVE (AD=P) TO BASE-COL-C
  END-IF
  FOR #POS-DM = 1 TO 5
     IF MPPMMN0L.DM-CODE(#POS-DM) NE 0 THEN
        MOVE MPPMMN0L.DM-CODE(#POS-DM) TO MPPMMN0L.DM-SEARCH(#POS-DM)
     END-IF
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-TO-OBJECT
  MOVE BY NAME MPPMMN0L TO MEPMMN0A
  IF MPPMMN0L.PR-MAKE-DATA-N NE 0 THEN
     MOVE EDITED MPPMMN0L.PR-MAKE-DATA-A TO MEPMMN0A.PR-MAKE-DATA (EM=YYYYMMDD)
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-CHECK
  MOVE MPPMMN0L.MT-CODE TO CP-CHECK-SEARCH
  IF MPPMMN0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  INCLUDE XPOBCH0C "MPPMMN0L.MT-ID" "MPPMMN0L.MT-SEARCH"
  INCLUDE XPDTCH0C "MPPMMN0L.PR-MAKE-DATA-N" "FALSE"
  INCLUDE XPOBCH0C "MPPMMN0L.DR-COL" "MPPMMN0L.DR-COL"
  MOVE MPPMMN0L.EI-CODE TO CP-CHECK-SEARCH
  IF MPPMMN0L.EI-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPEISH0A.SH-COMMAND
     PERFORM SEARCH-EI
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  INCLUDE XPOBCH0C "MPPMMN0L.EI-ID" "MPPMMN0L.EI-SEARCH"
  PERFORM CHECK-MTEI
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MPPMMN0L.BASE-COL-TYPE EQ 2 THEN
     RESET MPPMMN0L.BASE-COL-C
     INCLUDE XPOBCH0C "MPPMMN0L.BASE-COL" "MPPMMN0L.BASE-COL"
  ELSE
     MOVE (AD=P) TO MPPMMN0L.BASE-COL-C
  END-IF
  /*
  IF IS-NOT-PRICE THEN
     RESET MPPMMN0L.ND-SEARCH MPPMMN0L.DR-CENA
           MPPMMN0L.DR-CENA-SUMMA MPPMMN0L.DR-NDS
           MPPMMN0L.DR-NDS-SUMMA MPPMMN0L.DR-ALL-SUMMA
     MOVE "LOCATE" TO XPNDSH0A.SH-COMMAND
     PERFORM SEARCH-ND
  ELSE
  RESET MPPMMN0L.DR-CENA MPPMMN0L.DR-NDS
  IF MPPMMN0L.DR-CENA EQ 0 AND MPPMMN0L.DR-CENA-SUMMA NE 0 THEN
     COMPUTE ROUNDED MPPMMN0L.DR-CENA =
           MPPMMN0L.DR-CENA-SUMMA / MPPMMN0L.DR-COL
  END-IF
  IF MPPMMN0L.DR-CENA NE 0 AND MPPMMN0L.DR-CENA-SUMMA EQ 0 THEN
     COMPUTE ROUNDED MPPMMN0L.DR-CENA-SUMMA =
           MPPMMN0L.DR-CENA * MPPMMN0L.DR-COL
  END-IF
  INCLUDE XPOBCH0C "MPPMMN0L.DR-CENA-SUMMA" "MPPMMN0L.DR-CENA-SUMMA"
  MOVE MPPMMN0L.ND-STAVKA TO CP-CHECK-SEARCH
  IF MPPMMN0L.ND-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPNDSH0A.SH-COMMAND
     PERFORM SEARCH-ND
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  INCLUDE XPOBCH0C "MPPMMN0L.ND-ID" "MPPMMN0L.ND-SEARCH"
  IF MPPMMN0L.ND-VALUE EQ 0
     MPPMMN0L.DR-NDS := 0
     MPPMMN0L.DR-NDS-SUMMA := 0
  ELSE
     IF MPPMMN0L.DR-NDS EQ 0 AND MPPMMN0L.DR-NDS-SUMMA EQ 0 THEN
        COMPUTE ROUNDED MPPMMN0L.DR-NDS-SUMMA =
              MPPMMN0L.DR-CENA-SUMMA * MPPMMN0L.ND-VALUE / 100
     END-IF
     IF MPPMMN0L.DR-NDS EQ 0 AND MPPMMN0L.DR-NDS-SUMMA NE 0 THEN
        COMPUTE ROUNDED MPPMMN0L.DR-NDS =
              MPPMMN0L.DR-NDS-SUMMA / MPPMMN0L.DR-COL
     END-IF
     IF MPPMMN0L.DR-NDS NE 0 AND MPPMMN0L.DR-NDS-SUMMA EQ 0 THEN
        COMPUTE ROUNDED MPPMMN0L.DR-NDS-SUMMA =
              MPPMMN0L.DR-NDS * MPPMMN0L.DR-COL
     END-IF
     INCLUDE XPOBCH0C "MPPMMN0L.DR-NDS-SUMMA" "MPPMMN0L.DR-NDS-SUMMA"
  END-IF
  MPPMMN0L.DR-ALL-SUMMA := MPPMMN0L.DR-NDS-SUMMA + MPPMMN0L.DR-CENA-SUMMA
  END-IF
  FOR #POS-DM = 1 TO 5
     IF MPPMMN0L.DM-CODE(#POS-DM) NE MPPMMN0L.DM-SEARCH(#POS-DM) THEN
        MOVE "LOCATE" TO XPDMSH0A.SH-COMMAND
        PERFORM SEARCH-DM
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     END-IF
     IF MPPMMN0L.DM-ID(#POS-DM) NE 0 THEN
        INCLUDE XPOBCH0C "MPPMMN0L.DM-COL(#POS-DM)" "MPPMMN0L.DM-COL(#POS-DM)"
     END-IF
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE CHECK-MTEI
  PERFORM SCREEN-TO-OBJECT
  MOVE "CHECK-MTEI" TO MEPMMN0A.ME-COMMAND
  PERFORM MIPMMN0S XXERX00A XXCTXX0A MEPMMN0A UXCSXX0A
  MOVE MEPMMN0A.EI-ID TO MPPMMN0L.EI-ID
  MOVE MEPMMN0A.EI-CODE TO MPPMMN0L.EI-CODE
  MOVE MEPMMN0A.EI-SHORT-NAME TO MPPMMN0L.EI-SHORT-NAME
  MOVE MEPMMN0A.BASE-EI-ID TO MPPMMN0L.BASE-EI-ID
  MOVE MEPMMN0A.BASE-EI-CODE TO MPPMMN0L.BASE-EI-CODE
  MOVE MEPMMN0A.BASE-EI-SHORT-NAME TO MPPMMN0L.BASE-EI-SHORT-NAME
  MOVE MEPMMN0A.DR-COL TO MPPMMN0L.DR-COL
  MOVE MEPMMN0A.BASE-COL TO MPPMMN0L.BASE-COL
  MOVE MEPMMN0A.BASE-COL-TYPE TO MPPMMN0L.BASE-COL-TYPE
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT
  IF CP-CURS-FIELD = POS(MPPMMN0L.MT-SEARCH)THEN
     MOVE "SELECT" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPPMMN0L.EI-SEARCH) THEN
     MOVE "SELECT" TO XPEISH0A.SH-COMMAND
     PERFORM SEARCH-EI
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPPMMN0L.ND-SEARCH) THEN
     MOVE "SELECT" TO XPNDSH0A.SH-COMMAND
     PERFORM SEARCH-ND
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  FOR #POS-DM = 1 TO 5
     IF CP-CURS-FIELD EQ POS(MPPMMN0L.DM-SEARCH(#POS-DM)) OR
                      EQ POS(MPPMMN0L.DM-COL(#POS-DM)) THEN
        MOVE "SELECT" TO XPDMSH0A.SH-COMMAND
        PERFORM SEARCH-DM
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     END-IF
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPPMMN0L.MT-SEARCH EQ " " THEN
     RESET MPPMMN0L.MT-ID MPPMMN0L.MT-CODE MPPMMN0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPPMMN0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE BY NAME MBMTMN0A TO MPPMMN0L
     MOVE MBMTMN0A.MT-CODE TO MPPMMN0L.MT-SEARCH
     MOVE MBMTMN0A.EI-ID TO MBEIMN0A.EI-ID
     MOVE "READ" TO MBEIMN0A.BL-COMMAND
     PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
     IF RETURN-CODE EQ 0 THEN
        MOVE MBEIMN0A.EI-CODE TO MPPMMN0L.EI-SEARCH
        MOVE MBEIMN0A.EI-ID TO MPPMMN0L.BASE-EI-ID
        MOVE MBEIMN0A.EI-CODE TO MPPMMN0L.BASE-EI-CODE
        MOVE MBEIMN0A.EI-SHORT-NAME TO MPPMMN0L.BASE-EI-SHORT-NAME
     END-IF
     MOVE BY NAME MBMTMN0A.DM-G(*) TO MPPMMN0L.DM-LIST(*)
     FOR #POS-DM = 1 TO 5
        IF MPPMMN0L.DM-ID(#POS-DM) NE 0 THEN
/*         WRITE MPPMMN0L.DM-ID(#POS-DM)
           MOVE MPPMMN0L.DM-ID(#POS-DM) TO MBDMMN0A.DM-ID
           MOVE "READ" TO MBDMMN0A.BL-COMMAND
           PERFORM MBDMMN0S XXERX00A XXCTXX0A MBDMMN0A
           IF RETURN-CODE EQ 0 THEN
              MOVE MBDMMN0A.DM-CODE TO MPPMMN0L.DM-SEARCH(#POS-DM)
              MOVE BY NAME MBDMMN0A TO MPPMMN0L.DM-LIST(#POS-DM)
           ELSE
              PERFORM XPERVW0S XXERX00A
           END-IF
           MOVE MBDMMN0A.EI-ID TO MPPMMN0L.DM-EI-ID(#POS-DM)
           IF MPPMMN0L.DM-EI-ID(#POS-DM) NE 0 THEN
              MOVE MPPMMN0L.DM-EI-ID(#POS-DM) TO MBEIMN0A.EI-ID
              MOVE "READ" TO MBEIMN0A.BL-COMMAND
              PERFORM MBEIMN0S XXERX00A XXCTXX0A MBEIMN0A
              IF RETURN-CODE EQ 0 THEN
                 MOVE MBEIMN0A.EI-SHORT-NAME TO MPPMMN0L.DM-EI-SHORT-NAME(#POS-DM)
              ELSE
                 PERFORM XPERVW0S XXERX00A
              END-IF
           END-IF
        END-IF
     END-FOR
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-EI
  IF XPEISH0A.SH-COMMAND EQ "LOCATE" AND
     MPPMMN0L.EI-SEARCH EQ " " THEN
     RESET MPPMMN0L.EI-ID MPPMMN0L.EI-CODE MPPMMN0L.EI-SHORT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPEISH0A.EI-ID
  MOVE MPPMMN0L.EI-SEARCH TO XPEISH0A.EI-SEARCH
  PERFORM XPEISH0S XXERX00A XXCTXX0A XPEISH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPEISH0A.EI-ID NE 0 THEN
     MOVE BY NAME XPEISH0A TO MPPMMN0L
     MOVE XPEISH0A.EI-CODE TO MPPMMN0L.EI-SEARCH
     RESET MPPMMN0L.BASE-COL
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-ND
  IF XPNDSH0A.SH-COMMAND EQ "LOCATE" AND
     MPPMMN0L.ND-SEARCH EQ " " THEN
     RESET MPPMMN0L.ND-ID MPPMMN0L.ND-CODE MPPMMN0L.ND-STAVKA
     ESCAPE ROUTINE
  END-IF
  RESET XPNDSH0A.ND-ID
  MOVE MPPMMN0L.ND-SEARCH TO XPNDSH0A.ND-SEARCH
  PERFORM XPNDSH0S XXERX00A XXCTXX0A XPNDSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPNDSH0A.ND-ID NE 0 THEN
     MOVE BY NAME XPNDSH0A TO MPPMMN0L
     MOVE XPNDSH0A.ND-STAVKA TO MPPMMN0L.ND-SEARCH
     RESET MPPMMN0L.DR-NDS MPPMMN0L.DR-NDS-SUMMA
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-DM
  IF XPDMSH0A.SH-COMMAND EQ "LOCATE" AND
     MPPMMN0L.DM-SEARCH(#POS-DM) EQ 0 THEN
     RESET MPPMMN0L.DM-LIST(#POS-DM)
     ESCAPE ROUTINE
  END-IF
  RESET XPDMSH0A.DM-ID
  MOVE MPPMMN0L.DM-SEARCH(#POS-DM) TO XPDMSH0A.DM-SEARCH
  PERFORM XPDMSH0S XXERX00A XXCTXX0A XPDMSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPDMSH0A.DM-ID NE 0 THEN
     MOVE BY NAME XPDMSH0A.DM-RESULT TO MPPMMN0L.DM-LIST(#POS-DM)
     MOVE XPDMSH0A.DM-CODE TO MPPMMN0L.DM-SEARCH(#POS-DM)
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
