**C               *>Natural Source Header 000000
**C               *:NatName MPPOXU0L
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070130
**C               *:Time 1334000
**C               *<Natural Source Header
**DS          0000      1MPPOXU0L
**DK          0000A  20 2PO-NUMBER
**DK          0000D     2PO-DATE
