* >Natural Source Header 000000 /*<RO>>
* :NatName MPPOMP2M
* :UID PAUL
* :Mode S
* :CP
* :Date 20061129
* :Time 0856000
* <Natural Source Header /*<<RO>
* MAP2: PROTOTYPE              --- CREATED BY WNT 6.1.1 ---
* WRITE USING MAP 'XXXXXXXX'
FORMAT PS=060 LS=080 ZP=OFF SG=OFF KD=OFF IP=OFF
* MAP2: MAP PROFILES *****************************        200***********
* .TTAAAMMOO   D I D I N D I D I        ?_)^&:+(                       *
* 060079        N0NNUCN            X         01 SYSDBA  NR             *
************************************************************************
WRITE ( AD=D                                                          /*
                                                                       )
 015T 'Заключение ЛВК по результатам проверки'
/
/
 001T 'Качественные _____________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
/
 001T 'Брак _____________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
/
 001T 'Причина __________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
 001T '__________________________________________________________'-
      '____________________'
/
/
 001T '"____"________________200__ г.'
/
 035T 'Контролер ЛВК _____________________________'
/
/
/
 035T 'Начальник ЛВК _____________________________'
* MAP2: VALIDATION *****************************************************
* MAP2: END OF MAP *****************************************************
END
