* >Natural Source Header 000000 /*<RO>>
* :NatName MPROSL0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070925
* :Time 2322000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿: –≈ƒ¿ “Œ–
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: –≈ƒ¿ “Œ– ‡ÒıÓ‰Ì˚È Ó‰Â —œ»—Œ  “Ã÷
/*  ŒÃ¿Õƒ€:
/*  - EDIT
/*  - NEW
/*  - VIEW
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX1A
PARAMETER USING MERHMN0A
PARAMETER USING UXCSXX0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/*
LOCAL USING XPCPXX0L
/* Œ¡À¿—“» › –¿ÕŒ¬
LOCAL USING XPMXSM0L
LOCAL USING MPROSL0L
/*
LOCAL USING MELKHM0A
LOCAL USING MERXPLSA
LOCAL USING MEROSL0A
LOCAL USING MEROSM0A
LOCAL USING MERXMM0A
LOCAL USING XMBMXX1A
/*
LOCAL
1 SCREEN-STACK
2 IS-TOP         (L)
2 IS-BOT         (L)
2 SCREEN-TOP     (I4)
2 SCREEN-POS     (I4)
2 SCREEN-BOT     (I4)
1 #BUFFER        (A70)
1 #TYPE-COL      (A1)
END-DEFINE
DEFINE SUBROUTINE MPROSL0S
RESET BM-COMMAND-PROCESS
/*
IF MX-COMMAND NE "VIEW" AND MX-COMMAND NE 'EDIT' AND MX-COMMAND NE "NEW" THEN
   MOVE MX-COMMAND TO ERROR-ADDITION(1)
   *ERROR-NR := EC-UNKNOW-COMMAND
END-IF
/*
MOVE "B" TO #TYPE-COL
MOVE MERHMN0A.RO-ID TO MEROSL0A.RO-ID
MOVE MERHMN0A.MT-ID TO MEROSL0A.MT-ID
MOVE MERHMN0A.ZK-ID TO MEROSL0A.ZK-ID
MOVE MERHMN0A.IN-MO-ID TO MEROSL0A.IN-MO-ID
MOVE MERHMN0A.OUT-MO-ID TO MEROSL0A.OUT-MO-ID
/*IF *USER EQ "PAUL" THEN WRITE *PROGRAM MERosL0A.ZK-ID END-IF
/*
MX-EDITOR-NAME := '—ÔËÒÓÍ ÓÒÚ‡ÚÍÓ‚ ‰Î  ÓÚÔÛÒÍ‡'
/*
PERFORM SCREEN-INIT
PERFORM SCREEN-PREPARE
PERFORM LIST-LOAD
IF RETURN-CODE EQ 0 THEN
  PERFORM LIST-TOP
END-IF
PERFORM SCREEN-MAIN-LOOP
/*
PERFORM LIST-FREE
MOVE CP-CMD-EXIT TO BM-COMMAND-PROCESS
/* ŒÒÌÓ‚ÌÓÈ ˆËÍÎ
INCLUDE XPMXXX2C
/* ”Ô‡‚ÎÂÌËÂ ˝Í‡ÌÓÏ Ë Ó·‡·ÓÚÍ‡ ÍÓÏÏ‡Ì‰
INCLUDE XPMFLS1C "'''MPROSL0M'''" "MPROSL0L.DL-CMD"
                 "MPROSL0L-LINES-MAX"
/* —Ú‡Ì‰‡ÚÌ‡  Ó·‡·ÓÚÍ‡ ÍÓÏ‡Ì‰
DEFINE SUBROUTINE COMMAND-PROCESS
  DECIDE ON FIRST VALUE CP-COMMAND
     VALUE "LINE-EDIT"
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LINE-EDIT
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-FREE
        PERFORM LIST-LOAD
        PERFORM LIST-RELOAD
     VALUE 'LIST-TOP'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-TOP
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     VALUE 'LIST-BOT'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-BOTTOM
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     VALUE 'LIST-NEXT'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-NEXT
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     VALUE 'LIST-PREV'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-PREV
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     VALUE 'SELECT'
        PERFORM OBJECT-SELECT
     VALUE 'CHECK'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-RELOAD
     VALUE 'NEW'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM SCREEN-TO-OBJECT
        PERFORM OBJECT-ADD
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
        PERFORM LIST-RELOAD
     VALUE 'SAVE'
        PERFORM SCREEN-CHECK
        IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     VALUE 'EXIT'
        ESCAPE ROUTINE
     NONE VALUE
        MOVE CP-COMMAND TO ERROR-ADDITION(1)
        RETURN-CODE := EC-UNKNOW-COMMAND
  END-DECIDE
END-SUBROUTINE
/*
DEFINE SUBROUTINE LINE-CHECK
  INCLUDE XPCSCH0C "MPROSL0L.DL-CMD" "MPROSL0L-LINES-MAX"
END-SUBROUTINE
/*
DEFINE SUBROUTINE LINE-ENABLE
  IGNORE
END-SUBROUTINE
/*
DEFINE SUBROUTINE LINE-DISABLE
  IGNORE
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN
  IGNORE
END-SUBROUTINE
/*
DEFINE SUBROUTINE LINE-TO-SCREEN
/*  WRITE 'o2s' CP-LINE-CURRENT SCREEN-POS
  RESET DL-CMD-C(CP-LINE-CURRENT)
  MOVE SCREEN-POS TO MEROSM0A.STACK-POS
  MOVE "READ" TO MEROSM0A.ME-COMMAND
  PERFORM MEROSM0S XXERX00A XXCTXX0A MERXPLSA MEROSM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  MOVE BY NAME MEROSM0A TO DR-LINES(CP-LINE-CURRENT)
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-TO-OBJECT
  MOVE BY NAME DR-LINES(CP-LINE-CURRENT) TO MEROSM0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  IF MX-COMMAND EQ "VIEW" THEN
     CP-CURS-FIELD := POS(MPROSL0L.DL-CMD(1))
  ELSE
     CP-CURS-FIELD := POS(MPROSL0L.DL-CMD(1))
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE LINE-EDIT
  PERFORM LINE-CHECK
  IF CP-LINE-CURRENT NE 0 THEN
     IF MPROSL0L.BASE-COL-LIMIT(CP-LINE-CURRENT) EQ 0 THEN
        RETURN-CODE := 2412
        ESCAPE ROUTINE
     END-IF
     MOVE 1601 TO MERXMM0A.RXH-DD-ID
     MOVE 1602 TO MERXMM0A.RXM-DD-ID
     MOVE 1603 TO MERXMM0A.RXP-DD-ID
     MOVE MERHMN0A.RO-ID TO MERXMM0A.RXH-ID
     MOVE BY NAME MERHMN0A TO MERXMM0A
/*     MOVE MPROSL0L.ZK-ID(CP-LINE-CURRENT) TO MERXMM0A.ZK-ID
/*     MOVE MPROSL0L.MT-ID(CP-LINE-CURRENT) TO MERXMM0A.MT-ID
     MOVE MPROSL0L.RM-ID(CP-LINE-CURRENT) TO XMBMXX1A.BM-OBJECT
/*     WRITE "EDIT" CP-LINE-CURRENT XMBMXX1A.BM-OBJECT
     MOVE BY NAME MPROSL0L.DR-LINES(CP-LINE-CURRENT) TO MERXMM0A
     IF XMBMXX1A.BM-OBJECT EQ 0 THEN
        MOVE "NEW-PARTY" TO XMBMXX1A.BM-COMMAND
     ELSE
        MOVE "EDIT-PARTY" TO XMBMXX1A.BM-COMMAND
     END-IF
     PERFORM MMRXMM0S XXERX00A XXCTXX0A XMBMXX1A MERXMM0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-LOAD
  MOVE "LOAD" TO MEROSL0A.ME-COMMAND
  PERFORM MEROSL0S XXERX00A XXCTXX0A MERXPLSA MEROSL0A UXCSXX0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-FREE
  MOVE "FREE" TO MEROSL0A.ME-COMMAND
  PERFORM MEROSL0S XXERX00A XXCTXX0A MERXPLSA MEROSL0A UXCSXX0A
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-RELOAD
  MOVE SCREEN-TOP TO SCREEN-BOT
  SUBTRACT 1 FROM SCREEN-BOT
  PERFORM LIST-NEXT
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-TOP
  SCREEN-TOP := 0
  SCREEN-BOT := 0
  PERFORM LIST-NEXT
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-NEXT
  PERFORM OBJECT-TO-SCREEN
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  MOVE SCREEN-BOT TO SCREEN-POS
  IF SCREEN-POS GE STACK-LEN THEN ESCAPE ROUTINE END-IF
  FOR CP-LINE-CURRENT = 1 TO MPROSL0L-LINES-MAX
     ADD 1 TO SCREEN-POS
     IF SCREEN-POS GT STACK-LEN THEN
        PERFORM OBJECT-CLEAN
        ESCAPE TOP
     END-IF
     IF CP-LINE-CURRENT = 1 THEN
        MOVE SCREEN-POS TO SCREEN-TOP
     END-IF
     MOVE SCREEN-POS TO SCREEN-BOT
/*     WRITE 'next' CP-LINE-CURRENT SCREEN-POS
     PERFORM LINE-TO-SCREEN
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-PREV
  PERFORM OBJECT-TO-SCREEN
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  MOVE SCREEN-TOP TO SCREEN-POS
  IF SCREEN-POS LE 1 THEN ESCAPE ROUTINE END-IF
  FOR CP-LINE-CURRENT = MPROSL0L-LINES-MAX TO 1 STEP -1
     SUBTRACT 1 FROM SCREEN-POS
     IF SCREEN-POS LT 1 THEN ESCAPE BOTTOM END-IF
     IF CP-LINE-CURRENT = MPROSL0L-LINES-MAX THEN
        MOVE SCREEN-POS TO SCREEN-BOT
     END-IF
     MOVE SCREEN-POS TO SCREEN-TOP
     PERFORM LINE-TO-SCREEN
  END-FOR
  IF SCREEN-POS EQ 0 THEN
     PERFORM LIST-TOP
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE LIST-BOTTOM
  MOVE STACK-LEN TO SCREEN-TOP
  ADD 1 TO SCREEN-TOP
  MOVE SCREEN-TOP TO SCREEN-BOT
  PERFORM LIST-PREV
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-CLEAN
  RESET DR-LINES(CP-LINE-CURRENT)
  MOVE (AD=PN) TO DL-CMD-C(CP-LINE-CURRENT)
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-CHECK
  IGNORE
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
