* >Natural Source Header 000000 /*<RO>>
* :NatName MPSARK0S
* :UID ¿‰ÏËÌËÒÚ
* :Mode S
* :CP
* :Date 20070110
* :Time 2207000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  Ó‚‡Î¸˜ÛÍ Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: «‡ÔÓÎÂÌËÂ ÂÍ‚ËÁËÚÓ‚ ‰Î  ÔÓËÒÍ‡ Ò‡Î¸‰Ó
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - VIEW
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX1A
PARAMETER USING MBSASH0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“‹ › –¿Õ¿
LOCAL USING MPSARK0L
LOCAL USING XPMXSM0L
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»— 
LOCAL USING XPMOSH0A
LOCAL USING XPMTSH0A
LOCAL USING XPZKSH0A
LOCAL USING XPGMSH0A
/*
LOCAL USING MBPRMN0A
LOCAL USING MBBSMN0A
LOCAL USING MBLKHM0A
LOCAL USING MBMOMN0A
LOCAL USING MBMTMN0A
/*LOCAL USING MBGMMN0A
LOCAL USING MBZKMN0A
LOCAL USING UXCSXX0A
LOCAL USING MBRKSL0A
/*
LOCAL USING XXSOXX0L
LOCAL USING XPSOSH0A
LOCAL USING XBSOMN0A
LOCAL
1 #RETURN-CODE (I4)
1 #I   (I4)
1 #DATE (D)
END-DEFINE
DEFINE SUBROUTINE MPSARK0S
IF MX-COMMAND NE 'NEW' AND MX-COMMAND NE 'VIEW' THEN
   MOVE MX-COMMAND TO ERROR-ADDITION(1)
   *ERROR-NR := EC-UNKNOW-COMMAND
END-IF
/*
MX-EDITOR-NAME := '«‡ÔÓÎÌÂÌËÂ ÂÍ‚ËÁËÚÓ‚ ‰Î  ÔÓËÒÍ‡ ÓÒÚ‡ÚÍÓ‚.'
/*
PERFORM SCREEN-INIT
PERFORM SCREEN-PREPARE
IF MX-COMMAND = 'VIEW' THEN
  MOVE RETURN-CODE TO #RETURN-CODE
  PERFORM OBJECT-TO-SCREEN
  MOVE #RETURN-CODE TO RETURN-CODE
  RESET #RETURN-CODE
END-IF
/*
IF MX-COMMAND = "NEW" THEN
  MOVE MBSASH0A.IT-ID(*) TO MBSASH0A.IT-ID-ONCE(*)
END-IF
PERFORM SCREEN-MAIN-LOOP
/*
MOVE CP-CMD-EXIT TO BM-COMMAND-PROCESS
/* ŒÒÌÓ‚ÌÓÈ ˆËÍÎ
INCLUDE XPMXXX2C
/*
INCLUDE XPMFSH0C "'''MPSARK0M'''"
/* STANDART COMMANDS
INCLUDE XPRKMP0C
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  CP-CURS-FIELD := POS(MPSARK0L.SA-DT-N)
  MOVE MBSASH0A.IT-ID(*) TO MPSARK0L.IT-ID(*)
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN  /* «¿√–”« ¿ › –¿Õ¿
  MOVE BY NAME MBSASH0A TO MPSARK0L
  MOVE EDITED MBSASH0A.SA-DT (EM=YYYYMMDD) TO MPSARK0L.SA-DT-A
/*
  MOVE MBSASH0A.IT-ID(*) TO MPSARK0L.IT-ID(*)
/*
  IF MPSARK0L.MO-ID NE 0  THEN
     MOVE BY NAME MPSARK0L TO MBMOMN0A
     MBMOMN0A.BL-COMMAND := 'READ'
     PERFORM MBMOMN0S XXERX00A XXCTXX0A MBMOMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBMOMN0A TO MPSARK0L
     MOVE MBMOMN0A.MO-CODE TO MPSARK0L.MO-SEARCH
  END-IF
  /* Ã¿“≈–»¿À€
  IF MPSARK0L.MT-ID NE 0 THEN
     MOVE BY NAME MPSARK0L TO MBMTMN0A
     MBMTMN0A.BL-COMMAND := 'READ'
     PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE MBMTMN0A.MT-CODE TO MPSARK0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPSARK0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPSARK0L.MT-SEARCH
  END-IF
/* œ¿–“»ﬂ
  IF MPSARK0L.PR-ID NE 0 THEN
     MOVE BY NAME MPSARK0L TO MBPRMN0A
     MBPRMN0A.BL-COMMAND := 'READ'
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBPRMN0A TO MPSARK0L
  END-IF
/*
  IF MPSARK0L.DF-ID NE 0 THEN
     MOVE  MPSARK0L.DF-ID TO XBSOMN0A.SO-ID
     MOVE SO-TYPE-DF TO XBSOMN0A.SO-TYPE
     XBSOMN0A.BL-COMMAND := 'READ'
     PERFORM XBSOMN0S XXERX00A XXCTXX0A XBSOMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE XBSOMN0A.SO-ID TO MPSARK0L.DF-ID
     MOVE XBSOMN0A.SO-CODE TO MPSARK0L.DF-CODE
     MOVE XBSOMN0A.SO-NAME TO MPSARK0L.DF-NAME
     MOVE XBSOMN0A.SO-CODE TO MPSARK0L.DF-SEARCH
  END-IF
/*
  IF MPSARK0L.ZK-ID NE 0  THEN
     MOVE BY NAME MPSARK0L TO MBZKMN0A
     MBZKMN0A.BL-COMMAND := 'READ'
     PERFORM MBZKMN0S XXERX00A XXCTXX0A MBZKMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE MBZKMN0A.ZK-CODE TO MPSARK0L.ZK-CODE
     MOVE MBZKMN0A.ZK-NAME TO MPSARK0L.ZK-NAME
     MOVE MBZKMN0A.ZK-CODE TO MPSARK0L.ZK-SEARCH
  END-IF
/*
  IF MPSARK0L.BS-ID NE 0 THEN
     MOVE BY NAME MPSARK0L TO MBBSMN0A
     MBBSMN0A.BL-COMMAND := 'READ'
     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBBSMN0A TO MPSARK0L
  END-IF
/*
/*  IF MPSARK0L.LK-ID NE 0 THEN
/*     MOVE BY NAME MPSARK0L TO MBLKHM0A
/*     MBLKHM0A.BL-COMMAND := 'READ'
/*     PERFORM MBLKMN0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
/*     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
/*     MOVE BY NAME MBLKHM0A TO MPSARK0L
/*  END-IF
/*

/*  IF MPSARK0L.GM-ID NE 0 THEN
/*     MOVE BY NAME MPSARK0L TO MBGMMN0A
/*    MBHMMN0A.BL-COMMAND := 'READ'
/*     PERFORM MBGMMN0S XXERX00A XXCTXX0A MBGMMN0A
/*     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
/*     MOVE BY NAME MBGMMN0A TO MPSARK0L
/*  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE  SCREEN-TO-OBJECT   /* –¿«√–”« ¿ › –¿Õ¿
  MOVE BY NAME MPSARK0L TO MBSASH0A
/*  MOVE MPSARK0L.PR-CODE TO MBSASH0A.PR-ID
  IF SA-DT-A NE ' '
     MOVE EDITED SA-DT-A TO SA-DT(EM=YYYYMMDD)
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-CHECK /* œ–Œ¬≈– ¿ › –¿Õ¿
  /* œ–Œ¬≈– ¿ Õ¿À»◊»ﬂ «¿œŒÀÕ≈Õ»ﬂ  –»“≈–»≈¬ œŒ»— ¿
  IF MPSARK0L.SA-DT-N EQ 0 THEN
     MOVE *DATX TO #DATE
     ADD 1 TO #DATE
     MOVE EDITED #DATE (EM=YYYYMMDD) TO MPSARK0L.SA-DT-A
  END-IF
  INCLUDE XPDTCH0C 'MPSARK0L.SA-DT-N' 'TRUE'
  /* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  MOVE MPSARK0L.MO-CODE TO CP-CHECK-SEARCH
  IF MPSARK0L.MO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSARK0L.MO-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MPSARK0L.MT-CODE TO CP-CHECK-SEARCH
  IF MPSARK0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSARK0L.MT-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MPSARK0L.GM-CODE TO CP-CHECK-SEARCH
  IF MPSARK0L.GM-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPGMSH0A.SH-COMMAND
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSARK0L.GM-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
/* œ¿–“»ﬂ
  IF MPSARK0L.PR-OBJECT-C MODIFIED OR
     MPSARK0L.PR-CODE NE 0 AND MPSARK0L.PR-ID EQ 0 THEN
     RESET MPSARK0L.PR-ID
     MOVE BY NAME MPSARK0L TO MBPRMN0A
     MOVE "LOCATE" TO MBPRMN0A.BL-COMMAND
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ EC-OBJECT-NOT-FOUND THEN
        MOVE 2415 TO RETURN-CODE
     END-IF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSARK0L.PR-CODE)
        ESCAPE ROUTINE
     END-IF
     IF MBPRMN0A.PR-ID NE 0 THEN
        MOVE MBPRMN0A.PR-ID TO MPSARK0L.PR-ID
        MOVE MBPRMN0A.PR-CODE TO MPSARK0L.PR-CODE
     END-IF
/*     WRITE MPSARK0L.PR-ID MPSARK0L.PR-CODE
  END-IF
/*
  MOVE MPSARK0L.DF-CODE TO CP-CHECK-SEARCH
  IF MPSARK0L.DF-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPSOSH0A.SH-COMMAND
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSARK0L.DF-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
/*
  IF MPSARK0L.BS-OBJECT-C MODIFIED OR
     MPSARK0L.BS-CODE NE 0 AND MPSARK0L.BS-ID EQ 0 THEN
     RESET MPSARK0L.BS-ID
     MOVE BY NAME MPSARK0L TO MBBSMN0A
     MOVE "LOCATE" TO MBBSMN0A.BL-COMMAND

     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ EC-OBJECT-NOT-FOUND THEN
        MOVE 2415 TO RETURN-CODE
     END-IF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSARK0L.PR-CODE)
        ESCAPE ROUTINE
     END-IF
     IF MBBSMN0A.BS-ID NE 0 THEN
        MOVE MBBSMN0A.BS-ID TO MPSARK0L.BS-ID
        MOVE MBBSMN0A.BS-CODE TO MPSARK0L.BS-CODE
     END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT-RG  /* ¬€¡Œ– Œ¡⁄≈ “¿
     MOVE MBSASH0A.IT-ID-ONCE(*) TO MBRKSL0A.IT-ID-ONCE(*)
     XPGMSH0A.SH-COMMAND := 'SELECT'
     MOVE '¬˚·Ó Â„ËÒÚÓ‚.' TO MBRKSL0A.RK-FUNCTION-NAME
     PERFORM MBRKSL0S XXERX00A MBRKSL0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     IF  MBRKSL0A.XX-COMMAND NE 'EXIT'
        MOVE MBRKSL0A.IT-ID(*) TO MBSASH0A.IT-ID(*)
        RESET MPSARK0L.IT-ID(*)
        MOVE MBSASH0A.IT-ID(*) TO MPSARK0L.IT-ID(*)
     END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT  /* ¬€¡Œ– Œ¡⁄≈ “¿
/* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  IF CP-CURS-FIELD EQ POS(MPSARK0L.MO-SEARCH) THEN
     MOVE "SELECT" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSARK0L.MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSARK0L.GM-SEARCH)THEN
     XPGMSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSARK0L.DF-SEARCH)THEN
     XPSOSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MO
  IF XPMOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSARK0L.MO-SEARCH EQ " " THEN
     RESET MPSARK0L.MO-ID MPSARK0L.MO-CODE
           MPSARK0L.MO-NAME MPSARK0L.MO-SEARCH
     ESCAPE ROUTINE
  END-IF
  RESET XPMOSH0A.MO-ID
  MOVE MPSARK0L.MO-SEARCH TO XPMOSH0A.MO-SEARCH
  PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
  IF RETURN-CODE EQ 0 AND XPMOSH0A.MO-ID NE 0 THEN
     MOVE XPMOSH0A.MO-ID TO MPSARK0L.MO-ID
     MOVE XPMOSH0A.MO-CODE TO MPSARK0L.MO-CODE
     MOVE XPMOSH0A.MO-NAME TO MPSARK0L.MO-NAME
     MOVE XPMOSH0A.MO-CODE TO MPSARK0L.MO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSARK0L.MT-SEARCH EQ " " THEN
     RESET MPSARK0L.MT-ID MPSARK0L.MT-CODE MPSARK0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPSARK0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE MBMTMN0A.MT-ID TO MPSARK0L.MT-ID
     MOVE MBMTMN0A.MT-CODE TO MPSARK0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPSARK0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPSARK0L.MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-GM
  IF XPGMSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSARK0L.GM-SEARCH EQ " " THEN
     RESET MPSARK0L.GM-ID MPSARK0L.GM-CODE MPSARK0L.GM-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPGMSH0A.GM-ID
  MOVE MPSARK0L.GM-SEARCH TO XPGMSH0A.GM-SEARCH
  PERFORM XPGMSH0S XXERX00A XXCTXX0A XPGMSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPGMSH0A.GM-ID NE 0 THEN
     MOVE XPGMSH0A.GM-ID TO MPSARK0L.GM-ID
     MOVE XPGMSH0A.GM-CODE TO MPSARK0L.GM-CODE
     MOVE XPGMSH0A.GM-NAME TO MPSARK0L.GM-NAME
     MOVE XPGMSH0A.GM-CODE TO MPSARK0L.GM-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-DF
  IF XPSOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSARK0L.DF-SEARCH EQ " " THEN
     RESET MPSARK0L.DF-ID MPSARK0L.DF-CODE MPSARK0L.DF-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPSOSH0A.SO-ID
  MOVE MPSARK0L.DF-SEARCH TO XPSOSH0A.SO-SEARCH
  MOVE SO-TYPE-DF TO XPSOSH0A.SO-TYPE
  PERFORM XPSOSH0S XXERX00A XXCTXX0A XPSOSH0A
  IF RETURN-CODE EQ 0 AND XPSOSH0A.SO-ID NE 0 THEN
     MOVE XPSOSH0A.SO-ID TO MPSARK0L.DF-ID
     MOVE XPSOSH0A.SO-CODE TO MPSARK0L.DF-CODE
     MOVE XPSOSH0A.SO-NAME TO MPSARK0L.DF-NAME
     MOVE XPSOSH0A.SO-CODE TO MPSARK0L.DF-SEARCH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END
