* >Natural Source Header 000000 /*<RO>>
* :NatName MPSKRK0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20080409
* :Time 1855000
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX0A
PARAMETER USING MPSKRK0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“‹ › –¿Õ¿
LOCAL USING MPSKRK0L
LOCAL USING XPMXSM0L
LOCAL USING XPZKSH0A
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»—  Ã¿“≈–»¿À‹ÕŒ Œ“¬≈“—“¬≈ÕÕ€’
LOCAL USING XPMOSH0A
/* œŒ»—  Ã¿“≈–»¿ÀŒ¬
LOCAL USING MBMTMN0A
LOCAL USING XPMTSH0A
LOCAL USING XXSOXX0L
LOCAL USING XPSOSH0A
/*
LOCAL USING MBPRMN0A
LOCAL
1 #I   (I4)
END-DEFINE
DEFINE SUBROUTINE MPSKRK0S
/*
MX-EDITOR-NAME :=  '«‡ÔÓÎÌÂÌËÂ Ô‡‡ÏÂÚÓ‚ ÔÓËÒÍ‡'
/*
INCLUDE XPMFMN0C '"""MPSKRK0M"""'
/* STANDART COMMANDS
INCLUDE XPRKMP0C
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  DECIDE ON FIRST VALUE MX-COMMAND
     VALUE 'VIEW'
        PERFORM SCREEN-LOAD
     VALUE 'EDIT'
        PERFORM SCREEN-LOAD
     VALUE 'NEW'
        MOVE EDITED *DATX (EM=YYYYMMDD) TO MPSKRK0L.DATA-START-A
        MOVE EDITED *DATX (EM=YYYYMMDD) TO MPSKRK0L.DATA-STOP-A
        MOVE 0101 TO MPSKRK0L.DATA-START-MMDD
     NONE VALUE
        MOVE XPMXXX0A.MX-COMMAND TO ERROR-ADDITION(1)
        *ERROR-NR := EC-UNKNOW-COMMAND
  END-DECIDE
  RESET MX-COMMAND
  MOVE (AD=P) TO MPSKRK0L.ZK-C MPSKRK0L.BASE-MT-C
  FOR #I = 1 TO 15
     IF MPSKRK0A.ATTR-NAME(#I) EQ "ZK" THEN
        RESET MPSKRK0L.ZK-C
     END-IF
     IF MPSKRK0A.ATTR-NAME(#I) EQ "BASE-MT" THEN
        RESET MPSKRK0L.BASE-MT-C
     END-IF
  END-FOR
END-SUBROUTINE
/***********************************************************************
DEFINE SUBROUTINE SCREEN-CHECK /* œ–Œ¬≈– ¿ › –¿Õ¿
  INCLUDE XPDTCH0C "MPSKRK0L.DATA-START-N" "TRUE"
  INCLUDE XPDTCH0C "MPSKRK0L.DATA-STOP-N" "TRUE"
  IF MPSKRK0L.DATA-START-N > MPSKRK0L.DATA-STOP-N THEN
     CP-CURS-FIELD := POS(MPSKRK0L.DATA-START-N)
     RETURN-CODE := 2306
     ESCAPE ROUTINE
  END-IF
  /* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  MOVE MPSKRK0L.MO-CODE TO CP-CHECK-SEARCH
  IF MPSKRK0L.MO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSKRK0L.MO-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  INCLUDE XPOBCH0C "MPSKRK0L.MO-ID" "MPSKRK0L.MO-SEARCH"
  /*
  MOVE MPSKRK0L.MT-CODE TO CP-CHECK-SEARCH
  IF MPSKRK0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSKRK0L.MT-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
/* œ¿–“»ﬂ
  IF MPSKRK0L.PR-CODE NE 0 THEN
     IF MPSKRK0L.PR-CODE NE MPSKRK0L.PR-CODE-ORG THEN
        RESET MPSKRK0L.PR-ID
        MOVE BY NAME MPSKRK0L TO MBPRMN0A
        MOVE "LOCATE" TO MBPRMN0A.BL-COMMAND
        PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
        IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ EC-OBJECT-NOT-FOUND THEN
           MOVE 2415 TO RETURN-CODE
        END-IF
        IF RETURN-CODE NE 0 THEN
           CP-CURS-FIELD := POS(MPSKRK0L.PR-CODE)
           ESCAPE ROUTINE
        END-IF
        IF MBPRMN0A.PR-ID NE 0 THEN
           MOVE MBPRMN0A.PR-ID TO MPSKRK0L.PR-ID
           MOVE MBPRMN0A.PR-CODE TO MPSKRK0L.PR-CODE
           MOVE MBPRMN0A.PR-CODE TO MPSKRK0L.PR-CODE-ORG
        END-IF
     END-IF
  ELSE
     RESET MPSKRK0L.PR-ID MPSKRK0L.PR-CODE MPSKRK0L.PR-CODE-ORG
  END-IF
  /*
  MOVE MPSKRK0L.DF-CODE TO CP-CHECK-SEARCH
  IF MPSKRK0L.DF-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPSOSH0A.SH-COMMAND
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSKRK0L.DF-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MPSKRK0L.BASE-MT-CODE TO CP-CHECK-SEARCH
  IF MPSKRK0L.BASE-MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-BASE-MT
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSKRK0L.BASE-MT-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  IF MPSKRK0L.BASE-MT-ID EQ 0 THEN
     INCLUDE XPOBCH0C "MPSKRK0L.MT-ID" "MPSKRK0L.MT-SEARCH"
  END-IF
  MOVE MPSKRK0L.ZK-CODE TO CP-CHECK-SEARCH
  IF MPSKRK0L.ZK-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPZKSH0A.SH-COMMAND
     PERFORM SEARCH-ZK
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSKRK0L.ZK-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT  /* ¬€¡Œ– Œ¡⁄≈ “¿
  IF CP-CURS-FIELD EQ POS(MPSKRK0L.MO-SEARCH) THEN
     MOVE "SELECT" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSKRK0L.MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSKRK0L.BASE-MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-BASE-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSKRK0L.ZK-SEARCH)THEN
     XPZKSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-ZK
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSKRK0L.DF-SEARCH)THEN
     XPSOSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN
  PERFORM SCREEN-LOAD
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-TO-OBJECT
 PERFORM RECORD-LOAD
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-LOAD /* «¿√–”« ¿ › –¿Õ¿
  MOVE EDITED MPSKRK0A.DATA-START (EM=YYYYMMDD) TO MPSKRK0L.DATA-START-A
  MOVE EDITED MPSKRK0A.DATA-STOP (EM=YYYYMMDD) TO MPSKRK0L.DATA-STOP-A
  MOVE BY NAME MPSKRK0A TO MPSKRK0L
  IF MPSKRK0A.MO-CODE NE 0 THEN
     MOVE MPSKRK0A.MO-CODE TO MPSKRK0L.MO-SEARCH
  END-IF
  IF MPSKRK0A.MT-CODE NE " " THEN
     MOVE MPSKRK0A.MT-CODE TO MPSKRK0L.MT-SEARCH
  END-IF
  IF MPSKRK0A.ZK-CODE NE " " THEN
     MOVE MPSKRK0A.ZK-CODE TO MPSKRK0L.ZK-SEARCH
  END-IF
  IF MPSKRK0A.BASE-MT-CODE NE " " THEN
     MOVE MPSKRK0A.BASE-MT-CODE TO MPSKRK0L.BASE-MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOAD  /* –¿«√–”« ¿ › –¿Õ¿
  MOVE BY NAME MPSKRK0L TO MPSKRK0A
  MOVE EDITED MPSKRK0L.DATA-START-A TO MPSKRK0A.DATA-START (EM=YYYYMMDD)
  MOVE EDITED MPSKRK0L.DATA-STOP-A TO MPSKRK0A.DATA-STOP (EM=YYYYMMDD)
/* MO  Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
/* MT  Ã¿“≈–»¿À¿À
/* PR  œ¿–“»ﬂ
  FOR #I = 1 TO 15
     DECIDE ON FIRST VALUE MPSKRK0A.ATTR-NAME(#I)
        VALUE 'MO'
           MOVE MPSKRK0L.MO-ID TO MPSKRK0A.ATTR-VALUE(#I)
        VALUE 'MT'
           MOVE MPSKRK0L.MT-ID TO MPSKRK0A.ATTR-VALUE(#I)
        VALUE 'PR'
           MOVE MPSKRK0L.PR-ID TO MPSKRK0A.ATTR-VALUE(#I)
        VALUE 'ZK'
           MOVE MPSKRK0L.ZK-ID TO MPSKRK0A.ATTR-VALUE(#I)
        VALUE "DF"
           MOVE MPSKRK0L.DF-ID TO MPSKRK0A.ATTR-VALUE(#I)
        VALUE 'BASE-MT'
           MOVE MPSKRK0L.BASE-MT-ID TO MPSKRK0A.ATTR-VALUE(#I)
        NONE VALUE
           IGNORE
     END-DECIDE
  END-FOR
END-SUBROUTINE
/*
/*
DEFINE SUBROUTINE SEARCH-DF
  IF XPSOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSKRK0L.DF-SEARCH EQ " " THEN
     RESET MPSKRK0L.DF-ID MPSKRK0L.DF-CODE MPSKRK0L.DF-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPSOSH0A.SO-ID
  MOVE MPSKRK0L.DF-SEARCH TO XPSOSH0A.SO-SEARCH
  MOVE SO-TYPE-DF TO XPSOSH0A.SO-TYPE
  PERFORM XPSOSH0S XXERX00A XXCTXX0A XPSOSH0A
  IF RETURN-CODE EQ 0 AND XPSOSH0A.SO-ID NE 0 THEN
     MOVE XPSOSH0A.SO-ID TO MPSKRK0L.DF-ID
     MOVE XPSOSH0A.SO-CODE TO MPSKRK0L.DF-CODE
     MOVE XPSOSH0A.SO-NAME TO MPSKRK0L.DF-NAME
     MOVE XPSOSH0A.SO-CODE TO MPSKRK0L.DF-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MO
  IF XPMOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSKRK0L.MO-SEARCH EQ " " THEN
     RESET MPSKRK0L.MO-ID MPSKRK0L.MO-CODE
           MPSKRK0L.MO-NAME MPSKRK0L.MO-SEARCH
     ESCAPE ROUTINE
  END-IF
  IF XXCTXX0A.US-MO-ID NE 0 OR MX-COMMAND EQ "EDIT" THEN
     ESCAPE ROUTINE
  END-IF
  RESET XPMOSH0A.MO-ID
  MOVE MPSKRK0L.MO-SEARCH TO XPMOSH0A.MO-SEARCH
  PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
  IF RETURN-CODE EQ 0 AND XPMOSH0A.MO-ID NE 0 THEN
     MOVE XPMOSH0A.MO-ID TO MPSKRK0L.MO-ID
     MOVE XPMOSH0A.MO-CODE TO MPSKRK0L.MO-CODE
     MOVE XPMOSH0A.MO-NAME TO MPSKRK0L.MO-NAME
     MOVE XPMOSH0A.MO-CODE TO MPSKRK0L.MO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSKRK0L.MT-SEARCH EQ " " THEN
     RESET MPSKRK0L.MT-ID MPSKRK0L.MT-CODE MPSKRK0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPSKRK0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE MBMTMN0A.MT-ID TO MPSKRK0L.MT-ID
     MOVE MBMTMN0A.MT-CODE TO MPSKRK0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPSKRK0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPSKRK0L.MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-BASE-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSKRK0L.BASE-MT-SEARCH EQ " " THEN
     RESET MPSKRK0L.BASE-MT-ID MPSKRK0L.BASE-MT-CODE MPSKRK0L.BASE-MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPSKRK0L.BASE-MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
/*  WRITE RETURN-CODE MBMTMN0A.MT-ID
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE MBMTMN0A.MT-ID TO MPSKRK0L.BASE-MT-ID
     MOVE MBMTMN0A.MT-CODE TO MPSKRK0L.BASE-MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPSKRK0L.BASE-MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPSKRK0L.BASE-MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-ZK
  IF XPZKSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSKRK0L.ZK-SEARCH EQ " " THEN
     RESET MPSKRK0L.ZK-ID MPSKRK0L.ZK-CODE
     ESCAPE ROUTINE
  END-IF
  RESET XPZKSH0A.ZK-ID
  MOVE MPSKRK0L.ZK-SEARCH TO XPZKSH0A.ZK-SEARCH
  PERFORM XPZKSH0S XXERX00A XXCTXX0A XPZKSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPZKSH0A.ZK-ID NE 0 THEN
     MOVE XPZKSH0A.ZK-ID TO MPSKRK0L.ZK-ID
     MOVE XPZKSH0A.ZK-CODE TO MPSKRK0L.ZK-CODE
     MOVE XPZKSH0A.ZK-CODE TO MPSKRK0L.ZK-SEARCH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END


