* >Natural Source Header 000000 /*<RO>>
* :NatName MPSORK0S
* :UID ¿‰ÏËÌËÒÚ
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  Ó‚‡Î¸˜ÛÍ Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: «‡ÔÓÎÂÌËÂ ÂÍ‚ËÁËÚÓ‚ ‰Î  ÔÓËÒÍ‡ Ò‡Î¸‰Ó
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - VIEW
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX1A
PARAMETER USING MBSORK0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“‹ › –¿Õ¿
LOCAL USING MPSORK0L
LOCAL USING XPMXSM0L
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»— 
LOCAL USING XPMOSH0A
LOCAL USING XPMTSH0A
LOCAL USING XPZKSH0A
LOCAL USING XPGMSH0A
/*
LOCAL USING MBPRMN0A
LOCAL USING MBBSMN0A
LOCAL USING MBLKHM0A
LOCAL USING MBMOMN0A
LOCAL USING MBMTMN0A
LOCAL USING MBGMMN0A
LOCAL USING XPVOSH0A
LOCAL USING MBVOMN0A
/*LOCAL USING MBGMMN0A
LOCAL USING MBZKMN0A
LOCAL USING UXCSXX0A
LOCAL USING MBRKSL0A
LOCAL USING XXSOXX0L
LOCAL USING XPSOSH0A
LOCAL USING XBSOMN0A
LOCAL
1 #RETURN-CODE (I4)
1 #I   (I4)
1 #DATE (D)
1 #DATA-S (A10)
1 REDEFINE #DATA-S
  2 #YEAR (A4)
  2 #MONTH-DAY (A4)
END-DEFINE
DEFINE SUBROUTINE MPSORK0S
IF MX-COMMAND NE 'NEW' AND MX-COMMAND NE 'VIEW' THEN
   MOVE MX-COMMAND TO ERROR-ADDITION(1)
   *ERROR-NR := EC-UNKNOW-COMMAND
END-IF
/*
MX-EDITOR-NAME := '«‡ÔÓÎÂÌËÂ ÂÍ‚ËÁËÚÓ‚ ‰Î  ÔÓËÒÍ‡ ÓÒÚ‡ÚÍÓ‚.'
/*
PERFORM SCREEN-INIT
PERFORM SCREEN-PREPARE
IF MX-COMMAND = 'VIEW' THEN
  MOVE RETURN-CODE TO #RETURN-CODE
  PERFORM OBJECT-TO-SCREEN
  MOVE #RETURN-CODE TO RETURN-CODE
  RESET #RETURN-CODE
END-IF
/*
IF MX-COMMAND = "NEW" THEN
  MOVE MBSORK0A.IT-ID(*) TO MBSORK0A.IT-ID-ONCE(*)
END-IF
PERFORM SCREEN-MAIN-LOOP
/*
MOVE CP-CMD-EXIT TO BM-COMMAND-PROCESS
/* ŒÒÌÓ‚ÌÓÈ ˆËÍÎ
INCLUDE XPMXXX2C
/*
INCLUDE XPMFSH0C "'''MPSORK0M'''"
/* STANDART COMMANDS
INCLUDE XPRKMP0C
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  CP-CURS-FIELD := POS(MPSORK0L.SA-DT-S-N)
  MOVE MBSORK0A.IT-ID(*) TO MPSORK0L.IT-ID(*)
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN  /* «¿√–”« ¿ › –¿Õ¿
  MOVE BY NAME MBSORK0A TO MPSORK0L
  MOVE EDITED MBSORK0A.SA-DT-S (EM=YYYYMMDD) TO MPSORK0L.SA-DT-S-A
  MOVE EDITED MBSORK0A.SA-DT-PO (EM=YYYYMMDD) TO MPSORK0L.SA-DT-PO-A
/*
  MOVE MBSORK0A.IT-ID(*) TO MPSORK0L.IT-ID(*)
/*
  IF MPSORK0L.VO-ID NE 0  THEN
     MOVE BY NAME MPSORK0L TO MBVOMN0A
     MBVOMN0A.BL-COMMAND := 'READ'
     PERFORM MBVOMN0S XXERX00A XXCTXX0A MBVOMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBVOMN0A TO MPSORK0L
     MOVE MBVOMN0A.VO-CODE TO MPSORK0L.VO-SEARCH
  END-IF
/*
  IF MPSORK0L.MO-ID NE 0  THEN
     MOVE BY NAME MPSORK0L TO MBMOMN0A
     MBMOMN0A.BL-COMMAND := 'READ'
     PERFORM MBMOMN0S XXERX00A XXCTXX0A MBMOMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBMOMN0A TO MPSORK0L
     MOVE MBMOMN0A.MO-CODE TO MPSORK0L.MO-SEARCH
  END-IF
  /* Ã¿“≈–»¿À€
  IF MPSORK0L.MT-ID NE 0 THEN
     MOVE BY NAME MPSORK0L TO MBMTMN0A
     MBMTMN0A.BL-COMMAND := 'READ'
     PERFORM MBMTMN0S XXERX00A XXCTXX0A MBMTMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE MBMTMN0A.MT-CODE TO MPSORK0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPSORK0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPSORK0L.MT-SEARCH
  END-IF
/* œ¿–“»ﬂ
  IF MPSORK0L.PR-ID NE 0 THEN
     MOVE BY NAME MPSORK0L TO MBPRMN0A
     MBPRMN0A.BL-COMMAND := 'READ'
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBPRMN0A TO MPSORK0L
  END-IF
/*
  IF MPSORK0L.ZK-ID NE 0  THEN
     MOVE BY NAME MPSORK0L TO MBZKMN0A
     MBZKMN0A.BL-COMMAND := 'READ'
     PERFORM MBZKMN0S XXERX00A XXCTXX0A MBZKMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBZKMN0A TO MPSORK0L
  END-IF
/*
/*  IF MPSORK0L.LK-ID NE 0 THEN
/*     MOVE BY NAME MPSORK0L TO MBLKHM0A
/*     MBLKHM0A.BL-COMMAND := 'READ'
/*     PERFORM MBLKMN0S XXERX00A XXCTXX0A MBLKHM0A UXCSXX0A
/*    IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
/*     MOVE BY NAME MBLKHM0A TO MPSORK0L
/*  END-IF
/*
  IF MPSORK0L.BS-ID NE 0 THEN
     MOVE BY NAME MPSORK0L TO MBBSMN0A
     MBBSMN0A.BL-COMMAND := 'READ'
     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE BY NAME MBBSMN0A TO MPSORK0L
  END-IF
/*
  IF MPSORK0L.GM-ID NE 0 THEN
     MOVE BY NAME MPSORK0L TO MBGMMN0A
     MBGMMN0A.BL-COMMAND := 'READ'
     PERFORM MBGMMN0S XXERX00A XXCTXX0A MBGMMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE MBGMMN0A.GM-ID TO MPSORK0L.GM-ID
     MOVE MBGMMN0A.GM-CODE TO MPSORK0L.GM-SEARCH
     MOVE MBGMMN0A.GM-CODE TO MPSORK0L.GM-CODE
     MOVE MBGMMN0A.GM-NAME TO MPSORK0L.GM-NAME
  END-IF
  /*
  IF MPSORK0L.DF-ID NE 0 THEN
     MOVE  MPSORK0L.DF-ID TO XBSOMN0A.SO-ID
     MOVE SO-TYPE-DF TO XBSOMN0A.SO-TYPE
     XBSOMN0A.BL-COMMAND := 'READ'
     PERFORM XBSOMN0S XXERX00A XXCTXX0A XBSOMN0A
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
     MOVE XBSOMN0A.SO-ID TO MPSORK0L.DF-ID
     MOVE XBSOMN0A.SO-CODE TO MPSORK0L.DF-CODE
     MOVE XBSOMN0A.SO-NAME TO MPSORK0L.DF-NAME
     MOVE XBSOMN0A.SO-CODE TO MPSORK0L.DF-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE  SCREEN-TO-OBJECT   /* –¿«√–”« ¿ › –¿Õ¿
  MOVE BY NAME MPSORK0L TO MBSORK0A
/*  MOVE MPSoRK0L.PR-CODE TO MBSORK0A.PR-ID
  IF SA-DT-S-A NE ' '
     MOVE EDITED SA-DT-S-A TO SA-DT-S(EM=YYYYMMDD)
  END-IF
  IF SA-DT-PO-A NE ' '
     MOVE EDITED SA-DT-PO-A TO SA-DT-PO(EM=YYYYMMDD)
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-CHECK /* œ–Œ¬≈– ¿ › –¿Õ¿
  /* œ–Œ¬≈– ¿ Õ¿À»◊»ﬂ «¿œŒÀÕ≈Õ»ﬂ  –»“≈–»≈¬ œŒ»— ¿
  IF MPSORK0L.SA-DT-S-N EQ 0 THEN
     MOVE EDITED *DATX (EM=YYYYMMDD) TO #DATA-S
     MOVE "0101" TO #MONTH-DAY
     MOVE #DATA-S TO MPSORK0L.SA-DT-S-A
  END-IF
  IF MPSORK0L.SA-DT-PO-N EQ 0 THEN
     MOVE *DATX TO #DATE
     ADD 1 TO #DATE
     MOVE EDITED #DATE (EM=YYYYMMDD) TO MPSORK0L.SA-DT-PO-A
  END-IF
  IF MPSORK0L.SA-DT-S-N > MPSORK0L.SA-DT-PO-N
     MOVE 2510 TO RETURN-CODE
     CP-CURS-FIELD := POS(MPSORK0L.SA-DT-S-N)
     ESCAPE ROUTINE
  END-IF
  INCLUDE XPDTCH0C "MPSORK0L.SA-DT-S-N" "TRUE"
  INCLUDE XPDTCH0C "MPSORK0L.SA-DT-PO-N" "TRUE"
/*
  MOVE MPSORK0L.VO-CODE TO CP-CHECK-SEARCH
  IF MPSORK0L.VO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPVOSH0A.SH-COMMAND
     PERFORM SEARCH-VO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  /* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  MOVE MPSORK0L.MO-CODE TO CP-CHECK-SEARCH
  IF MPSORK0L.MO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSORK0L.MO-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MPSORK0L.MT-CODE TO CP-CHECK-SEARCH
  IF MPSORK0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSORK0L.MT-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  /*
  MOVE MPSORK0L.GM-CODE TO CP-CHECK-SEARCH
  IF MPSORK0L.GM-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPGMSH0A.SH-COMMAND
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSORK0L.GM-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
/*
  MOVE MPSORK0L.DF-CODE TO CP-CHECK-SEARCH
  IF MPSORK0L.DF-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPSOSH0A.SH-COMMAND
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSORK0L.DF-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  IF MPSORK0L.BS-OBJECT-C MODIFIED
     IF MPSORK0L.BS-CODE NE 0 AND MPSORK0L.BS-ID EQ 0 THEN
     RESET MPSORK0L.BS-ID
     MOVE BY NAME MPSORK0L TO MBBSMN0A
     MOVE "LOCATE" TO MBBSMN0A.BL-COMMAND
     PERFORM MBBSMN0S XXERX00A XXCTXX0A MBBSMN0A
     IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ EC-OBJECT-NOT-FOUND THEN
        MOVE 2415 TO RETURN-CODE
     END-IF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSORK0L.BS-CODE)
        ESCAPE ROUTINE
     END-IF
     IF MBBSMN0A.BS-ID NE 0 THEN
        MOVE MBBSMN0A.BS-ID TO MPSORK0L.BS-ID
        MOVE MBBSMN0A.BS-CODE TO MPSORK0L.BS-CODE
        MOVE MBBSMN0A.BS-NAME TO MPSORK0L.BS-NAME
     END-IF
  ELSE
     RESET MPSORK0L.BS-ID MPSORK0L.BS-CODE MPSORK0L.BS-NAME
  END-IF
  END-IF
/* œ¿–“»ﬂ
  IF MPSORK0L.PR-OBJECT-C MODIFIED OR
     MPSORK0L.PR-CODE NE 0 AND MPSORK0L.PR-ID EQ 0 THEN
     RESET MPSORK0L.PR-ID
     MOVE BY NAME MPSORK0L TO MBPRMN0A
     MOVE "LOCATE" TO MBPRMN0A.BL-COMMAND
     PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
     IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ EC-OBJECT-NOT-FOUND THEN
        MOVE 2415 TO RETURN-CODE
     END-IF
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPSORK0L.PR-CODE)
        ESCAPE ROUTINE
     END-IF
     IF MBPRMN0A.PR-ID NE 0 THEN
        MOVE MBPRMN0A.PR-ID TO MPSORK0L.PR-ID
        MOVE MBPRMN0A.PR-CODE TO MPSORK0L.PR-CODE
     END-IF
/*     WRITE MPSoRK0L.PR-ID MPSoRK0L.PR-CODE
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT-RG  /* ¬€¡Œ– Œ¡⁄≈ “¿
     MOVE MBSORK0A.IT-ID-ONCE(*) TO MBRKSL0A.IT-ID-ONCE(*)
     XPGMSH0A.SH-COMMAND := 'SELECT'
     MOVE '¬˚·Ó Â„ËÒÚÓ‚.' TO MBRKSL0A.RK-FUNCTION-NAME
     PERFORM MBRKSL0S XXERX00A MBRKSL0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     IF  MBRKSL0A.XX-COMMAND NE 'EXIT'
        MOVE MBRKSL0A.IT-ID(*) TO MBSORK0A.IT-ID(*)
        RESET MPSORK0L.IT-ID(*)
        MOVE MBSORK0A.IT-ID(*) TO MPSORK0L.IT-ID(*)
     END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT  /* ¬€¡Œ– Œ¡⁄≈ “¿
  /* ¬Õ≈ÿÕﬂﬂ Œ–√¿Õ»«¿÷»ﬂ
  IF CP-CURS-FIELD EQ POS(MPSORK0L.VO-SEARCH) THEN
     MOVE "SELECT" TO XPVOSH0A.SH-COMMAND
     PERFORM SEARCH-VO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
/* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  IF CP-CURS-FIELD EQ POS(MPSORK0L.MO-SEARCH) THEN
     MOVE "SELECT" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSORK0L.MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSORK0L.GM-SEARCH)THEN
     XPGMSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-GM
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPSORK0L.DF-SEARCH)THEN
     XPSOSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-DF
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MO
  IF XPMOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSORK0L.MO-SEARCH EQ " " THEN
     RESET MPSORK0L.MO-ID MPSORK0L.MO-CODE
           MPSORK0L.MO-NAME MPSORK0L.MO-SEARCH
     ESCAPE ROUTINE
  END-IF
  RESET XPMOSH0A.MO-ID
  MOVE MPSORK0L.MO-SEARCH TO XPMOSH0A.MO-SEARCH
  PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
  IF RETURN-CODE EQ 0 AND XPMOSH0A.MO-ID NE 0 THEN
     MOVE XPMOSH0A.MO-ID TO MPSORK0L.MO-ID
     MOVE XPMOSH0A.MO-CODE TO MPSORK0L.MO-CODE
     MOVE XPMOSH0A.MO-NAME TO MPSORK0L.MO-NAME
     MOVE XPMOSH0A.MO-CODE TO MPSORK0L.MO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSORK0L.MT-SEARCH EQ " " THEN
     RESET MPSORK0L.MT-ID MPSORK0L.MT-CODE MPSORK0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPSORK0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE MBMTMN0A.MT-ID TO MPSORK0L.MT-ID
     MOVE MBMTMN0A.MT-CODE TO MPSORK0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPSORK0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPSORK0L.MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-GM
  IF XPGMSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSORK0L.GM-SEARCH EQ " " THEN
     RESET MPSORK0L.GM-ID MPSORK0L.GM-CODE MPSORK0L.GM-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPGMSH0A.GM-ID
  MOVE MPSORK0L.GM-SEARCH TO XPGMSH0A.GM-SEARCH
  PERFORM XPGMSH0S XXERX00A XXCTXX0A XPGMSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPGMSH0A.GM-ID NE 0 THEN
     MOVE XPGMSH0A.GM-ID TO MPSORK0L.GM-ID
     MOVE XPGMSH0A.GM-CODE TO MPSORK0L.GM-CODE
     MOVE XPGMSH0A.GM-NAME TO MPSORK0L.GM-NAME
     MOVE XPGMSH0A.GM-CODE TO MPSORK0L.GM-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-VO
  IF XPVOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSORK0L.VO-SEARCH EQ " " THEN
     RESET MPSORK0L.VO-ID MPSORK0L.VO-CODE
           MPSORK0L.VO-INN MPSORK0L.VO-KPP
           MPSORK0L.VO-NAME MPSORK0L.VO-ADDR
     ESCAPE ROUTINE
  END-IF
  RESET XPVOSH0A.VO-ID
  MOVE MPSORK0L.VO-SEARCH TO XPVOSH0A.VO-SEARCH
  PERFORM XPVOSH0S XXERX00A XXCTXX0A XPVOSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF RETURN-CODE EQ 0 AND XPVOSH0A.VO-ID NE 0 THEN
     MOVE BY NAME XPVOSH0A TO MPSORK0L
     MOVE XPVOSH0A.VO-CODE TO MPSORK0L.VO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-DF
  IF XPSOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPSORK0L.DF-SEARCH EQ " " THEN
     RESET MPSORK0L.DF-ID MPSORK0L.DF-CODE MPSORK0L.DF-NAME
     ESCAPE ROUTINE
  END-IF
  RESET XPSOSH0A.SO-ID
  MOVE MPSORK0L.DF-SEARCH TO XPSOSH0A.SO-SEARCH
  MOVE SO-TYPE-DF TO XPSOSH0A.SO-TYPE
  PERFORM XPSOSH0S XXERX00A XXCTXX0A XPSOSH0A
  IF RETURN-CODE EQ 0 AND XPSOSH0A.SO-ID NE 0 THEN
     MOVE XPSOSH0A.SO-ID TO MPSORK0L.DF-ID
     MOVE XPSOSH0A.SO-CODE TO MPSORK0L.DF-CODE
     MOVE XPSOSH0A.SO-NAME TO MPSORK0L.DF-NAME
     MOVE XPSOSH0A.SO-CODE TO MPSORK0L.DF-SEARCH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END
