* >Natural Source Header 000000 /*<RO>>
* :NatName MPVPCM0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070606
* :Time 1141000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  Ó‚‡Î¸˜ÛÍ Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: «‡ÔÓÎÂÌËÂ ÂÍ‚ËÁËÚÓ‚ ‰Î  ÔÓËÒÍ‡ Ò‡Î¸‰Ó
/*  ŒÃ¿Õƒ€:
/*  - NEW
/*  - VIEW
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPMXXX1A
PARAMETER USING MPVPCM0A
PARAMETER USING UXCSXX0A
/* —“¿Õƒ¿–“Õ€≈  Œƒ€ Œÿ»¡Œ 
LOCAL USING XXXXEC0L
LOCAL USING XPXXEC0L
/* Œ¡À¿—“‹ › –¿Õ¿
LOCAL USING MPVPCM0L
LOCAL USING XPMXSM0L
/* Œ¡–¿¡Œ“ ¿  ŒÃ¿Õƒ
LOCAL USING XPCPXX0L
/* œŒ»— 
LOCAL USING XPMOSH0A
LOCAL USING XPMTSH0A
LOCAL USING XPZKSH0A
/*
LOCAL USING MBMOMN0A
LOCAL USING MBMTMN0A
LOCAL USING MBZKMN0A
/*
LOCAL USING MBRKSL0A
LOCAL USING MBGMMN0A
LOCAL USING XXSOXX0L
LOCAL USING XPSOSH0A
LOCAL USING XBSOMN0A
LOCAL
1 #RETURN-CODE (I4)
1 #I   (I4)
1 #DATE (D)
END-DEFINE
DEFINE SUBROUTINE MPVPCM0S
IF MX-COMMAND NE 'NEW' AND MX-COMMAND NE 'VIEW' THEN
   MOVE MX-COMMAND TO ERROR-ADDITION(1)
   *ERROR-NR := EC-UNKNOW-COMMAND
END-IF
/*
MX-EDITOR-NAME := '«‡ÔÓÎÂÌËÂ ÂÍ‚ËÁËÚÓ‚ ‰Î  ‚ÓÁ‚‡Ú‡.'
/*
PERFORM SCREEN-INIT
PERFORM SCREEN-PREPARE
IF MX-COMMAND = 'VIEW' THEN
  MOVE RETURN-CODE TO #RETURN-CODE
  PERFORM OBJECT-TO-SCREEN
  MOVE #RETURN-CODE TO RETURN-CODE
  RESET #RETURN-CODE
END-IF
/*
PERFORM SCREEN-MAIN-LOOP
/*
MOVE CP-CMD-EXIT TO BM-COMMAND-PROCESS
/* ŒÒÌÓ‚ÌÓÈ ˆËÍÎ
INCLUDE XPMXXX2C
/*
INCLUDE XPMFSH0C "'''MPVPCM0M'''"
/* STANDART COMMANDS
INCLUDE XPRKMP0C
/*
DEFINE SUBROUTINE SCREEN-PREPARE
  CP-CURS-FIELD := POS(MPVPCM0L.VP-NUMBER)
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-TO-SCREEN  /* «¿√–”« ¿ › –¿Õ¿
  IGNORE
END-SUBROUTINE
/*
DEFINE SUBROUTINE  SCREEN-TO-OBJECT   /* –¿«√–”« ¿ › –¿Õ¿
  IGNORE
END-SUBROUTINE
/*
DEFINE SUBROUTINE SCREEN-CHECK /* œ–Œ¬≈– ¿ › –¿Õ¿
  /* œ–Œ¬≈– ¿ Õ¿À»◊»ﬂ «¿œŒÀÕ≈Õ»ﬂ  –»“≈–»≈¬ œŒ»— ¿
  INCLUDE XPOBCH0C "MPVPCM0L.VP-NUMBER" "MPVPCM0L.VP-NUMBER"
  INCLUDE XPDTCH0C "MPVPCM0L.VP-DT-N" 'TRUE'
  /* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  MOVE MPVPCM0L.MO-CODE TO CP-CHECK-SEARCH
  IF MPVPCM0L.MO-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPVPCM0L.MO-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  INCLUDE XPOBCH0C "MPVPCM0L.MO-ID" "MPVPCM0L.MO-SEARCH"
  /*
  MOVE MPVPCM0L.MT-CODE TO CP-CHECK-SEARCH
  IF MPVPCM0L.MT-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPMTSH0A.SH-COMMAND
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPVPCM0L.MT-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  INCLUDE XPOBCH0C "MPVPCM0L.MT-ID" "MPVPCM0L.MT-SEARCH"
  /*
  MOVE MPVPCM0L.ZK-CODE TO CP-CHECK-SEARCH
  IF MPVPCM0L.ZK-SEARCH NE CP-CHECK-SEARCH THEN
     MOVE "LOCATE" TO XPZKSH0A.SH-COMMAND
     PERFORM SEARCH-ZK
     IF RETURN-CODE NE 0 THEN
        CP-CURS-FIELD := POS(MPVPCM0L.ZK-SEARCH)
        ESCAPE ROUTINE
     END-IF
  END-IF
  INCLUDE XPOBCH0C "MPVPCM0L.ZK-ID" "MPVPCM0L.ZK-SEARCH"
END-SUBROUTINE
/*
DEFINE SUBROUTINE OBJECT-SELECT  /* ¬€¡Œ– Œ¡⁄≈ “¿
/* Ã¿“ Œ“¬≈“—“¬≈ÕÕ€…
  IF CP-CURS-FIELD EQ POS(MPVPCM0L.MO-SEARCH) THEN
     MOVE "SELECT" TO XPMOSH0A.SH-COMMAND
     PERFORM SEARCH-MO
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPVPCM0L.MT-SEARCH)THEN
     XPMTSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-MT
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF CP-CURS-FIELD = POS(MPVPCM0L.ZK-SEARCH)THEN
     XPZKSH0A.SH-COMMAND := 'SELECT'
     PERFORM SEARCH-ZK
     IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MO
  IF XPMOSH0A.SH-COMMAND EQ "LOCATE" AND
     MPVPCM0L.MO-SEARCH EQ " " THEN
     RESET MPVPCM0L.MO-ID MPVPCM0L.MO-CODE
           MPVPCM0L.MO-NAME MPVPCM0L.MO-SEARCH
     ESCAPE ROUTINE
  END-IF
  RESET XPMOSH0A.MO-ID
  MOVE MPVPCM0L.MO-SEARCH TO XPMOSH0A.MO-SEARCH
  PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
  IF RETURN-CODE EQ 0 AND XPMOSH0A.MO-ID NE 0 THEN
     MOVE XPMOSH0A.MO-ID TO MPVPCM0L.MO-ID
     MOVE XPMOSH0A.MO-CODE TO MPVPCM0L.MO-CODE
     MOVE XPMOSH0A.MO-NAME TO MPVPCM0L.MO-NAME
     MOVE XPMOSH0A.MO-CODE TO MPVPCM0L.MO-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-MT
  IF XPMTSH0A.SH-COMMAND EQ "LOCATE" AND
     MPVPCM0L.MT-SEARCH EQ " " THEN
     RESET MPVPCM0L.MT-ID MPVPCM0L.MT-CODE MPVPCM0L.MT-NAME
     ESCAPE ROUTINE
  END-IF
  RESET MBMTMN0A.MT-ID
  MOVE MPVPCM0L.MT-SEARCH TO XPMTSH0A.MT-SEARCH
  PERFORM XPMTSH0S XXERX00A XXCTXX0A XPMTSH0A MBMTMN0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF MBMTMN0A.MT-ID NE 0 THEN
     MOVE MBMTMN0A.MT-ID TO MPVPCM0L.MT-ID
     MOVE MBMTMN0A.MT-CODE TO MPVPCM0L.MT-CODE
     MOVE MBMTMN0A.MT-NAME TO MPVPCM0L.MT-NAME
     MOVE MBMTMN0A.MT-CODE TO MPVPCM0L.MT-SEARCH
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE SEARCH-ZK
  IF XPZKSH0A.SH-COMMAND EQ "LOCATE" AND
     MPVPCM0L.ZK-SEARCH EQ " " THEN
     RESET MPVPCM0L.ZK-ID MPVPCM0L.ZK-CODE
     ESCAPE ROUTINE
  END-IF
  RESET XPZKSH0A.ZK-ID
  MOVE MPVPCM0L.ZK-SEARCH TO XPZKSH0A.ZK-SEARCH
  PERFORM XPZKSH0S XXERX00A XXCTXX0A XPZKSH0A
  IF RETURN-CODE NE 0 THEN ESCAPE ROUTINE END-IF
  IF XPZKSH0A.ZK-ID NE 0 THEN
     MOVE XPZKSH0A.ZK-ID TO MPVPCM0L.ZK-ID
     MOVE XPZKSH0A.ZK-CODE TO MPVPCM0L.ZK-CODE
     MOVE XPZKSH0A.ZK-CODE TO MPVPCM0L.ZK-SEARCH
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END
