* >Natural Source Header 000000 /*<RO>>
* :NatName MPXXTB0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20061112
* :Time 2017000
* <Natural Source Header /*<<RO>
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING MPXXFN0A
PARAMETER USING MPXXTB0A
/*
LOCAL USING MBTBMN0A
LOCAL USING XXXXEC0L
LOCAL
1 #I    (I4)
1 #J    (I4)
1 #CRYT (I4)
1 #FN   (I4)
1 TM-STRUCTURA
2 MN-TYPE-NABOR (P5)
2 MN-TYPE-REC   (P5)
2 MN-CODE       (P7/1:5) /*¿“–»¡”“
2 MN-ARIFM      (A2) /*¿–»‘Ã≈“»◊≈— »… «Õ¿ 
2 MN-VALUE-P    (P15/1:2)
2 MN-VALUE-A    (A50)
2 MN-LEVEL      (N1)
1 #REP   (L) INIT <FALSE>
END-DEFINE
DEFINE SUBROUTINE MPXXTB0S
RESET ZP-STRUCTURA(*)
/*
FOR #I = 1 TO 20
  IF MPXXTB0A.TB-VALUE-P(#I,1) EQ 0 AND MPXXTB0A.TB-VALUE-P(#I,2) EQ 0 AND
     MPXXTB0A.TB-VALUE-A(#I) EQ " " THEN ESCAPE TOP END-IF
  MOVE MPXXTB0A.TB-CODE(#I) TO MBTBMN0A.TB-CODE
  MOVE 'LOCATE' TO MBTBMN0A.TB-COMMAND
  PERFORM MBTBMN0S XXERX00A MBTBMN0A
  FOR #J = 1 TO 20
     IF MBTBMN0A.MN-TYPE-NABOR(#J) = 0 ESCAPE BOTTOM END-IF
     ADD 1 TO #FN
     IF #FN > 100 THEN
        WRITE 'Œÿ»¡ ¿'
     END-IF
     MOVE BY NAME MBTBMN0A.MN-STRUCTURA(#J) TO MPXXFN0A.ZP-STRUCTURA(#FN)
     MOVE MPXXTB0A.TB-VALUE-P(#I,*) TO MPXXFN0A.MN-VALUE-P(#FN,*)
     MOVE MPXXTB0A.TB-VALUE-A(#I) TO MPXXFN0A.MN-VALUE-A(#FN)
  END-FOR
END-FOR
/*
#J := 1 #I :=0
RESET #FN
/************************************************************
/* —Œ–“»–Œ¬ ¿ ¬€’ŒƒÕŒ√Œ Ã¿——»¬¿
/************************************************************
REPEAT
  ADD 1 TO #FN
  ADD 1 TO #J
  ADD 1 TO #I
  IF MPXXFN0A.MN-TYPE-NABOR(#J) = 0 THEN
     IF #REP = FALSE
        ESCAPE BOTTOM
     END-IF
     #I:= 1 #J:= 2   #REP := FALSE
  END-IF
  IF MPXXFN0A.MN-TYPE-NABOR(#I) > MPXXFN0A.MN-TYPE-NABOR(#J)
     MOVE BY NAME MPXXFN0A.ZP-STRUCTURA(#J) TO TM-STRUCTURA
     MOVE BY NAME MPXXFN0A.ZP-STRUCTURA(#I) TO MPXXFN0A.ZP-STRUCTURA(#J)
     MOVE BY NAME TM-STRUCTURA     TO MPXXFN0A.ZP-STRUCTURA(#I)
     #REP := TRUE
  ELSE
     IF MPXXFN0A.MN-TYPE-NABOR(#I) = MPXXFN0A.MN-TYPE-NABOR(#J) AND
        MPXXFN0A.MN-TYPE-REC(#I) > MPXXFN0A.MN-TYPE-REC(#J)
        MOVE BY NAME MPXXFN0A.ZP-STRUCTURA(#J) TO TM-STRUCTURA
        MOVE BY NAME MPXXFN0A.ZP-STRUCTURA(#I) TO MPXXFN0A.ZP-STRUCTURA(#J)
        MOVE BY NAME TM-STRUCTURA     TO MPXXFN0A.ZP-STRUCTURA(#I)
        #REP := TRUE
     END-IF
  END-IF
END-REPEAT
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END


