* >Natural Source Header 000000 /*<RO>>
* :NatName MTDMSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060611
* :Time 1519000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPDMSH0A
END-DEFINE
SH-COMMAND := "LOCATE"
MT-OG-ID := 1000
DM-SEARCH := "1"
PERFORM XPDMSH0S XXERX00A XXCTXX0A XPDMSH0A
* PRINT XXERX00A
PRINT XPDMSH0A
END
