* >Natural Source Header 000000 /*<RO>>
* :NatName MTDPSH0P
* :UID PAUL
* :Mode S
* :CP
* :Date 20070624
* :Time 1504000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPDPSH0A
END-DEFINE
SH-COMMAND := "SELECT"
DP-CODE := 15
/*DP-SEARCH := '15'
OG-ID := 1000
PERFORM XPDPSH0S XXERX00A XXCTXX0A XPDPSH0A
* PRINT XXERX00A
PRINT XPDPSH0A
WRITE '=' DP-CODE '=' DP-ID
END
