* >Natural Source Header 000000 /*<RO>>
* :NatName MTEISH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060619
* :Time 1020000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPEISH0A
END-DEFINE
SH-COMMAND := "LOCATE"
EI-SEARCH := 'ив'
MT-OG-ID := 1000
PERFORM XPEISH0S XXERX00A XXCTXX0A XPEISH0A
WRITE RETURN-CODE ERROR-NUMBER
PRINT RETURN-CODE ERROR-NUMBER XPEISH0A
END
