* >Natural Source Header 000000 /*<RO>>
* :NatName MTGMSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060613
* :Time 1301000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPGMSH0A
END-DEFINE
SH-COMMAND := "SELECT"
GM-OG-ID := 1000
MT-OG-ID := 1000
GM-SEARCH := "1"
PERFORM XPGMSH0S XXERX00A XXCTXX0A XPGMSH0A
* PRINT XXERX00A
PRINT RETURN-CODE ERROR-NUMBER XPGMSH0A
END
