* >Natural Source Header 000000 /*<RO>>
* :NatName MTLKMN0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060622
* :Time 2343000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING MELKHM0A
LOCAL USING UXCSXX0A
LOCAL USING UETXMN0A
LOCAL
1 #I (I4)
1 #TEST-FAIL  (I2)
1 #TEST-PASS  (I2)
1 #TESTNAME   (A70)
1 #LK-ID      (P15)
1 #NUMBER     (N5)
END-DEFINE
/*
TX-NOT-MANAGED := TRUE
IS-OP-DEBUG := TRUE
/*
MOVE 200 TO XXCTXX0A.OD-ID
/*
MOVE 1000 TO XXCTXX0A.MT-OG-ID
MOVE 1000 TO XXCTXX0A.OG-ID
/*
#TESTNAME := 'OPEN TRANSACTION'
ADD 1 TO #TEST-PASS
UETXMN0A.TX-USER := *USER
UETXMN0A.ME-COMMAND := 'OPEN'
PERFORM UETXMN0S XXERX00A XXCTXX0A UETXMN0A
IF RETURN-CODE NE 0 THEN PERFORM DUMP-ERROR END-IF
/*
#TESTNAME := 'ADD À« '
ADD 1 TO #TEST-PASS
MOVE '123' TO LK-NUMBER
MOVE *DATX TO LK-DATE
MOVE *DATX TO LK-DT-START
LK-DT-STOP := *DATX + 10
MOVE 23.1234 TO LK-COL
MOVE 45.46 TO LK-CENA
MOVE ' ŒÃÃ≈Õ“¿–»…' TO LK-PRIM
MOVE 1 TO EI-CODE
MOVE '0020401234' TO MT-CODE
MOVE '2511' TO ZK-CODE
MOVE 100 TO DP-CODE
MOVE 'SET' TO MELKHM0A.ME-COMMAND
PERFORM MELKHM0S XXERX00A XXCTXX0A MELKHM0A UXCSXX0A
IF RETURN-CODE NE 0 THEN PERFORM DUMP-ERROR END-IF
MOVE MELKHM0A.LK-ID TO #LK-ID
/*
#TESTNAME := 'ADD EQUIVALENT À« '
ADD 1 TO #TEST-PASS
RESET MELKHM0A.LK-ID
MOVE '123' TO LK-NUMBER
MOVE *DATX TO LK-DATE
MOVE 4567.56 TO LK-CENA
MOVE 'SET' TO MELKHM0A.ME-COMMAND
PERFORM MELKHM0S XXERX00A XXCTXX0A MELKHM0A UXCSXX0A
IF RETURN-CODE NE 0 THEN PERFORM DUMP-ERROR END-IF
/*
#TESTNAME := 'READ À« '
ADD 1 TO #TEST-PASS
RESET MELKHM0A
MOVE #LK-ID TO MELKHM0A.LK-ID
MOVE 'READ' TO MELKHM0A.ME-COMMAND
PERFORM MELKHM0S XXERX00A XXCTXX0A MELKHM0A UXCSXX0A
IF RETURN-CODE NE 0 THEN PERFORM DUMP-ERROR END-IF
/*
IF LK-CENA NE 4567.56 THEN
  ADD 1 TO #TEST-FAIL
  WRITE 'Œÿ»¡ ¿ “≈—“' #TEST-PASS #TESTNAME
  WRITE ' - Õ≈—Œ¬œ¿ƒ¿≈“ —Œ’–¿Õ≈ÕÕ¿ﬂ —”ÃÃ¿'
END-IF
/*
IS-OP-DEBUG := FALSE
ST. SETTIME
FOR #NUMBER = 2 TO 100
  COMPRESS 'ADD À« ' #NUMBER INTO #TESTNAME
  ADD 1 TO #TEST-PASS
  RESET MELKHM0A
  MOVE #NUMBER TO LK-NUMBER
  MOVE *DATX TO LK-DATE
  MOVE *DATX TO LK-DT-START
  LK-DT-STOP := *DATX + 10
  MOVE 23.1234 TO LK-COL
  MOVE 45.46 TO LK-CENA
  MOVE ' ŒÃÃ≈Õ“¿–»…' TO LK-PRIM
  MOVE 1 TO EI-CODE
  MOVE '0020401234' TO MT-CODE
  MOVE '2511' TO ZK-CODE
  MOVE 101 TO DP-CODE
  MOVE 'SET' TO MELKHM0A.ME-COMMAND
  PERFORM MELKHM0S XXERX00A XXCTXX0A MELKHM0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN PERFORM DUMP-ERROR END-IF
END-FOR
WRITE 10X 'ELAPSED TIME TO ADD 100 LZK'
          '(HH:SS:SS.T) :' *TIMD (ST.) (EM=99:99:99'.'9)
/*
/* WRITE MELKhm0A.LK-ID LK-NUMBER LK-DATE /
/* LK-DT-START LK-DT-STOP LK-COL LK-CENA LK-PRIM /
/* EI-ID EI-CODE /
/* MT-ID MT-CODE /
/* ZK-ID ZK-CODE /
/* PO-ID PO-CODE
/*
#TESTNAME := 'COMMIT TRANSACTION'
ADD 1 TO #TEST-PASS
UETXMN0A.ME-COMMAND := 'COMMIT'
PERFORM UETXMN0S XXERX00A XXCTXX0A UETXMN0A
IF RETURN-CODE NE 0 THEN PERFORM DUMP-ERROR END-IF
/*
BACKOUT TRANSACTION
WRITE '¬—≈√Œ “≈—“Œ¬' #TEST-PASS 'Œÿ»¡Œ◊Õ€’' #TEST-FAIL
DEFINE SUBROUTINE DUMP-ERROR
  ADD 1 TO #TEST-FAIL
  WRITE 'Œÿ»¡ ¿ “≈—“' #TEST-PASS #TESTNAME
  PERFORM XPERVW0S XXERX00A
/*  PRINT RETURN-CODE ERROR-ADDITION(1) ERROR-ADDITION(2)
/*  WRITE ERROR-MODULE ERROR-LINE ERROR-NUMBER /
/*        ERROR-STACK-MODULE(1) ERROR-STACK-LINE(1) /
/*        ERROR-STACK-MODULE(2) ERROR-STACK-LINE(2) /
/*        ERROR-STACK-MODULE(3) ERROR-STACK-LINE(3) /
/*        ERROR-STACK-MODULE(4) ERROR-STACK-LINE(4) /
/*        ERROR-STACK-MODULE(5) ERROR-STACK-LINE(5)
END-SUBROUTINE
END
