* >Natural Source Header 000000 /*<RO>>
* :NatName MTMOSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060508
* :Time 1826000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPMOSH0A
END-DEFINE
SH-COMMAND := 'LOCATE'
MO-CODE := 15
MO-SEARCH := '15'
MO-OG-ID := 1000
PERFORM XPMOSH0S XXERX00A XXCTXX0A XPMOSH0A
* PRINT XXERX00A
PRINT XPMOSH0A
WRITE '=' MO-CODE '=' MO-ID

END
