* >Natural Source Header 000000 /*<RO>>
* :NatName MTNDSH0P
* :UID PAUL
* :Mode S
* :CP
* :Date 20070110
* :Time 1943000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPNDSH0A
END-DEFINE
SH-COMMAND := "LOCATE"
ND-SEARCH := "1"
MT-OG-ID := 1000
PERFORM XPNDSH0S XXERX00A XXCTXX0A XPNDSH0A
* PRINT XXERX00A
PRINT XPNDSH0A
ND-SEARCH := "0"
PERFORM XPNDSH0S XXERX00A XXCTXX0A XPNDSH0A
PRINT XPNDSH0A
END
