* >Natural Source Header 000000 /*<RO>>
* :NatName MTSASH0P
* :UID OLEG
* :Mode S
* :CP
* :Date 20070110
* :Time 1140000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XPMXXX0A
LOCAL USING XXCTXX0A
LOCAL USING UDOPMN0L
LOCAL USING MMSASH0A
END-DEFINE
XXCTXX0A.OG-ID := 1000
XXCTXX0A.MO-OG-ID := 1000
XXCTXX0A.MT-OG-ID := 1000
XXCTXX0A.GM-OG-ID := 1000

MMSASH0A.OP-ID := 300
/*
MMSASH0A.IT-ID(1) := 121
MMSASH0A.IT-ID(2) := 122
MMSASH0A.IT-ID(3) := 123
MMSASH0A.IT-ID(4) := 124
MMSASH0A.IT-ID(5) := 125

MMSASH0A.SA-DT-ATTR-ID := 902
MMSASH0A.SA-COMMAND := 'NEW'
PERFORM MMSASH0S XXERX00A XXCTXX0A MMSASH0A
/*
/*IF BO-COMMAND-PROCESS NE ' '
/*  WRITE '«¿œ”— ¿≈“—ﬂ ‘Œ–Ã¿“»–Œ¬¿Õ»≈ ƒ»— ¿ —: ' (CD=PI)
/*END-IF

  IF RETURN-CODE < 0 THEN
     PERFORM XPERVW0S XXERX00A
  END-IF


ESCAPE ROUTINE
 READ UR-ACC-OP-VIEW
  WRITE '=' AT-ATTR-ID(*)
  WRITE '=' AT-VALUE(*)
 END-READ

ESCAPE ROUTINE


END
