* >Natural Source Header 000000 /*<RO>>
* :NatName MTSOSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060925
* :Time 1728000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XPMXXX0A
LOCAL USING XXCTXX0A
LOCAL USING UDOPMN0L
LOCAL USING MMSOSH0A
END-DEFINE
XXCTXX0A.OG-ID := 1000
XXCTXX0A.MO-OG-ID := 1000
XXCTXX0A.MT-OG-ID := 1000
XXCTXX0A.GM-OG-ID := 1000

MMSOSH0A.OP-ID := 200
/*
MMSOSH0A.IT-ID(1) := 101
MMSOSH0A.IT-ID(2) := 105
MMSOSH0A.SA-DT-ATTR-ID := 902
MMSOSH0A.SO-COMMAND := 'NEW'
PERFORM MMSOSH0S XXERX00A XXCTXX0A MMSOSH0A
/*
IF BO-COMMAND-PROCESS NE ' '
  WRITE '«¿œ”— ¿≈“—ﬂ ‘Œ–Ã¿“»–Œ¬¿Õ»≈ ƒ»— ¿ —: ' (CD=PI)
END-IF

  IF RETURN-CODE < 0 THEN
     PERFORM XPERVW0S XXERX00A
  END-IF


ESCAPE ROUTINE
 READ UR-ACC-OP-VIEW
  WRITE '=' AT-ATTR-ID(*)
  WRITE '=' AT-VALUE(*)
 END-READ

ESCAPE ROUTINE


END
