* >Natural Source Header 000000 /*<RO>>
* :NatName MTSOSH1P
* :UID ¿‰ÏËÌËÒÚ
* :Mode S
* :CP
* :Date 20070110
* :Time 2309000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XPMXXX0A
LOCAL USING XXCTXX0A
LOCAL USING UDOPMN0L
LOCAL USING MMSOSH0A
LOCAL USING MPSKSH0A
LOCAL USING MXITAT0L
END-DEFINE
XXCTXX0A.OG-ID := 1000
XXCTXX0A.MO-OG-ID := 1000
XXCTXX0A.MT-OG-ID := 1000
XXCTXX0A.GM-OG-ID := 1000

MMSOSH0A.OP-ID := 200
/*
MMSOSH0A.IT-ID(1) := 121
MMSOSH0A.IT-ID(2) := 122
MMSOSH0A.IT-ID(3) := 123
MMSOSH0A.IT-ID(4) := 124
MMSOSH0A.IT-ID(5) := 125
MMSOSH0A.SA-DT-ATTR-ID := 902
MMSOSH0A.SO-COMMAND := 'NEW'

/*.
MPSKSH0A.CL-ID := 2000
* IT-ID
*
MPSKSH0A.MD-IT-ID(1) := 101
MPSKSH0A.SK-COMMAND := 'NEW'
/*
PERFORM MMSOSH0S XXERX00A XXCTXX0A MMSOSH0A MPSKSH0A
/*
IF BO-COMMAND-PROCESS NE ' '
/*  WRITE '«¿œ”— ¿≈“—ﬂ ‘Œ–Ã¿“»–Œ¬¿Õ»≈ ƒ»— ¿ —: ' (CD=PI)
IGNORE
END-IF

  IF RETURN-CODE < 0 THEN
     PERFORM XPERVW0S XXERX00A
  END-IF


ESCAPE ROUTINE
 READ UR-ACC-OP-VIEW
  WRITE '=' AT-ATTR-ID(*)
  WRITE '=' AT-VALUE(*)
 END-READ

ESCAPE ROUTINE


END
