* >Natural Source Header 000000 /*<RO>>
* :NatName MTZKSH0P
* :UID PAUL
* :Mode S
* :CP
* :Date 20061101
* :Time 1613000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XPMXXX0A
LOCAL USING XXCTXX0A
LOCAL USING UDOPMN0L
LOCAL USING MMSASH0A
END-DEFINE
XXCTXX0A.OG-ID := 1000
XXCTXX0A.MO-OG-ID := 1000
XXCTXX0A.MT-OG-ID := 1000
XXCTXX0A.GM-OG-ID := 1000

MMSASH0A.OP-ID := 300
/*
MMSASH0A.IT-ID(1) := 101
MMSASH0A.IT-ID(2) := 105
MMSASH0A.IT-ID(3) := 104
MMSASH0A.IT-ID(4) := 103
MMSASH0A.SA-DT-ATTR-ID := 902
MMSASH0A.SA-COMMAND := 'NEW'
PERFORM MMSASH0S XXERX00A XXCTXX0A MMSASH0A
/*
IF BO-COMMAND-PROCESS NE ' '
  WRITE '«¿œ”— ¿≈“—ﬂ ‘Œ–Ã¿“»–Œ¬¿Õ»≈ ƒ»— ¿ —: ' (CD=PI)
END-IF

  IF RETURN-CODE < 0 THEN
     PERFORM XPERVW0S XXERX00A
  END-IF


ESCAPE ROUTINE
 READ UR-ACC-OP-VIEW
  WRITE '=' AT-ATTR-ID(*)
  WRITE '=' AT-VALUE(*)
 END-READ

ESCAPE ROUTINE


END
