* >Natural Source Header 000000 /*<RO>>
* :NatName READDR2P
* :UID ARMK02
* :Mode S
* :CP
* :Date 20070212
* :Time 1916000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
/*LOCAL USING CXUSCT0A
/*LOCAL USING CXCLCT0A
LOCAL USING XXCTXX0A
LOCAL USING UDDRLS0L
LOCAL USING UXCSXX0A
/*
LOCAL USING MEPHMN0A
LOCAL USING MEPMMN0A
LOCAL USING MEPMLS0A
LOCAL USING MBPRMN0A
/*
LOCAL USING UETXMN0A
LOCAL USING MBMZMN0A
LOCAL USING XXXXEC0L
LOCAL USING XPPBXX0A
LOCAL USING DOCUMENT
LOCAL
1 #FOUND   (L)
1 #I       (I4)
1 #J       (I4)
1 #DVL     (I4)
1 #CURRENT (I4)
1 #COUNT   (I4)
1 #TX-COUNT (I4)
1 #TXC     (I4)
1 #NUMBER-A (A6)
1 REDEFINE #NUMBER-A
2 #NUMBER-N (N6)
1 #DT07-START (D)
1 #DT07-STOP  (D)
1 #DT06-START (D)
1 #DT06-STOP  (D)
1 #DT-START   (D)
1 #DT-STOP    (D)
1 #LOG
2 NUMB        (A6)
2 DATE        (A8)
2 DESCR       (A20)
2 MT-CODE     (A22)
2 COL         (P8.7)
2 SUMMA       (P13.2)
END-DEFINE
US-MO-ID := 0
OG-ID := 1000
VO-OG-ID := 1000
MO-OG-ID := 1000
MT-OG-ID := 1000
GM-OG-ID := 1000
XXCTXX0A.IS-OP-DEBUG := FALSE
XXCTXX0A.IS-OP-CALC-DEBUG := FALSE
MOVE EDITED "20060101" TO #DT06-START  (EM=YYYYMMDD)
MOVE EDITED "20061231" TO #DT06-STOP   (EM=YYYYMMDD)
MOVE EDITED "20070101" TO #DT07-START  (EM=YYYYMMDD)
MOVE EDITED "20071231" TO #DT07-STOP   (EM=YYYYMMDD)
MOVE EDITED "20061201" TO #DT-START    (EM=YYYYMMDD)
MOVE EDITED "20061231" TO #DT-STOP     (EM=YYYYMMDD)
READ UR-DOC-DATA-LIST IN PHYSICAL SEQUENCE
  ACCEPT  UR-DOC-DATA-LIST.DR-TX-STATUS EQ "N" AND
          UR-DOC-DATA-LIST.OD-ID NE 0
  IF UR-DOC-DATA-LIST.DR-TYPE-ID EQ 1001 THEN
/*     WRITE UR-DOC-DATA-LIST.DR-TYPE-ID UR-DOC-DATA-LIST.OD-ID
/*           UR-DOC-DATA-LIST.DR-SORT
     WRITE WORK FILE 1 UR-DOC-DATA-LIST.OD-ID UR-DOC-DATA-LIST.DR-ID
     ADD 1 TO #COUNT
  END-IF
END-READ
INCLUDE XPPBIN0C "#COUNT" '"Œ·ÌÓ‚ÎÂÌËÂ Ô‡ÚËÈ"'
READ WORK FILE 1 UR-DOC-DATA-LIST.OD-ID UR-DOC-DATA-LIST.DR-ID
  ADD 1 TO #CURRENT
  INCLUDE XPPBST0C "#CURRENT"
  PERFORM SET-PARTY
  ADD 1 TO #TX-COUNT
  IF #TX-COUNT > 100 THEN RESET #TX-COUNT END TRANSACTION END-IF
END-WORK
END TRANSACTION
CLOSE WORK FILE 7
/*
DEFINE SUBROUTINE SET-PARTY
/*
RESET MEPHMN0A
MEPHMN0A.PO-ID := UR-DOC-DATA-LIST.DR-ID
MEPHMN0A.ME-COMMAND := 'READ'
PERFORM MEPHMN0S XXERX00A XXCTXX0A MEPHMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
IF NOT MEPHMN0A.IS-DC-CONFIRMED THEN ESCAPE ROUTINE END-IF
/* ◊ËÚ‡ÂÏ Á‡ÔËÒË Ï‡ÚÂË‡ÎÓ‚
MEPMLS0A.PO-ID := UR-DOC-DATA-LIST.DR-ID
MEPMLS0A.ME-COMMAND := "TOP"
MEPMLS0A.DR-LIST-READ := 15
PERFORM MEPMLS0S XXERX00A XXCTXX0A MEPMLS0A UXCSXX0A
IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/*
IF MEPHMN0A.PO-DATE < #DT-START OR MEPHMN0A.PO-DATE > #DT-STOP THEN
  ESCAPE ROUTINE
END-IF
IF MEPMLS0A.DT-COL-RECORD EQ 0 THEN ESCAPE ROUTINE END-IF
/*
MOVE MEPHMN0A.PO-NUMBER TO #NUMBER-A
IF MEPHMN0A.PO-DATE EQ #DT06-START THRU #DT06-STOP
  FIND DOCUMENT WITH ND-F EQ #NUMBER-N
  AND DT-F EQ 20060101 THRU 20061231 AND TY-F = 'PO'
     IF NO RECORD FOUND
        RESET #LOG
        MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
        MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
        MOVE "Õ≈“ ƒŒ ”Ã≈Õ“¿" TO #LOG.DESCR
        WRITE WORK FILE 7 #LOG
        ESCAPE ROUTINE
     END-NOREC
  END-FIND
ELSE IF MEPHMN0A.PO-DATE EQ #DT07-START THRU #DT07-STOP THEN
  FIND DOCUMENT WITH ND-F EQ #NUMBER-N
  AND DT-F EQ 20070101 THRU 20071231 AND TY-F = 'PO'
     IF NO RECORD FOUND
        RESET #LOG
        MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
        MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
        MOVE "Õ≈“ ƒŒ ”Ã≈Õ“¿" TO #LOG.DESCR
        WRITE WORK FILE 7 #LOG
        ESCAPE ROUTINE
     END-NOREC
  END-FIND
ELSE
  ESCAPE ROUTINE
END-IF END-IF
IF MEPHMN0A.MO-CODE NE DOCUMENT.OP-F THEN
   RESET #LOG
   MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
   MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
   MOVE "–¿«Õ€≈ Ã¿“.Œ“¬" TO #LOG.DESCR
   WRITE WORK FILE 7 #LOG
   ESCAPE ROUTINE
END-IF
IF MEPHMN0A.VO-CODE NE DOCUMENT.PL-F THEN
   RESET #LOG
   MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
   MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
   MOVE "–¿«Õ€≈ Œ–√¿Õ»«¿÷»»" TO #LOG.DESCR
   WRITE WORK FILE 7 #LOG
   ESCAPE ROUTINE
END-IF
/*WRITE ND-F DT-F
/*
MEPMLS0A.ME-COMMAND  := "TOP"
REPEAT
   PERFORM MEPMLS0S XXERX00A XXCTXX0A MEPMLS0A UXCSXX0A
   IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
   MEPMLS0A.ME-COMMAND  := "NEXT"
   FOR #I = 1 TO MEPMLS0A.DR-LIST-C
      MEPMMN0A.PM-ID := MEPMLS0A.PM-ID(#I)
      MEPMMN0A.ME-COMMAND := "READ"
      PERFORM MEPMMN0S XXERX00A XXCTXX0A MEPMMN0A UXCSXX0A
      IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
*     WRITE MEPHMN0A.PO-ID MEPHMN0A.PO-NUMBER MEPHMN0A.PO-DATE
*           MEPMMN0A.MT-CODE
      RESET #FOUND
      FOR #J = 1 TO C*ST-F
        IF MEPMMN0A.MT-CODE EQ KM-F(#J) AND
           KL-F(#J) EQ MEPMMN0A.DR-COL  /* AND
/*           SUMM_OST(#J) EQ MEPMMN0A.DR-CENA-SUMMA THEN
*          WRITE 'FOUND' #I NUM_ZAP #J
           MOVE MEPMMN0A.PR-ID TO MBPRMN0A.PR-ID
           MOVE "READ" TO MBPRMN0A.BL-COMMAND
           PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
           IF RETURN-CODE EQ 0 THEN
              IF MBPRMN0A.PR-ASUM-INT-NUM EQ 0 THEN
*                WRITE "UPDATE"
                 MOVE NUM_ZAP TO MBPRMN0A.PR-ASUM-INT-NUM
                 MOVE #J TO MBPRMN0A.PR-ASUM-LINE
                 MOVE "UPDATE" TO MBPRMN0A.BL-COMMAND
                 PERFORM MBPRMN0S XXERX00A XXCTXX0A MBPRMN0A
IF RETURN-CODE = -2 AND ERROR-NUMBER = 3198
        RESET #LOG
        MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
        MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
        MOVE "œAPT»» ƒ”¡À»P”ﬁTCﬂ" TO #LOG.DESCR
        MOVE MEPMMN0A.MT-CODE TO #LOG.MT-CODE
        MOVE MEPMMN0A.DR-COL TO #LOG.COL
        MOVE MEPMMN0A.DR-CENA-SUMMA TO #LOG.SUMMA
        WRITE WORK FILE 7 #LOG
RESET XXERX00A
END-IF
              ELSE
*                WRITE "SKIP"
                 IF MBPRMN0A.PR-ASUM-INT-NUM NE NUM_ZAP THEN
        RESET #LOG
        MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
        MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
        MOVE "œ¿–“»» Õ≈ —ŒŒ“¬≈“—“¬”ﬁ“" TO #LOG.DESCR
        MOVE MEPMMN0A.MT-CODE TO #LOG.MT-CODE
        MOVE MEPMMN0A.DR-COL TO #LOG.COL
        MOVE MEPMMN0A.DR-CENA-SUMMA TO #LOG.SUMMA
        WRITE WORK FILE 7 #LOG
                 END-IF
              END-IF
           END-IF
           IF RETURN-CODE NE 0 THEN
               PERFORM XPERVW0S XXERX00A
           END-IF
           #FOUND := TRUE
           ESCAPE BOTTOM
        END-IF
      END-FOR
      IF NOT #FOUND THEN
        RESET #LOG
        MOVE MEPHMN0A.PO-NUMBER TO #LOG.NUMB
        MOVE EDITED MEPHMN0A.PO-DATE(EM=YYYYMMDD) TO #LOG.DATE
        MOVE "Õ≈“ Ã¿“≈–»¿À¿" TO #LOG.DESCR
        MOVE MEPMMN0A.MT-CODE TO #LOG.MT-CODE
        MOVE MEPMMN0A.DR-COL TO #LOG.COL
        MOVE MEPMMN0A.DR-CENA-SUMMA TO #LOG.SUMMA
        WRITE WORK FILE 7 #LOG
      END-IF
   END-FOR
UNTIL MEPMLS0A.IS-BOTTOM
END-REPEAT
/*
END-SUBROUTINE
/*
DEFINE SUBROUTINE ERROR-RECOVER
  PERFORM XPERVW0S XXERX00A
END-SUBROUTINE
/*
INCLUDE XXERSY2C
END
