* >Natural Source Header 000000 /*<RO>>
* :NatName SETSTEPL
* :UID KZTA01
* :Mode R
* :CP
* :Date 20070206
* :Time 1109000
* <Natural Source Header /*<<RO>
END
