* >Natural Source Header 000000 /*<RO>>
* :NatName TEST2
* :UID ARMK01
* :Mode S
* :CP
* :Date 20060614
* :Time 1105000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING MPDCSH0A
END-DEFINE
MO-OG-ID := 1000
/*MPDCSH0A.BL-COMMAND := "SELECT"
MPDCSH0A.DD-ID := 1001
MPDCSH0A.DC-NUMBER-ATTR-ID := 10000
MPDCSH0A.DC-DATE-ATTR-ID := 10001
MPDCSH0A.DC-MO-ATTR-ID := 30003
MPDCSH0A.DC-KOR-VO-ATTR-ID := 20002
MPDCSH0A.DR-ATTR-ID(1) := 10021
MPDCSH0A.DR-VALUE(1) := 1
PERFORM MPDCSH0S XXERX00A XXCTXX0A MPDCSH0A
IF RETURN-CODE NE 0 THEN
  PERFORM XPERVW0S XXERX00A
END-IF
END
