* >Natural Source Header 000000 /*<RO>>
* :NatName TEST
* :UID OLEG
* :Mode S
* :CP
* :Date 20061023
* :Time 1745000
* <Natural Source Header /*<<RO>
DEFINE DATA LOCAL
1 #A (A5/1:4)
1 #S  (I2)
1 #B4  (B4)
1 REDEFINE #B4
  2 #N4 (N4)
  2 REDEFINE #N4
     3 #A4 (A4)
1 #STR (A14)
1 REDEFINE #STR
  2 #A10 (A10)
  2 #P7  (P7)
1 #STR1 (A14/1:10)
1 REDEFINE #STR1
  2 STRUCT  (1:10)
  3 #A101 (A10)
  3 #P71  (P7)
1 #B  (B4)
END-DEFINE

MOVE 1 TO #B
RESET #B


MOVE 'AAA' TO #A101(1)
MOVE 112 TO #P71(1)
MOVE 'BBB' TO #A101(2)
MOVE 113 TO #P71(2)
MOVE 'CCC' TO #A101(3)
MOVE 114 TO #P71(3)

MOVE 'CCC' TO #A10
MOVE 114 TO #P7

EXAMINE #STR1(*) FOR #STR GIVING INDEX #S
WRITE '=' #S
ESCAPE ROUTINE
MOVE 10 TO #B4


MOVE 111 TO #A(1)
MOVE 112 TO #A(2)
MOVE 113 TO #A(3)
EXAMINE #A(*) FOR '111' GIVING INDEX #S

WRITE #S

END

