* >Natural Source Header 000000 /*<RO>>
* :NatName TESTTBL
* :UID INTECO
* :Mode S
* :CP
* :Date 20060720
* :Time 1917000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL
1 #CODETBL (A2/1:11) INIT <
'ÀA',
'ÂB',
'ÅE',
'ÊK',
'ÌM',
'ÍH',
'ÎO',
'ÐP',
'ÑC',
'ÒT',
'ÕX' >
1 REDEFINE #CODETBL
2 #CODETBL-B (B2/1:11)
END-DEFINE
WRITE #CODETBL-B(*)
END



