* >Natural Source Header 000000 /*<RO>>
* :NatName TEST-FN
* :UID PAUL
* :Mode S
* :CP
* :Date 20061109
* :Time 2143000
* <Natural Source Header /*<<RO>
DEFINE DATA LOCAL USING XXERX00A
LOCAL USING XPMXXX0A
LOCAL USING XXCTXX0A
LOCAL USING MPOSSH0A
LOCAL USING XXXXEC0L
END-DEFINE



XXCTXX0A.VO-OG-ID := 1000
XXCTXX0A.MO-OG-ID := 1000
XXCTXX0A.MT-OG-ID := 1000
/*XXCTXX0A.ZK-OG-ID := 1000
OS-COMMAND := 'NEW'
PERFORM MPOSSH0S XXERX00A XXCTXX0A MPOSSH0A
  IF RETURN-CODE < 0 THEN
     PERFORM XPERVW0S XXERX00A
  END-IF


END
