* >Natural Source Header 000000 /*<RO>>
* :NatName TEST3P
* :UID ARMK02
* :Mode S
* :CP
* :Date 20060704
* :Time 1539000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING MBLKEX0L
LOCAL
1 #TEST1(N8.3)
1 #TEST2(N8.7)
END-DEFINE
CLOSE WORK FILE 7
READ WORK FILE 7 MBLKEX0L
  WRITE NOMLZK NOM MBLKEX0L.KOL
/*#TEST1 := VAL(MBLKEX0L.KOL)
/*WRITE
   MBLKEX0L.NORIZ
/**F MBLKEX0L.NORIZ IS (N8.7) THEN WRITE 'TEST' END-IF
/*#TEST2 := VAL(MBLKEX0L.NORIZ)
/*WRITE '>' #TEST1 '<>' #TEST2  '<'
END-WORK
END
