* >Natural Source Header 000000 /*<RO>>
* :NatName TTT
* :UID NAT003
* :Mode S
* :CP
* :Date 20110723
* :Time 0906000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING UDOPTX0L
LOCAL
1 #I             (I4)
1 TTT(T)
1 RDT(N8)
END-DEFINE
READ UR-ACC-OP-TX-VIEW BY ISN
  ADD 1 TO #I
  IF #I = 2500000  WRITE *ISN  ESCAPE BOTTOM  END-IF
END-READ
END
