* >Natural Source Header 000000 /*<RO>>
* :NatName TTT2
* :UID NAT003
* :Mode R
* :CP
* :Date 20110723
* :Time 0919000
* <Natural Source Header /*<<RO>
READ TIZ-ARX-FILE BY ISN
  ADD 1 TO #I(I4)
  IF #I = 15000  DO WRITE *ISN ESCAPE  DOEND
LOOP   .
