* >Natural Source Header 000000 /*<RO>>
* :NatName UBDRCO0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060525
* :Time 2019000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿: XETXMN0S
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: –¿—◊»“¿“‹ «¿œ»—‹ ƒŒ ”Ã≈Õ“¿
/*  - CALC
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING UBDRCO0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBDRCS0A
LOCAL USING UBDRUP0A
LOCAL USING UBDRMN0A
LOCAL USING UBODOC0A
LOCAL USING UBDDMN0A
END-DEFINE
DEFINE SUBROUTINE UBDRCO0S
/*
DECIDE ON FIRST VALUE UBDRCO0A.BL-COMMAND
VALUE 'CALC'
  PERFORM RECORD-CALC
NONE VALUE
  MOVE UBDRCO0A.BL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-CALC
/* «¿œŒÀÕﬂ≈Ã «¿œ»—» ƒŒ ”Ã≈Õ“¿
  MOVE UBDRCO0A.DD-ID TO UBDDMN0A.DD-ID
  MOVE UBDRCO0A.DD-ID TO UBDRMN0A.DR-TYPE-ID
  MOVE UBDRCO0A.DR-ID TO UBDRMN0A.DR-ID
  REPEAT
     /* ◊»“¿≈Ã Œœ»—¿“≈À‹ «¿œ»—»
     MOVE 'READ' TO UBDDMN0A.BL-COMMAND
     PERFORM UBDDMN0S XXERX00A UBDDMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     IF UBDRCO0A.DD-ID EQ UBDDMN0A.DD-ID THEN
        MOVE BY NAME UBDDMN0A TO UBDRCS0A
     END-IF
     /* ◊»“¿≈Ã «¿œ»—‹
     MOVE 'READ' TO UBDRMN0A.BL-COMMAND
     PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     MOVE BY NAME UBDRMN0A TO UBDRUP0A.DR-LIST(UBDDMN0A-DD-LEVEL)
     /*
     MOVE UBDDMN0A.DD-UP-ID TO UBDDMN0A.DD-ID
     MOVE UBDDMN0A.DD-UP-ID TO UBDRMN0A.DR-TYPE-ID
     MOVE UBDRMN0A.DR-UP-ID TO UBDRMN0A.DR-ID
     /*
     UNTIL UBDDMN0A.DD-LEVEL EQ 1
  END-REPEAT
/* ◊»“¿≈Ã Œœ»—¿“≈À‹ Œœ≈–¿÷»»
  MOVE UBDRCO0A.OD-ID TO UBODOC0A.OD-ID
  MOVE UBDRCO0A.DD-ID TO UBODOC0A.DD-ID
  MOVE 'READ' TO UBODOC0A.BL-COMMAND
  PERFORM UBODOC0S XXERX00A XXCTXX0A UBODOC0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* «¿œ”— ¿≈Ã –¿—◊≈“
  MOVE UBDRCO0A.OD-ID TO UBDRCS0A.OD-ID
  MOVE UBDRCO0A.DR-ID TO UBDRCS0A.DR-ID
  MOVE 'CALC' TO UBDRCS0A.BL-COMMAND
  PERFORM UBDRCS0S XXERX00A XXCTXX0A UBDRCS0A UBDRUP0A UBODOC0A UXCSXX0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
