* >Natural Source Header 000000 /*<RO>>
* :NatName UBDRCC0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20061002
* :Time 1232000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿: XETXMN0S
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: –¿—◊»“¿“‹ œŒ—À≈ƒŒ¬¿“≈À‹ÕŒ  ŒÕ“≈…Õ≈– — «¿œ»—ﬂÃ»
/*  - CALC
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING UBDRCC0A
PARAMETER USING UBDRUP0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UBODOC0A
LOCAL USING UBDRMN0A
LOCAL USING UBDRCS0A
LOCAL USING UBDDMN0A
LOCAL USING UDDRLS0A
LOCAL
1 #I       (I4)
END-DEFINE
DEFINE SUBROUTINE UBDRCC0S
/*
DECIDE ON FIRST VALUE UBDRCC0A.BL-COMMAND
VALUE 'CALC'
  PERFORM CONTAINER-CALC
NONE VALUE
  MOVE UBDRCC0A.BL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE CONTAINER-CALC
/* ◊»“¿≈Ã Œœ≈–¿÷»ﬁ
MOVE UBDRCC0A.OD-ID TO UBODOC0A.OD-ID
MOVE UBDRCC0A.DD-ID TO UBODOC0A.DD-ID
MOVE 'READ' TO UBODOC0A.BL-COMMAND
PERFORM UBODOC0S XXERX00A XXCTXX0A UBODOC0A UXCSXX0A
IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* ◊»“¿≈Ã Œœ»—¿“≈À‹ «¿œ»—»
MOVE UBDRCC0A.DD-ID TO UBDDMN0A.DD-ID
MOVE 'READ' TO UBDDMN0A.BL-COMMAND
PERFORM UBDDMN0S XXERX00A UBDDMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
/* ¿–√”Ã≈Õ“€ ƒÀﬂ –¿—◊≈“¿ «¿œ»—»
MOVE BY NAME UBDRCC0A TO UBDRCS0A
MOVE BY NAME UBDDMN0A TO UBDRCS0A
MOVE UBDDMN0A.DD-ID TO UBDRMN0A.DR-TYPE-ID
/* ◊»“¿≈Ã  ŒÕ“≈…Õ≈–
MOVE UBDRCC0A.DR-UP-ID TO UDDRLS0A.DR-UP-ID
MOVE UBDRCC0A.DD-ID TO UDDRLS0A.DR-TYPE-ID
MOVE 'TOP' TO UDDRLS0A.DL-COMMAND
MOVE XXCTXX0A.TX-ID TO UDDRLS0A.TX-ID
MOVE 20 TO UDDRLS0A.DR-LIST-C
REPEAT
     PERFORM UDDRLS0S XXERX00A UDDRLS0A
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     UDDRLS0A.DL-COMMAND  := 'NEXT'
     FOR #I = 1 TO UDDRLS0A.DR-LIST-C
        /* ◊»“¿≈Ã «¿œ»—‹
        MOVE UDDRLS0A.DR-ID(#I) TO UBDRMN0A.DR-ID
        MOVE 'READ' TO UBDRMN0A.BL-COMMAND
        PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
        MOVE BY NAME UBDRMN0A TO UBDRUP0A.DR-LIST(UBDDMN0A-DD-LEVEL)
        /* –¿——◊»“€¬¿≈Ã «¿œ»—‹
        MOVE UDDRLS0A.DR-ID(#I) TO UBDRCS0A.DR-ID
        MOVE 'CALC' TO UBDRCS0A.BL-COMMAND
        PERFORM UBDRCS0S XXERX00A XXCTXX0A UBDRCS0A UBDRUP0A UBODOC0A UXCSXX0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     END-FOR
  UNTIL UDDRLS0A.IS-BOTTOM
END-REPEAT
/*
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
