* >Natural Source Header 000000 /*<RO>>
* :NatName UBOPPC0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20061013
* :Time 1901000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ¡»«Õ≈— ”œ¿ Œ¬¿“‹ Œœ≈–¿÷»»
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING UBOPPC0A
PARAMETER USING UXCSXX0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UXXXEC0L
/*LOCAL USING UBCLMN0A
/*LOCAL USING UBITMN0A
LOCAL USING UDOPPC0A
LOCAL USING UDOPMN0A
LOCAL USING UDSAMN0A
LOCAL
1 #I       (I4)
1 #J       (I4)
1 #K       (I4)
1 #L       (I4)
1 #IS-FOUND(L)
1 #FOUND   (I4/1:30)
END-DEFINE
DEFINE SUBROUTINE UBOPPC0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE BL-COMMAND
  VALUE "PACK"
     PERFORM OPER-PACK
  VALUE "GETNUMBER"
     PERFORM OPER-GETNUMBER
  NONE VALUE
     MOVE BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE OPER-GETNUMBER
  MOVE "GETNUMBER" TO UDOPPC0A.DL-COMMAND
  PERFORM UDOPPC0S XXERX00A UDOPPC0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  UBOPPC0A.OP-NUMBER := UDOPPC0A.OP-NUMBER
END-SUBROUTINE
/*
DEFINE SUBROUTINE OPER-PACK
  MOVE "GETLIST" TO UDOPPC0A.DL-COMMAND
  PERFORM UDOPPC0S XXERX00A UDOPPC0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  RESET UBOPPC0A.OP-NUMBER
  FOR #I = 1 TO 20
     IF UDOPPC0A.OP-LIST-ID(#I) EQ 0 THEN ESCAPE BOTTOM END-IF
     MOVE UDOPPC0A.OP-LIST-ID(#I) TO UDOPMN0A.OP-ID
     MOVE 'PACK' TO UDOPMN0A.DL-COMMAND
     PERFORM UDOPMN0S XXERX00A UDOPMN0A
/*     IF RETURN-CODE EQ -2 THEN ESCAPE TOP END-IF
     IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     /* DEBET
     IF UDOPMN0A.IX-ID(1) NE 0 THEN
        RESET UDSAMN0A
        MOVE UDOPMN0A.CL-ID TO UDSAMN0A.CL-ID
        MOVE UDOPMN0A.IT-ID(1) TO UDSAMN0A.IT-ID
        MOVE UDOPMN0A.IT-SALDO-TYPE(1) TO UDSAMN0A.IT-SALDO-TYPE
        MOVE UDOPMN0A.IX-ID(1) TO UDSAMN0A.IX-ID
        MOVE BY NAME UDOPMN0A.AT-MD-G(1,*) TO UDSAMN0A.AT-G(*)
        MOVE 1 TO  UDSAMN0A.SA-MODIF
        IF UDOPMN0A.OP-STATE EQ 'N' THEN
           MOVE 'ADD' TO UDSAMN0A.DL-COMMAND
        ELSE IF UDOPMN0A.OP-STATE EQ 'S' THEN
           MOVE 'SUB' TO UDSAMN0A.DL-COMMAND
        END-IF END-IF
/*        WRITE "IX 1"
/*     FOR #L = 1 TO 30
/*        IF UDSAMN0A.AT-ATTR-ID(#L) EQ 0 THEN ESCAPE BOTTOM END-IF
/*        WRITE UDSAMN0A.AT-ATTR-TYPE(#L) UDSAMN0A.AT-ATTR-ID(#L) UDSAMN0A.AT-VALUE(#L)
/*     END-FOR
        PERFORM UDSAMN0S XXERX00A UDSAMN0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     END-IF
     /* CREDIT
     IF UDOPMN0A.IX-ID(2) NE 0 THEN
        RESET UDSAMN0A
        MOVE UDOPMN0A.CL-ID TO UDSAMN0A.CL-ID
        MOVE UDOPMN0A.IT-ID(2) TO UDSAMN0A.IT-ID
        MOVE UDOPMN0A.IT-SALDO-TYPE(2) TO UDSAMN0A.IT-SALDO-TYPE
        MOVE UDOPMN0A.IX-ID(2) TO UDSAMN0A.IX-ID
        MOVE BY NAME UDOPMN0A.AT-MD-G(2,*) TO UDSAMN0A.AT-G(*)
        MOVE 2 TO  UDSAMN0A.SA-MODIF
        IF UDOPMN0A.OP-STATE EQ 'N' THEN
           MOVE 'ADD' TO UDSAMN0A.DL-COMMAND
        ELSE IF UDOPMN0A.OP-STATE EQ 'S' THEN
           MOVE 'SUB' TO UDSAMN0A.DL-COMMAND
        END-IF END-IF
/*        WRITE "IX 2"
/*     FOR #L = 1 TO 30
/*        IF UDSAMN0A.AT-ATTR-ID(#L) EQ 0 THEN ESCAPE BOTTOM END-IF
/*        WRITE UDSAMN0A.AT-ATTR-TYPE(#L) UDSAMN0A.AT-ATTR-ID(#L) UDSAMN0A.AT-VALUE(#L)
/*     END-FOR
        PERFORM UDSAMN0S XXERX00A UDSAMN0A
        IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
     END-IF
     ADD 1 TO UBOPPC0A.OP-NUMBER
  END-FOR
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END


