**C               *>Natural Source Header 000000
**C               *:NatName UBOPDL0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060516
**C               *:Time 1205000
**C               *<Natural Source Header
**DS          0000      1UBOPDL0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2DEL-DC-ID
