**C               *>Natural Source Header 000000
**C               *:NatName UBOPPC0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060602
**C               *:Time 2005000
**C               *<Natural Source Header
**DS          0000      1UBOPPC0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2OP-NUMBER
