* >Natural Source Header 000000 /*<RO>>
* :NatName UDDDMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060518
* :Time 1226000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ƒ¿ÕÕ€’ –¿¡Œ“¿ — «¿œ»—‹ﬁ Œœ»—¿Õ»ﬂ «¿œ»—» ƒŒ ”Ã≈Õ“¿
/*
/*  ŒÃ¿Õƒ€:
/*   SET
/*   READ
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING UDDDMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UXXXEC0L
LOCAL USING UXMRXX0L
LOCAL USING UDDDMN0L
/*
LOCAL
1 #I (I4)
END-DEFINE
DEFINE SUBROUTINE UDDDMN0S
RESET XXERX00A
/*
PERFORM RECORD-PREPARE
/*
DECIDE ON FIRST VALUE DL-COMMAND
VALUE 'SET'
  PERFORM RECORD-SET
VALUE 'READ'
  PERFORM RECORD-READ
NONE VALUE
  MOVE DL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-PREPARE
  IF UDDDMN0A.DD-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF DL-COMMAND NE 'READ' THEN
     FOR #I = 1 TO 40
        IF UDDDMN0A.DD-MA-ATTR-ID(#I) EQ 0 THEN
           RESET UDDDMN0A.DD-MA-G(#I)
        ELSE
           IF UDDDMN0A.DD-MA-ATTR-TYPE(#I) NE 'P' AND
              UDDDMN0A.DD-MA-ATTR-TYPE(#I) NE 'A' THEN
              MOVE UDDDMN0A.DD-MA-ATTR-TYPE(#I) TO ERROR-ADDITION(1)
              *ERROR-NR := EC-ATTR-TYPE-UNKNOW
           END-IF
        END-IF
     END-FOR
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-SET
FM1.
  FIND UR-DOC-META-VIEW WITH DD-ID EQ UDDDMN0A.DD-ID
     IF NO RECORD FOUND
        MOVE BY NAME UDDDMN0A TO UR-DOC-META-VIEW
        MOVE MR-DD-TYPE-ID TO UR-DOC-META-VIEW.DD-TYPE-ID
SM1.
        STORE UR-DOC-META-VIEW
        GET UR-DOC-META-VIEW *ISN(SM1.)
        ESCAPE BOTTOM
     END-NOREC
     IF UR-DOC-META-VIEW.DD-TYPE-ID NE MR-DD-TYPE-ID THEN
        MOVE MR-DD-TYPE-ID TO ERROR-ADDITION(1)
        MOVE UR-DOC-META-VIEW.DD-TYPE-ID TO ERROR-ADDITION(2)
        *ERROR-NR := EC-RECORD-TYPE-MISMATCH
     END-IF
     MOVE BY NAME UDDDMN0A TO UR-DOC-META-VIEW
     UPDATE
     GET UR-DOC-META-VIEW *ISN(FM1.)
  END-FIND
  MOVE C*DD-MA-G TO UDDDMN0A.DD-MA-C
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  FIND UR-DOC-META-VIEW WITH DD-ID EQ UDDDMN0A.DD-ID
     IF NO RECORD FOUND
        MOVE UDDDMN0A.DD-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     IF UR-DOC-META-VIEW.DD-TYPE-ID NE MR-DD-TYPE-ID THEN
        MOVE MR-DD-TYPE-ID TO ERROR-ADDITION(1)
        MOVE UR-DOC-META-VIEW.DD-TYPE-ID TO ERROR-ADDITION(2)
        *ERROR-NR := EC-RECORD-TYPE-MISMATCH
     END-IF
     MOVE BY NAME UR-DOC-META-VIEW TO UDDDMN0A
     MOVE C*DD-MA-G TO UDDDMN0A.DD-MA-C
  END-FIND
  RESET #I UDDDMN0A.DD-CONT-LIST(*)
  FIND UR-DOC-META-VIEW WITH DD-UP-ID EQ UDDDMN0A.DD-ID
     ADD 1 TO #I
     MOVE UR-DOC-META-VIEW.DD-ID TO UDDDMN0A.DD-CONT-LIST(#I)
  END-FIND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

