* >Natural Source Header 000000 /*<RO>>
* :NatName UDDRSH0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ƒ¿ÕÕ€’ –¿¡Œ“¿ — «¿œ»—‹ﬁ ƒŒ ”Ã≈Õ“¿
/*
/*  ŒÃ¿Õƒ€:
/*   READ
/*   HOLD
/*   ADD
/*   UPDATE
/*   DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING UDDRSH0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UDDRMN0L
/*
LOCAL
1 #I          (I4)
1 #J          (I4)
1 #K          (I4)
1 #COUNT      (I4)
1 #RETAIN     (A8)
1 #NUMBER     (P10)
1 #IS-USED    (L)
END-DEFINE
DEFINE SUBROUTINE UDDRSH0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE DL-COMMAND
VALUE "FIRST"
  PERFORM QUERY-FIRST
VALUE "QUERY"
  PERFORM QUERY-RUN
VALUE "CLOSE"
  PERFORM QUERY-CLOSE
NONE VALUE
  MOVE DL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE QUERY-RUN
  IF DD-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF SH-RETAIN EQ " " THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  MOVE *PROGRAM TO #RETAIN
  RESET SH-NUMBER
  FOR #I = 1 TO 20
     IF SH-OPER(#I) EQ " " THEN ESCAPE BOTTOM END-IF
     DECIDE ON EVERY VALUE SH-OPER(#I)
        VALUE "SE"
           RESET #COUNT
           FOR #J = 1 TO 5
              IF SH-AT-ID(#I,#J) EQ 0 THEN ESCAPE BOTTOM END-IF
              ADD 1 TO #COUNT
              MOVE DD-ID TO DR-AS-SUPER-G.DR-TYPE-ID(#J)
              MOVE TRUE TO DR-AS-SUPER-G.DR-AS-IS-INDEX(#J)
              MOVE SH-AT-ID(#I,#J) TO DR-AS-SUPER-G.DR-AS-ATTR-ID(#J)
              MOVE SH-VALUE-A(#I) TO DR-AS-SUPER-G.DR-AS-VALUE(#J)
           END-FOR
        VALUE "EQ"
           RESET #COUNT
           FOR #J = 1 TO 5
              IF SH-AT-ID(#I,#J) EQ 0 THEN ESCAPE BOTTOM END-IF
              ADD 1 TO #COUNT
              MOVE DD-ID TO DR-AP-SUPER-G.DR-TYPE-ID(#J)
              MOVE TRUE TO DR-AP-SUPER-G.DR-AP-IS-INDEX(#J)
              MOVE SH-AT-ID(#I,#J) TO DR-AP-SUPER-G.DR-AP-ATTR-ID(#J)
              MOVE SH-VALUE-P(#I,1) TO DR-AP-SUPER-G.DR-AP-VALUE(#J)
           END-FOR
        VALUE "TH"
           RESET #COUNT
           FOR #J = 1 TO 10 STEP 2
              ADD 1 TO #COUNT
              IF SH-AT-ID(#I,#COUNT) EQ 0 THEN ESCAPE BOTTOM END-IF
              /*
              MOVE DD-ID TO DR-AP-SUPER-G.DR-TYPE-ID(#J)
              MOVE TRUE TO DR-AP-SUPER-G.DR-AP-IS-INDEX(#J)
              MOVE SH-AT-ID(#I,#COUNT) TO DR-AP-SUPER-G.DR-AP-ATTR-ID(#J)
              MOVE SH-VALUE-P(#I,1) TO DR-AP-SUPER-G.DR-AP-VALUE(#J)
              /*
              MOVE DD-ID TO DR-AP-SUPER-G.DR-TYPE-ID(#J+1)
              MOVE TRUE TO DR-AP-SUPER-G.DR-AP-IS-INDEX(#J+1)
              MOVE SH-AT-ID(#I,#COUNT) TO DR-AP-SUPER-G.DR-AP-ATTR-ID(#J+1)
              MOVE SH-VALUE-P(#I,2) TO DR-AP-SUPER-G.DR-AP-VALUE(#J+1)
           END-FOR
           SUBTRACT 1 FROM #COUNT
        VALUE "IN"
           /*
           MOVE DD-ID TO DR-AP-SUPER-G.DR-TYPE-ID(1)
           MOVE TRUE TO DR-AP-SUPER-G.DR-AP-IS-INDEX(1)
           MOVE SH-AT-ID(#I,1) TO DR-AP-SUPER-G.DR-AP-ATTR-ID(1)
           RESET DR-AP-SUPER-G.DR-AP-VALUE(1)
           /*
           MOVE BY NAME DR-AP-SUPER-G(1) TO DR-AP-SUPER-G(2)
           MOVE SH-VALUE-P(#I,1) TO DR-AP-SUPER-G.DR-AP-VALUE(2)
           /*
           MOVE DD-ID TO DR-AP-SUPER-G.DR-TYPE-ID(3)
           MOVE TRUE TO DR-AP-SUPER-G.DR-AP-IS-INDEX(3)
           MOVE SH-AT-ID(#I,2) TO DR-AP-SUPER-G.DR-AP-ATTR-ID(3)
           MOVE SH-VALUE-P(#I,1) TO DR-AP-SUPER-G.DR-AP-VALUE(3)
           /*
           MOVE BY NAME DR-AP-SUPER-G(3) TO DR-AP-SUPER-G(4)
           RESET DR-AP-SUPER-G.DR-AP-VALUE(4)
           ADD 1 TO DR-AP-SUPER-G.DR-AP-ATTR-ID(4)
        NONE VALUE
           *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
     END-DECIDE
     DECIDE ON FIRST VALUE SH-OPER(#I)
        VALUE "SE"
           RESET #NUMBER
           FOR #J = 1 TO #COUNT
DECIDE FOR FIRST CONDITION
WHEN #J NE #COUNT AND SH-NUMBER EQ 0 AND #NUMBER EQ 0
  FSEL1. FIND NUMBER UR-DOC-DATA-VIEW WITH DR-AS-SUPER EQ DR-AS-SUPER(#J)
                                RETAIN AS #RETAIN
  MOVE *NUMBER(FSEL1.) TO #NUMBER
WHEN #J NE #COUNT AND SH-NUMBER EQ 0 AND #NUMBER NE 0
  FSEL2. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR
              DR-AS-SUPER EQ DR-AS-SUPER(#J) RETAIN AS #RETAIN
  MOVE *NUMBER(FSEL2.) TO #NUMBER
WHEN #J NE #COUNT AND SH-NUMBER NE 0 AND #NUMBER EQ 0
  FSEL3. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
              DR-AS-SUPER EQ DR-AS-SUPER(#J) RETAIN AS #RETAIN
  MOVE *NUMBER(FSEL3.) TO #NUMBER
WHEN #J NE #COUNT AND SH-NUMBER NE 0 AND #NUMBER NE 0
  FSEL4. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR (SH-RETAIN AND
              DR-AS-SUPER EQ DR-AS-SUPER(#J)) RETAIN AS #RETAIN
  MOVE *NUMBER(FSEL4.) TO #NUMBER
WHEN #J EQ #COUNT AND SH-NUMBER EQ 0 AND #NUMBER EQ 0
  FSEL5. FIND NUMBER UR-DOC-DATA-VIEW WITH DR-AS-SUPER EQ DR-AS-SUPER(#J)
                                RETAIN AS SH-RETAIN
  MOVE *NUMBER(FSEL5.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN #J EQ #COUNT AND SH-NUMBER EQ 0 AND #NUMBER NE 0
  FSEL6. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR
              DR-AS-SUPER EQ DR-AS-SUPER(#J) RETAIN AS SH-RETAIN
  MOVE *NUMBER(FSEL6.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN #J EQ #COUNT AND SH-NUMBER NE 0 AND #NUMBER EQ 0
  FSEL7. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
              DR-AS-SUPER EQ DR-AS-SUPER(#J) RETAIN AS SH-RETAIN
  MOVE *NUMBER(FSEL7.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN #J EQ #COUNT AND SH-NUMBER NE 0 AND #NUMBER NE 0
  FSEL8. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR (SH-RETAIN AND
              DR-AS-SUPER EQ DR-AS-SUPER(#J)) RETAIN AS SH-RETAIN
  MOVE *NUMBER(FSEL8.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN NONE
    IGNORE
END-DECIDE
           END-FOR
        VALUE "EQ"
           RESET #NUMBER
           FOR #J = 1 TO #COUNT
DECIDE FOR FIRST CONDITION
WHEN #J NE #COUNT AND SH-NUMBER EQ 0 AND #NUMBER EQ 0
  FEQL1. FIND NUMBER UR-DOC-DATA-VIEW WITH DR-AP-SUPER EQ DR-AP-SUPER(#J)
                                RETAIN AS #RETAIN
  MOVE *NUMBER(FEQL1.) TO #NUMBER
WHEN #J NE #COUNT AND SH-NUMBER EQ 0 AND #NUMBER NE 0
  FEQL2. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR
              DR-AP-SUPER EQ DR-AP-SUPER(#J) RETAIN AS #RETAIN
  MOVE *NUMBER(FEQL2.) TO #NUMBER
WHEN #J NE #COUNT AND SH-NUMBER NE 0 AND #NUMBER EQ 0
  FEQL3. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
              DR-AP-SUPER EQ DR-AP-SUPER(#J) RETAIN AS #RETAIN
  MOVE *NUMBER(FEQL3.) TO #NUMBER
WHEN #J NE #COUNT AND SH-NUMBER NE 0 AND #NUMBER NE 0
  FEQL4. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR (SH-RETAIN AND
              DR-AP-SUPER EQ DR-AP-SUPER(#J)) RETAIN AS #RETAIN
  MOVE *NUMBER(FEQL4.) TO #NUMBER
WHEN #J EQ #COUNT AND SH-NUMBER EQ 0 AND #NUMBER EQ 0
  FEQL5. FIND NUMBER UR-DOC-DATA-VIEW WITH DR-AP-SUPER EQ DR-AP-SUPER(#J)
                                RETAIN AS SH-RETAIN
  MOVE *NUMBER(FEQL5.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN #J EQ #COUNT AND SH-NUMBER EQ 0 AND #NUMBER NE 0
  FEQL6. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR
              DR-AP-SUPER EQ DR-AP-SUPER(#J) RETAIN AS SH-RETAIN
  MOVE *NUMBER(FEQL6.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN #J EQ #COUNT AND SH-NUMBER NE 0 AND #NUMBER EQ 0
  FEQL7. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
              DR-AP-SUPER EQ DR-AP-SUPER(#J) RETAIN AS SH-RETAIN
  MOVE *NUMBER(FEQL7.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN #J EQ #COUNT AND SH-NUMBER NE 0 AND #NUMBER NE 0
  FEQL8. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR (SH-RETAIN AND
              DR-AP-SUPER EQ DR-AP-SUPER(#J)) RETAIN AS SH-RETAIN
  MOVE *NUMBER(FEQL8.) TO SH-NUMBER
  IF #NUMBER NE 0 THEN RELEASE SET #RETAIN RESET #NUMBER END-IF
WHEN NONE
    IGNORE
END-DECIDE
           END-FOR
        VALUE "TH"
           FOR #J = 1 TO #COUNT
              #K := #J * 2 - 1
/*              WRITE #COUNT #J #K
           DECIDE FOR FIRST CONDITION
           WHEN #J NE #COUNT AND #NUMBER EQ 0
              FTHL1. FIND NUMBER UR-DOC-DATA-VIEW WITH DR-AP-SUPER EQ
                          DR-AP-SUPER(#K) THRU DR-AP-SUPER(#K + 1)
                          RETAIN AS #RETAIN
              MOVE *NUMBER(FTHL1.) TO #NUMBER
           WHEN #J NE #COUNT AND #NUMBER NE 0
              FTHL2. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR
                (DR-AP-SUPER EQ DR-AP-SUPER(#K) THRU DR-AP-SUPER(#K+1))
                          RETAIN AS #RETAIN
              MOVE *NUMBER(FTHL2.) TO #NUMBER
           WHEN #J EQ #COUNT AND SH-NUMBER EQ 0 AND #NUMBER EQ 0
              FTHL3. FIND NUMBER UR-DOC-DATA-VIEW WITH DR-AP-SUPER EQ
                          DR-AP-SUPER(#K) THRU DR-AP-SUPER(#K + 1)
                          RETAIN AS SH-RETAIN
              MOVE *NUMBER(FTHL3.) TO SH-NUMBER
           WHEN #J EQ #COUNT AND SH-NUMBER EQ 0 AND #NUMBER NE 0
              FTHL4. FIND NUMBER UR-DOC-DATA-VIEW WITH #RETAIN OR
                (DR-AP-SUPER EQ DR-AP-SUPER(#K) THRU DR-AP-SUPER(#K+1))
                          RETAIN AS SH-RETAIN
              MOVE *NUMBER(FTHL4.) TO SH-NUMBER
           WHEN #J EQ #COUNT AND SH-NUMBER NE 0 AND #NUMBER EQ 0
              FTHL5. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
                (DR-AP-SUPER EQ DR-AP-SUPER(#K) THRU DR-AP-SUPER(#K+1))
                          RETAIN AS SH-RETAIN
              MOVE *NUMBER(FTHL5.) TO SH-NUMBER
           WHEN #J EQ #COUNT AND SH-NUMBER NE 0 AND #NUMBER NE 0
              FTHL6. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
                (#RETAIN OR DR-AP-SUPER EQ
                    DR-AP-SUPER(#K) THRU DR-AP-SUPER(#K+1))
                          RETAIN AS SH-RETAIN
              MOVE *NUMBER(FTHL6.) TO SH-NUMBER
           WHEN NONE
              IGNORE
           END-DECIDE
/*           WRITE #NUMBER SH-NUMBER DR-AP-SUPER(#K) DR-AP-SUPER(#K + 1)
           END-FOR
        VALUE "IN"
           IF SH-NUMBER EQ 0
/*              WRITE DR-AP-SUPER(1) DR-AP-SUPER(2)
/*              FIND UR-DOC-DATA-VIEW WITH
/*               DR-AP-SUPER EQ DR-AP-SUPER(1) THRU DR-AP-SUPER(2)
/*                 WRITE UR-DOC-DATA-VIEW.DR-ID
/*              END-FIND
/*              WRITE DR-AP-SUPER(3) DR-AP-SUPER(4)
/*              FIND UR-DOC-DATA-VIEW WITH
/*               DR-AP-SUPER EQ DR-AP-SUPER(3) THRU DR-AP-SUPER(4)
/*                 WRITE UR-DOC-DATA-VIEW.DR-ID
/*              END-FIND
              FINL1. FIND NUMBER UR-DOC-DATA-VIEW WITH
               (DR-AP-SUPER EQ DR-AP-SUPER(1) THRU DR-AP-SUPER(2)) AND
               (DR-AP-SUPER EQ DR-AP-SUPER(3) THRU DR-AP-SUPER(4))
                          RETAIN AS SH-RETAIN
              MOVE *NUMBER(FINL1.) TO SH-NUMBER
           ELSE
              FINL2. FIND NUMBER UR-DOC-DATA-VIEW WITH SH-RETAIN AND
               (DR-AP-SUPER EQ DR-AP-SUPER(1) THRU DR-AP-SUPER(2)) AND
               (DR-AP-SUPER EQ DR-AP-SUPER(3) THRU DR-AP-SUPER(4))
                          RETAIN AS SH-RETAIN
              MOVE *NUMBER(FINL2.) TO SH-NUMBER
           END-IF
        NONE VALUE
           *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
     END-DECIDE
/*     WRITE "FIND" SH-OPER(#I) SH-NUMBER
     IF SH-NUMBER EQ 0 THEN ESCAPE BOTTOM END-IF
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE QUERY-FIRST
  RESET UDDRSH0A.DD-ID UDDRSH0A.DR-ID
  FIND (1) UR-DOC-DATA-VIEW WITH UDDRSH0A.SH-RETAIN
     WHERE UR-DOC-DATA-VIEW.DR-TX-STATUS EQ "N" OR
           UR-DOC-DATA-VIEW.DR-TX-STATUS EQ "D" AND
           UDDRSH0A.TX-ID NE UR-DOC-DATA-VIEW.DR-TX-CURRENT-ID OR
           UR-DOC-DATA-VIEW.DR-TX-STATUS EQ "A" AND
           UDDRSH0A.TX-ID EQ UR-DOC-DATA-VIEW.DR-TX-CURRENT-ID
     IF NO RECORD FOUND
        RETURN-CODE := EC-OBJECT-NOT-FOUND
     END-NOREC
     MOVE UR-DOC-DATA-VIEW.DR-TYPE-ID TO UDDRSH0A.DD-ID
     MOVE UR-DOC-DATA-VIEW.DR-ID TO UDDRSH0A.DR-ID
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE QUERY-CLOSE
  IF SH-RETAIN EQ " " THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  IF SH-NUMBER NE 0 THEN
     RELEASE SET SH-RETAIN
  END-IF
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
