* >Natural Source Header 000000 /*<RO>>
* :NatName UDITMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060603
* :Time 1941000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ƒ¿ÕÕ€’ –¿¡Œ“¿ — «¿œ»—‹ﬁ Œœ»—¿Õ»ﬂ «¿œ»—» ƒŒ ”Ã≈Õ“¿
/*
/*  ŒÃ¿Õƒ€:
/*   SET
/*   READ
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING UDITMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UXXXEC0L
LOCAL USING UXMRXX0L
LOCAL USING UDITMN0L
/*
LOCAL
1 #I (I4)
END-DEFINE
DEFINE SUBROUTINE UDITMN0S
RESET XXERX00A
/*
PERFORM RECORD-PREPARE
/*
DECIDE ON FIRST VALUE DL-COMMAND
VALUE 'SET'
  PERFORM RECORD-SET
VALUE 'READ'
  PERFORM RECORD-READ
NONE VALUE
  MOVE DL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-PREPARE
  IF UDITMN0A.IT-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF DL-COMMAND NE 'READ' THEN
     IF UDITMN0A.CL-ID EQ 0 THEN
        *ERROR-NR := EC-OBJECT-ID-REQUIRED
     END-IF
     FOR #I = 1 TO 30
        IF UDITMN0A.MA-ID(#I) EQ 0 THEN
           RESET UDITMN0A.MA-G(#I)
        ELSE
           IF UDITMN0A.MA-TYPE(#I) NE 'A' AND
              UDITMN0A.MA-TYPE(#I) NE 'M' AND
              UDITMN0A.MA-TYPE(#I) NE 'C' AND
              UDITMN0A.MA-TYPE(#I) NE 'I' THEN
              MOVE UDITMN0A.MA-TYPE(#I) TO ERROR-ADDITION(1)
              *ERROR-NR := EC-ATTR-TYPE-UNKNOW
           END-IF
        END-IF
     END-FOR
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-SET
FM1.
  FIND UR-ACC-META-VIEW WITH IT-ID EQ UDITMN0A.IT-ID
     IF NO RECORD FOUND
        MOVE BY NAME UDITMN0A TO UR-ACC-META-VIEW
        MOVE MR-IT-TYPE-ID TO UR-ACC-META-VIEW.IT-RECORD-TYPE
SM1.
        STORE UR-ACC-META-VIEW
        GET UR-ACC-META-VIEW *ISN(SM1.)
        MOVE *ISN(SM1.) TO IT-ISN
        ESCAPE BOTTOM
     END-NOREC
     IF UR-ACC-META-VIEW.IT-RECORD-TYPE NE MR-IT-TYPE-ID THEN
        MOVE MR-IT-TYPE-ID TO ERROR-ADDITION(1)
        MOVE UR-ACC-META-VIEW.IT-RECORD-TYPE TO ERROR-ADDITION(2)
        *ERROR-NR := EC-RECORD-TYPE-MISMATCH
     END-IF
     IF UR-ACC-META-VIEW.IT-SALDO-TYPE NE UDITMN0A.IT-SALDO-TYPE THEN
        *ERROR-NR := EC-ATTR-VALUE-MISMATCH
     END-IF
     MOVE BY NAME UDITMN0A TO UR-ACC-META-VIEW
     UPDATE
     GET UR-ACC-META-VIEW *ISN(FM1.)
     MOVE *ISN(FM1.) TO IT-ISN
  END-FIND
/*  MOVE C*MA-G TO UDITMN0A.DD-MA-C
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  FIND UR-ACC-META-VIEW WITH IT-ID EQ UDITMN0A.IT-ID
     IF NO RECORD FOUND
        MOVE UDITMN0A.IT-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     IF UR-ACC-META-VIEW.IT-RECORD-TYPE NE MR-IT-TYPE-ID THEN
        MOVE MR-IT-TYPE-ID TO ERROR-ADDITION(1)
        MOVE UR-ACC-META-VIEW.IT-RECORD-TYPE TO ERROR-ADDITION(2)
        *ERROR-NR := EC-RECORD-TYPE-MISMATCH
     END-IF
     MOVE BY NAME UR-ACC-META-VIEW TO UDITMN0A
     MOVE *ISN(FM1.) TO IT-ISN
  END-FIND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

