**C               *>Natural Source Header 000000
**C               *:NatName UDOPTX0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20000102
**C               *:Time 0000000
**C               *<Natural Source Header
**DS          0000      1UDOPTX0A
**DK          0000A  10 2DL-COMMAND
**DK          0000P  15 2TX-ID
