* >Natural Source Header 000000 /*<RO>>
* :NatName UDSAMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060603
* :Time 1853000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ƒ¿ÕÕ€’ –¿¡Œ“¿ —  Œ¡¡»Õ¿“Œ–ŒÃ ¿Õ¿À»“» »
/*
/*  ŒÃ¿Õƒ€:
/*   ADD
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING UDSAMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UXXXEC0L
LOCAL USING UDXXID0L
LOCAL USING UDSAMN0L
/*
LOCAL
1 #I          (I4)
1 #J          (I4)
1 #K          (I4)
1 #IS-FOUND   (L)
1 #IS-DIFF    (L)
1 #COUNT      (I2)
1 #IS-ADD     (L)
1 #IS-ZERO    (L)
/*
END-DEFINE
DEFINE SUBROUTINE UDSAMN0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE DL-COMMAND
VALUE 'ADD'
  #IS-ADD := TRUE
  PERFORM RECORD-MODIFY
VALUE 'SUB'
  #IS-ADD := FALSE
  PERFORM RECORD-MODIFY
NONE VALUE
  MOVE DL-COMMAND TO ERROR-ADDITION(1)
  *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-MODIFY
  MOVE UDSAMN0A.CL-ID TO UD-SA-IX-ID-SUPER.SA-CL-ID
  MOVE UDSAMN0A.IX-ID TO UD-SA-IX-ID-SUPER.MD-IX-ID
  MOVE 90000000 TO UD-SA-IX-ID-SUPER.DT-INDEX
/*  WRITE 'FIND'  UDSAMN0A.IX-ID UD-SA-IX-ID-SUPER
  FIND UR-ACC-SALDO-VIEW WITH UD-SA-IX-ID-SUPER EQ UD-SA-IX-ID-SUPER
     IF NO RECORD FOUND
/*        WRITE 'ADD'
        PERFORM RECORD-ADD
        ESCAPE ROUTINE
     END-NOREC
/*     WRITE '-' #IS-ADD 'SA-MODIF' UDSAMN0A.SA-MODIF 'SA-TYPE' UDSAMN0A.IT-SALDO-TYPE
     #IS-ZERO := TRUE
     FOR #I = 1 TO 30
        IF UDSAMN0A.AT-ATTR-ID(#I) EQ 0 THEN ESCAPE BOTTOM END-IF
        IF UDSAMN0A.AT-ATTR-TYPE(#I) EQ 'M' THEN
           FOR #J = 1 TO C*AT-G
              IF UDSAMN0A.AT-ATTR-ID(#I) EQ
                 UR-ACC-SALDO-VIEW.AT-ATTR-ID(#J) THEN
                 IF (#IS-ADD AND UDSAMN0A.SA-MODIF EQ UDSAMN0A.IT-SALDO-TYPE) OR
                    (NOT #IS-ADD AND UDSAMN0A.SA-MODIF NE UDSAMN0A.IT-SALDO-TYPE) THEN
                    ADD UDSAMN0A.AT-VALUE(#I) TO UR-ACC-SALDO-VIEW.AT-VALUE(#J)
                 ELSE
                    SUBTRACT UDSAMN0A.AT-VALUE(#I) FROM UR-ACC-SALDO-VIEW.AT-VALUE(#J)
                 END-IF
                 IF UR-ACC-SALDO-VIEW.AT-VALUE(#J) NE 0 THEN
                    #IS-ZERO := FALSE
                 END-IF
              END-IF
           END-FOR
        END-IF
     END-FOR
     IF #IS-ZERO THEN
/*        WRITE 'DELETE' UR-ACC-SALDO-VIEW.MD-IX-ID(1)
        DELETE
     ELSE
/*        WRITE 'UPDATE' UR-ACC-SALDO-VIEW.MD-IX-ID(1)
        UPDATE
     END-IF
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-ADD
  IF UDSAMN0A.IT-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  IF UDSAMN0A.IX-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  MOVE 4 TO UR-ACC-SALDO-VIEW.UD-RECORD-TYPE
  MOVE UDSAMN0A.CL-ID TO UR-ACC-SALDO-VIEW.CL-ID
  MOVE UDSAMN0A.CL-ID TO UR-ACC-SALDO-VIEW.SA-CL-ID
  UR-ACC-SALDO-VIEW.OP-CL-ID := UDSAMN0A.CL-ID * 10 + 4
  MOVE 90000000 TO UR-ACC-SALDO-VIEW.DT-INDEX(1)
  FOR #I = 1 TO 30
     IF UDSAMN0A.AT-ATTR-ID(#I) EQ 0 THEN ESCAPE BOTTOM END-IF
     MOVE BY NAME UDSAMN0A.AT-G(#I) TO UR-ACC-SALDO-VIEW.AT-G(#I)
     MOVE #I TO UR-ACC-SALDO-VIEW.AT-INT-NUM(#I)
     MOVE 1 TO UR-ACC-SALDO-VIEW.AT-MD-INT-NUM(#I,1)
     IF UR-ACC-SALDO-VIEW.AT-ATTR-TYPE(#I) EQ 'A' OR EQ 'I' THEN
        MOVE TRUE TO UR-ACC-SALDO-VIEW.AT-IS-INDEX(#I)
     END-IF
     IF UR-ACC-SALDO-VIEW.AT-ATTR-TYPE(#I) EQ 'M' AND
        NOT #IS-ADD THEN
        UR-ACC-SALDO-VIEW.AT-VALUE(#I) :=
        -1 * UR-ACC-SALDO-VIEW.AT-VALUE(#I)
     END-IF
  END-FOR
  MOVE 1 TO UR-ACC-SALDO-VIEW.MD-INT-NUM(1)
  MOVE 0 TO UR-ACC-SALDO-VIEW.MD-OP-INT-NUM(1)
  MOVE SA-MODIF TO UR-ACC-SALDO-VIEW.MD-MODIF(1)
  MOVE UDSAMN0A.IT-ID TO UR-ACC-SALDO-VIEW.MD-IT-ID(1)
  MOVE UDSAMN0A.IT-SALDO-TYPE TO UR-ACC-SALDO-VIEW.MD-IT-SALDO-TYPE(1)
  MOVE UDSAMN0A.IX-ID TO UR-ACC-SALDO-VIEW.MD-IX-ID(1)
/*  FOR #I = 1 TO 30
/*     IF UR-ACC-SALDO-VIEW.AT-ATTR-ID(#I) EQ 0 THEN ESCAPE BOTTOM END-IF
/*     WRITE 'store' UR-ACC-SALDO-VIEW.AT-IS-INDEX(#I) UR-ACC-SALDO-VIEW.AT-ATTR-ID(#I) UR-ACC-SALDO-VIEW.AT-VALUE(#I)
/*  END-FOR
SL.
  STORE UR-ACC-SALDO-VIEW
GL1.
  GET UR-ACC-SALDO-ID-VIEW *ISN(SL.)
  INCLUDE UDXXID0C 'UR-ACC-SALDO-ID-VIEW.UD-ID' '*ISN(SL.)'
  UPDATE (GL1.)
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

