* >Natural Source Header 000000 /*<RO>>
* :NatName UTDRMN0P
* :UID ARMK01
* :Mode S
* :CP
* :Date 20060614
* :Time 1102000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :  ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  “≈—“ œ–Œ√–¿ÃÃ –≈ƒ¿ “»–Œ¬¿Õ»ﬂ ƒŒ ”Ã≈Õ“Œ¬
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING UBDDMN0A
LOCAL USING UBDRMN0A
LOCAL USING XBTXMN0A
LOCAL USING UXCSXX0A
LOCAL USING UDDRTX0A
LOCAL USING UDDRMN0L
LOCAL USING UDDDMN0L
LOCAL
1 #TESTNAME (A60)
1 #REC1 (P15)
1 #REC2 (P15)
1 #REC3 (P15)
1 #TEST-PASS (I2)
1 #TEST-FAIL (I2)
END-DEFINE
/*
UBDDMN0A.BL-COMMAND := 'SET'
/* RECORD 1
UBDDMN0A.DD-ID := -1
UBDDMN0A.DD-TX-IS-REQUIRED := TRUE
RESET UBDDMN0A.DD-MA-C
INCLUDE UXDDMAAC '1'    '-10000' '"A"' 'TRUE'  'TRUE'  'FALSE' 'FALSE'
INCLUDE UXDDMAAC '2'    '-10001' '"P"' 'FALSE' 'TRUE'  'FALSE' 'FALSE'
INCLUDE UXDDMAAC '3'    '-10002' '"P"' 'TRUE'  'TRUE'  'FALSE' 'FALSE'
/*
#TESTNAME := 'ADD META RECORD 1'
ADD 1 TO #TEST-PASS
PERFORM UBDDMN0S XXERX00A UBDDMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/* RECORD 2
UBDDMN0A.DD-ID := -2
UBDDMN0A.DD-UP-ID := -1
UBDDMN0A.DD-TX-IS-REQUIRED := TRUE
RESET UBDDMN0A.DD-MA-C
INCLUDE UXDDMAAC '1'    '-10003' '"A"' 'FALSE' 'TRUE'  'FALSE' 'FALSE'
INCLUDE UXDDMAAC '2'    '-10004' '"P"' 'FALSE' 'TRUE'  'TRUE'  'FALSE'
INCLUDE UXDDMAAC '2'    '-10005' '"P"' 'FALSE' 'TRUE'  'TRUE'  'FALSE'
INCLUDE UXDDMAAC '3'    '-10006' '"P"' 'TRUE'  'TRUE'  'FALSE' 'FALSE'
/*
#TESTNAME := 'ADD META RECORD 2'
ADD 1 TO #TEST-PASS
PERFORM UBDDMN0S XXERX00A UBDDMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/*READ UR-DOC-META-VIEW IN PHYSICAL SEQUENCE
/*  WRITE UR-DOC-META-VIEW.DD-ID UR-DOC-META-VIEW.DD-UP-ID
/*        UR-DOC-META-VIEW.DD-LEVEL
/*END-READ
/*
XBTXMN0A.TX-USER := *USER
XBTXMN0A.BL-COMMAND := 'OPEN'
#TESTNAME := 'OPEN TRANSACTION'
ADD 1 TO #TEST-PASS
PERFORM XBTXMN0S XXERX00A XXCTXX0A XBTXMN0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
UBDRMN0A.TX-ID := XBTXMN0A.TX-ID
/*
UBDRMN0A.DR-TYPE-ID := -1
UBDRMN0A.DR-AP-ATTR-ID(1) := -10001
UBDRMN0A.DR-AP-VALUE-E(1) := 2
UBDRMN0A.DR-AP-VALUE(1) := 10001
UBDRMN0A.DR-AP-ATTR-ID(2) := -10002
UBDRMN0A.DR-AP-VALUE-E(2) := 0
UBDRMN0A.DR-AP-VALUE(2) := 10002
UBDRMN0A.DR-AS-ATTR-ID(3) := -10000
UBDRMN0A.DR-AS-VALUE(3) := '10000'
UBDRMN0A.BL-COMMAND := 'ADD'
#TESTNAME := 'ADD RECORD 1'
ADD 1 TO #TEST-PASS
PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
#REC1 := UBDRMN0A.DR-ID
/*
UBDRMN0A.DR-UP-ID := #REC1
UBDRMN0A.DR-TYPE-ID := -2
UBDRMN0A.DR-AP-ATTR-ID(1) := -10004
UBDRMN0A.DR-AP-VALUE-E(1) := 2
UBDRMN0A.DR-AP-VALUE(1) := 10004
UBDRMN0A.DR-AP-ATTR-ID(2) := -10005
UBDRMN0A.DR-AP-VALUE-E(2) := 2
UBDRMN0A.DR-AP-VALUE(2) := 10005
UBDRMN0A.DR-AP-ATTR-ID(3) := -10006
UBDRMN0A.DR-AP-VALUE-E(3) := 0
UBDRMN0A.DR-AP-VALUE(3) := 10006
UBDRMN0A.DR-AS-ATTR-ID(4) := -10003
UBDRMN0A.DR-AS-VALUE(4) := '10003'
UBDRMN0A.BL-COMMAND := 'ADD'
#TESTNAME := 'ADD RECORD 2'
ADD 1 TO #TEST-PASS
PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
#REC2 := UBDRMN0A.DR-ID
/*
UBDRMN0A.DR-UP-ID := #REC1
UBDRMN0A.DR-TYPE-ID := -2
UBDRMN0A.DR-AP-ATTR-ID(1) := -10004
UBDRMN0A.DR-AP-VALUE-E(1) := 2
UBDRMN0A.DR-AP-VALUE(1) := 20004
UBDRMN0A.DR-AP-ATTR-ID(2) := -10005
UBDRMN0A.DR-AP-VALUE-E(2) := 2
UBDRMN0A.DR-AP-VALUE(2) := 20005
UBDRMN0A.DR-AP-ATTR-ID(3) := -10006
UBDRMN0A.DR-AP-VALUE-E(3) := 0
UBDRMN0A.DR-AP-VALUE(3) := 20006
UBDRMN0A.DR-AS-ATTR-ID(4) := -10003
UBDRMN0A.DR-AS-VALUE(4) := '20003'
UBDRMN0A.BL-COMMAND := 'ADD'
#TESTNAME := 'ADD RECORD 3'
ADD 1 TO #TEST-PASS
PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
#REC3 := UBDRMN0A.DR-ID
/*
UBDRMN0A.DR-ID := #REC2
UBDRMN0A.DR-TYPE-ID := -2
UBDRMN0A.BL-COMMAND := 'DELETE'
#TESTNAME := 'DELETE RECORD 2'
ADD 1 TO #TEST-PASS
PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/*
UDDRTX0A.TX-ID := XBTXMN0A.TX-ID
UDDRTX0A.DL-COMMAND := 'COMMIT'
#TESTNAME := 'TRANSACTION COMMIT'
ADD 1 TO #TEST-PASS
PERFORM UDDRTX0S XXERX00A UDDRTX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/*
UBDRMN0A.DR-ID := #REC3
UBDRMN0A.DR-UP-ID := #REC1
UBDRMN0A.DR-TYPE-ID := -2
UBDRMN0A.DR-AP-ATTR-ID(1) := -10004
UBDRMN0A.DR-AP-VALUE-E(1) := 2
UBDRMN0A.DR-AP-VALUE(1) := 10004
UBDRMN0A.DR-AP-ATTR-ID(2) := -10005
UBDRMN0A.DR-AP-VALUE-E(2) := 2
UBDRMN0A.DR-AP-VALUE(2) := 10005
UBDRMN0A.DR-AP-ATTR-ID(3) := -10006
UBDRMN0A.DR-AP-VALUE-E(3) := 0
UBDRMN0A.DR-AP-VALUE(3) := 10006
UBDRMN0A.DR-AS-ATTR-ID(4) := -10003
UBDRMN0A.DR-AS-VALUE(4) := '10003'
UBDRMN0A.BL-COMMAND := 'UPDATE'
#TESTNAME := 'UPDATE RECORD 3'
ADD 1 TO #TEST-PASS
PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
#REC2 := UBDRMN0A.DR-ID
/*
XBTXMN0A.BL-COMMAND := 'LOCATE'
#TESTNAME := 'TRANSACTION LOCATE'
ADD 1 TO #TEST-PASS
PERFORM XBTXMN0S XXERX00A XXCTXX0A XBTXMN0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/*
UDDRTX0A.TX-ID := XBTXMN0A.TX-ID
UDDRTX0A.DL-COMMAND := 'ROLLBACK'
#TESTNAME := 'TRANSACTION ROLLBACK'
ADD 1 TO #TEST-PASS
PERFORM UDDRTX0S XXERX00A UDDRTX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/*
UBDRMN0A.DR-ID := #REC1
UBDRMN0A.DR-TYPE-ID := -2
UBDRMN0A.BL-COMMAND := 'READ'
#TESTNAME := 'READ CONTAINER'
ADD 1 TO #TEST-PASS
PERFORM UBDRMN0S XXERX00A XXCTXX0A UBDRMN0A UXCSXX0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
#TESTNAME := 'TEST CONTAINER VALUE'
ADD 1 TO #TEST-PASS
IF UBDRMN0A.DR-AP-C NE 2 OR
  UBDRMN0A.DR-AP-ATTR-ID(1) NE -10004 OR
  UBDRMN0A.DR-AP-VALUE(1) NE 20004 OR
  UBDRMN0A.DR-AP-ATTR-ID(2) NE -10005 OR
  UBDRMN0A.DR-AP-VALUE(2) NE 20005 THEN
  PERFORM DUMP-ERROR
END-IF
/* WRITE UBDRMN0A.DR-AP-C /
/* UBDRMN0A.DR-AP-ATTR-ID(1)  UBDRMN0A.DR-AP-VALUE(1) /
/* UBDRMN0A.DR-AP-ATTR-ID(2)  UBDRMN0A.DR-AP-VALUE(2) /
/* UBDRMN0A.DR-AP-ATTR-ID(3)  UBDRMN0A.DR-AP-VALUE(3) /
/* UBDRMN0A.DR-AP-ATTR-ID(4)  UBDRMN0A.DR-AP-VALUE(4)
/*
/* READ UR-DOC-DATA-VIEW IN PHYSICAL SEQUENCE
/*   WRITE UR-DOC-DATA-VIEW.DR-ID UR-DOC-DATA-VIEW.DR-TYPE-ID
/*         UR-DOC-DATA-VIEW.DR-UP-ID UR-DOC-DATA-VIEW.DR-LEVEL
/*         UR-DOC-DATA-VIEW.DR-SORT
/*         UR-DOC-DATA-VIEW.DR-TX-STATUS
/*         UR-DOC-DATA-VIEW.DR-COL-RECORD
/* END-READ
/*
/*
XBTXMN0A.BL-COMMAND := 'CLOSE'
#TESTNAME := 'TRANSACTION CLOSE'
ADD 1 TO #TEST-PASS
PERFORM XBTXMN0S XXERX00A XXCTXX0A XBTXMN0A
IF RETURN-CODE NE 0 THEN
  PERFORM DUMP-ERROR
END-IF
/*
BACKOUT TRANSACTION
WRITE '¬—≈√Œ “≈—“Œ¬' #TEST-PASS 'Œÿ»¡Œ◊Õ€’' #TEST-FAIL
DEFINE SUBROUTINE DUMP-ERROR
  ADD 1 TO #TEST-FAIL
  WRITE 'Œÿ»¡ ¿ “≈—“' #TEST-PASS #TESTNAME
  PRINT RETURN-CODE ERROR-ADDITION(1) ERROR-ADDITION(2)
  WRITE ERROR-MODULE ERROR-LINE ERROR-NUMBER /
        ERROR-STACK-MODULE(1) ERROR-STACK-LINE(1) /
        ERROR-STACK-MODULE(2) ERROR-STACK-LINE(2) /
        ERROR-STACK-MODULE(3) ERROR-STACK-LINE(3) /
        ERROR-STACK-MODULE(4) ERROR-STACK-LINE(4) /
        ERROR-STACK-MODULE(5) ERROR-STACK-LINE(5)
END-SUBROUTINE
END

