* >Natural Source Header 000000 /*<RO>>
* :NatName UXOCMK2C
* :UID INTECO
* :Mode R
* :CP
* :Date 20060519
* :Time 2007000
* <Natural Source Header /*<<RO>
ADD 1 TO UBODOC0A.OD-RULE-POS-C
UBODOC0A.OD-RULE-POS-LIST(OD-RULE-POS-C) := UBODOC0A-OC-C + 1

