* >Natural Source Header 000000 /*<RO>>
* :NatName UXOCMK3C
* :UID INTECO
* :Mode R
* :CP
* :Date 20060519
* :Time 1201000
* <Natural Source Header /*<<RO>
MOVE &1& TO CUR-OC-CODE
MOVE &2& TO CUR-RES-TYPE
MOVE &3& TO CUR-RES-ATTR
MOVE &4& TO CUR-ARG-TYPE
MOVE &5& TO CUR-ARG-ATTR
MOVE &6& TO CUR-ARG-CONST-E
MOVE &7& TO CUR-ARG-CONST
PERFORM MICROINSTRUCTION-INSERT

