**C               *>Natural Source Header 000000
**C               *:NatName XABOXX0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060606
**C               *:Time 0823000
**C               *<Natural Source Header
**DS          0000      1XABOXX0A
**DK          0000A  10 2BO-COMMAND
**DK          0000P  15 2BO-OBJECT
