* >Natural Source Header 000000 /*<RO>>
* :NatName XBDPMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060529
* :Time 1443000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: ƒ≈œ¿–“¿Ã≈Õ“
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XBDPMN0A
LOCAL USING XXXXEC0L
LOCAL USING LCLPOL
LOCAL
1 #DP-ID  (N15)
1 REDEFINE #DP-ID
2 BLANK (N5)
2 OG-ID (N5)
2 DP-ID (N5)
1 #OG-PD  (B10)
1 REDEFINE #OG-PD
2 OG-ID (N5)
2 DP-ID (N5)
END-DEFINE
DEFINE SUBROUTINE XBDPMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE BL-COMMAND
  VALUE 'READ'
     PERFORM RECORD-READ
  VALUE 'LOCATE'
     PERFORM RECORD-LOCATE
  NONE VALUE
     MOVE BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-READ
  IF XBDPMN0A.DP-ID = 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE XBDPMN0A.DP-ID TO #DP-ID
  MOVE #DP-ID.OG-ID TO #OG-PD.OG-ID
  MOVE #DP-ID.DP-ID TO #OG-PD.DP-ID
  FIND IBS-KPO-FILE WITH OG-PD EQ #OG-PD
     IF NO RECORD
        MOVE #DP-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     XBDPMN0A.OG-ID := IBS-KPO-FILE.OG-ID
     XBDPMN0A.DP-CODE := IBS-KPO-FILE.PD-ID
     XBDPMN0A.DP-NAME := IBS-KPO-FILE.NM-PD
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOCATE
  IF XBDPMN0A.DP-CODE EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  IF XBDPMN0A.OG-ID EQ 0 THEN
     MOVE XXCTXX0A.OG-ID TO XBDPMN0A.OG-ID
  END-IF
  IF XBDPMN0A.OG-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE XBDPMN0A.OG-ID TO #DP-ID.OG-ID
  MOVE XBDPMN0A.DP-CODE TO #DP-ID.DP-ID
  MOVE XBDPMN0A.OG-ID TO #OG-PD.OG-ID
  MOVE XBDPMN0A.DP-CODE TO #OG-PD.DP-ID
  FIND IBS-KPO-FILE WITH OG-PD EQ #OG-PD
     IF NO RECORD
        RETURN-CODE := EC-OBJECT-NOT-FOUND
        ESCAPE ROUTINE
     END-NOREC
     XBDPMN0A.OG-ID := IBS-KPO-FILE.OG-ID
     XBDPMN0A.DP-CODE := IBS-KPO-FILE.PD-ID
     XBDPMN0A.DP-NAME := IBS-KPO-FILE.NM-PD
     XBDPMN0A.DP-ID := #DP-ID
  END-FIND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END

