**C               *>Natural Source Header 000000
**C               *:NatName XBDPMN0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060529
**C               *:Time 1443000
**C               *<Natural Source Header
**DS          0000      1XBDPMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2OG-ID
**DK          0000P  15 2DP-ID
**DK          0000N   5 2DP-CODE
**DK          0000A  80 2DP-NAME
