* >Natural Source Header 000000 /*<RO>>
* :NatName XBDRSUIC
* :UID INTECO
* :Mode S
* :CP
* :Date 20060601
* :Time 2046000
* <Natural Source Header /*<<RO>
/* пюяоюйнбюрэ жекне ID хг гюохях днйслемрю
  FOR DR-AX-NUMBER = 1 TO UBDRMN0A.DR-AP-C
     IF UBDRMN0A.DR-AP-ATTR-ID(DR-AX-NUMBER) EQ &1& THEN
        MOVE UBDRMN0A.DR-AP-VALUE(DR-AX-NUMBER) TO &2&
     END-IF
  END-FOR

