* >Natural Source Header 000000 /*<RO>>
* :NatName XBDRSU2C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060624
* :Time 2104000
* <Natural Source Header /*<<RO>
/* –¿—œ¿ Œ¬¿“‹ 13.2 »« «¿œ»—» ƒŒ ”Ã≈Õ“¿
  RESET &2&
  FOR DR-AX-NUMBER = 1 TO DR-AP-C
     IF UBDRMN0A.DR-AP-ATTR-ID(DR-AX-NUMBER) EQ &1& THEN
        MOVE UBDRMN0A.DR-AP-VALUE(DR-AX-NUMBER) TO SX-NUMBER-NUMBER
        MOVE SX-NUMBER2-VALUE TO &2&
     END-IF
  END-FOR

