* >Natural Source Header 000000 /*<RO>>
* :NatName XBLTMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060620
* :Time 1808000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿: XBPRMN0S
/*
/* –¿«–¿¡Œ“◊» :   Œ¬¿À‹◊”  Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*   - ADD
/*   - READ
/*   - UPDADE
/*   - DELETE
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XBLTMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XDLTMN0A
END-DEFINE
DEFINE SUBROUTINE XBLTMN0S
RESET XXERX00A
/*
IF XBLTMN0A.TX-ID EQ 0 THEN MOVE XXCTXX0A.TX-ID TO XBLTMN0A.TX-ID END-IF
IF XBLTMN0A.TX-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
/*
DECIDE ON FIRST VALUE XBLTMN0A.BL-COMMAND
  VALUE "LOCK"
     PERFORM RECORD-LOCK
/*  VALUE "UNLOCK"
/*     PERFORM RECORD-UNLOCK
  VALUE "RELEASE"
     PERFORM RECORD-RELEASE
  NONE VALUE
     MOVE XBLTMN0A.BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/*
DEFINE SUBROUTINE RECORD-LOCK
  /* œÓÔÓ·ÛÂÏ Ì‡ÈÚË lock
  MOVE BY NAME XBLTMN0A TO XDLTMN0A
  MOVE "LOCATE" TO XDLTMN0A.DL-COMMAND
  PERFORM XDLTMN0S XXERX00A XDLTMN0A
  IF RETURN-CODE NE 0 THEN
     IF RETURN-CODE EQ EC-OBJECT-NOT-FOUND THEN
        MOVE 'ADD' TO XDLTMN0A.DL-COMMAND
        PERFORM XDLTMN0S XXERX00A XDLTMN0A
        IF RETURN-CODE NE 0 THEN
           IF RETURN-CODE EQ -1 AND ERROR-NUMBER EQ 3098 THEN
              RETURN-CODE := EC-OBJECT-ALREADY-LOCKED
           ELSE
              *ERROR-NR := EC-QUIT-STACK-TRACE
           END-IF
        END-IF
     ELSE
        *ERROR-NR := EC-QUIT-STACK-TRACE
     END-IF
  ELSE
     IF XBLTMN0A.TX-ID NE XDLTMN0A.TX-ID THEN
        RETURN-CODE := EC-OBJECT-ALREADY-LOCKED
     END-IF
  END-IF
/*
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-RELEASE
  /* ÓÒ‚Ó·Ó‰ËÏ ‚ÒÂ
  MOVE BY NAME XBLTMN0A TO XDLTMN0A
  MOVE "RELEASE" TO XDLTMN0A.DL-COMMAND
  PERFORM XDLTMN0S XXERX00A XDLTMN0A
  IF RETURN-CODE NE 0 THEN *ERROR-NR := EC-QUIT-STACK-TRACE END-IF
  /*
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END



