**C               *>Natural Source Header 000000
**C               *:NatName XBSOMN0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20000102
**C               *:Time 0000000
**C               *<Natural Source Header
**DS          0000      1XBSOMN0A
**DK          0000A  10 2BL-COMMAND
**DK          0000P  15 2SO-TYPE
**DK          0000P  15 2SO-ID
**DK          0000N   5 2SO-CODE
**DK          0000A  40 2SO-NAME
