* >Natural Source Header 000000 /*<RO>>
* :NatName XBSOMN0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20070627
* :Time 0954000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XBSOMN0A
/*PARAMETER USING UXCSXX0A
LOCAL USING XXXXEC0L
/*
LOCAL USING XPSOSR1L
LOCAL USING XXSOXX0L
/* ƒ¿ÌÌ˚Â
LOCAL USING XXZRXX0L
LOCAL USING XXTPXX0L
LOCAL USING MXDFXX0L
LOCAL
1 #I    (I4)
END-DEFINE
DEFINE SUBROUTINE XBSOMN0S
RESET XXERX00A
/*
PERFORM SO-LOAD
/*
DECIDE ON FIRST VALUE XBSOMN0A.BL-COMMAND
  VALUE "READ"
     PERFORM RECORD-READ
  VALUE "LOCATE"
     PERFORM RECORD-LOCATE
  NONE VALUE
     MOVE BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
DEFINE SUBROUTINE SO-LOAD
  DECIDE ON FIRST VALUE XBSOMN0A.SO-TYPE
  VALUE SO-TYPE-ZR
     MOVE BY NAME XXZRXX0L(*) TO XPSOSR1L.SO-LIST(*)
  VALUE SO-TYPE-TP
     MOVE BY NAME XXTPXX0L(*) TO XPSOSR1L.SO-LIST(*)
  VALUE SO-TYPE-DF
     MOVE BY NAME MXDFXX0L(*) TO XPSOSR1L.SO-LIST(*)
  NONE VALUE
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-DECIDE
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  IF XBSOMN0A.SO-ID EQ 0 THEN *ERROR-NR := EC-OBJECT-ID-REQUIRED END-IF
  FOR #I = 1 TO 12
     IF XBSOMN0A.SO-ID EQ XPSOSR1L.SO-ID(#I) THEN
        MOVE BY NAME XPSOSR1L.SO-LIST(#I) TO XBSOMN0A
        ESCAPE ROUTINE
     END-IF
  END-FOR
  MOVE XBSOMN0A.SO-ID TO ERROR-ADDITION(1)
  *ERROR-NR := EC-OBJECT-NOT-FOUND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-LOCATE
  IF XBSOMN0A.SO-CODE EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ATTRIBUTE-REQUIRED
  END-IF
  FOR #I = 1 TO 12
     IF XBSOMN0A.SO-CODE EQ XPSOSR1L.SO-CODE(#I) THEN
        MOVE BY NAME XPSOSR1L.SO-LIST(#I) TO XBSOMN0A
        ESCAPE ROUTINE
     END-IF
  END-FOR
  RESET XBSOMN0A
  MOVE XBSOMN0A.SO-CODE TO ERROR-ADDITION(1)
  RETURN-CODE := EC-OBJECT-NOT-FOUND
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END




