* >Natural Source Header 000000 /*<RO>>
* :NatName XBTBMN0S
* :UID INTECO
* :Mode S
* :CP
* :Date 20060607
* :Time 1807000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿:
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XBTBMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XDTBSH0L
LOCAL
1 #DP-ID   (N15)
1 REDEFINE #DP-ID
2 BLANK    (N5)
2 OG-ID    (N5)
2 DP-ID    (N5)
END-DEFINE
DEFINE SUBROUTINE XBTBMN0S
RESET XXERX00A
DECIDE ON FIRST VALUE XBTBMN0A.BL-COMMAND
  VALUE 'READ'
     PERFORM READ-RECORD
/*  VALUE 'CHEK'
/*     PERFORM CHEK-RECORD
/*  VALUE 'LOCATE'
/*     PERFORM LOCATE-RECORD
  NONE VALUE
     MOVE XBTBMN0A.BL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
DEFINE SUBROUTINE READ-RECORD
  IF XBTBMN0A.TB-ID = 0
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  MOVE XBTBMN0A.TB-ID TO XBTBMN0A.TB-CODE
  FIND TABEL-VIEW WITH TN-F = XBTBMN0A.TB-CODE
     IF NO RECORD
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     MOVE TABEL-VIEW.TN-F TO XBTBMN0A.TB-CODE
     MOVE TABEL-VIEW.FA-F TO XBTBMN0A.TB-FAMILY
     MOVE TABEL-VIEW.IM-F TO XBTBMN0A.TB-NAME
     MOVE TABEL-VIEW.OT-F TO XBTBMN0A.TB-OTCHEST
     MOVE 1000 TO #DP-ID.OG-ID
     MOVE TABEL-VIEW.PO-F TO #DP-ID.DP-ID
     MOVE #DP-ID TO XBTBMN0A.DP-ID
  END-FIND
END-SUBROUTINE
/*
/*DEFINE SUBROUTINE CHEK-RECORD
/*  WRITE 'CHEK-RECORD'
/*END-SUBROUTINE
/*
/*DEFINE SUBROUTINE LOCATE-RECORD
/*  WRITE 'LOCATE-RECORD'
/*END-SUBROUTINE
/*
INCLUDE XXERSY1C
/*
END-SUBROUTINE
END




