* >Natural Source Header 000000 /*<RO>>
* :NatName XDRBSU2C
* :UID PAUL
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
/* Распаковать число с двум  знаками из записи документа
VALUE &3&
  MOVE &1&.DR-AP-VALUE(&2&) TO SX-NUMBER-NUMBER
  MOVE SX-NUMBER2-VALUE TO &4&.&5&

