* >Natural Source Header 000000 /*<RO>>
* :NatName XDRBSUAC
* :UID PAUL
* :Mode S
* :CP
* :Date 20070716
* :Time 1321000
* <Natural Source Header /*<<RO>
/* –аспаковать строку из записи документа
VALUE &3&
  MOVE &1&.DR-AS-VALUE(&2&) TO &4&.&5&

