* >Natural Source Header 000000 /*<RO>>
* :NatName XDRBSUHC
* :UID PAUL
* :Mode S
* :CP
* :Date 20070716
* :Time 1954000
* <Natural Source Header /*<<RO>
FOR &2& = 1 TO &4&
   IF &1&.&3&(&2&) EQ 0 THEN ESCAPE TOP END-IF
   DECIDE ON FIRST VALUE &1&.&3&(&2&)
/* Это значение сюда вставлено, потому что есть бага в
/* компил торе Natural
   VALUE -999
     IGNORE

