* >Natural Source Header 000000 /*<RO>>
* :NatName XDRBSUIC
* :UID PAUL
* :Mode S
* :CP
* :Date 20070715
* :Time 2238000
* <Natural Source Header /*<<RO>
/* –аспаковать целое из записи документа
VALUE &3&
  MOVE &1&.DR-AP-VALUE(&2&) TO &4&.&5&

