* >Natural Source Header 000000 /*<RO>>
* :NatName XDTXMN0S
* :UID ARMK01
* :Mode S
* :CP
* :Date 20070628
* :Time 1434000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿:
/* œ–Œ√–¿ÃÃ¿: XDTRMA0S
/*
/* –¿«–¿¡Œ“◊» :   Œ¬¿À‹◊”  Œ.ƒ.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈:  ”–Œ¬≈Õ‹ ƒ¿ÕÕ€’ ¬€ƒ≈À≈Õ»≈ »ƒ≈Õ“≈‘» ¿“Œ–¿ “–¿Õ«¿ ÷»…
/*  ŒÃ¿Õƒ€:
/*  - TECHHOLD
/*  - TECHSET
/*  - READHOLD
/*  - READCODE
/*  - LOCATE
/*  - SET
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XDTXMN0A
/*
LOCAL USING XXXXEC0L
LOCAL USING UDXXID0L
LOCAL USING XDTXMN0L
END-DEFINE
DEFINE SUBROUTINE XDTXMN0S
RESET XXERX00A
/*
DECIDE ON FIRST VALUE DL-COMMAND
  VALUE 'TECHHOLD'
     PERFORM RECORD-TECH-PROCESS
  VALUE 'TECHSET'
     PERFORM RECORD-TECH-PROCESS
  VALUE 'READHOLD'
     PERFORM RECORD-READHOLD
  VALUE "READ"
     PERFORM RECORD-READ
  VALUE 'READCODE'
     PERFORM RECORD-READCODE
/*  VALUE 'LOCATE'
/*     PERFORM RECORD-LOCATE
  VALUE 'SET'
     PERFORM RECORD-SET
  NONE VALUE
     MOVE DL-COMMAND TO ERROR-ADDITION(1)
     *ERROR-NR := EC-UNKNOW-COMMAND
END-DECIDE
/***** –¿¡Œ“¿ — »ƒ≈Õ“≈‘» ¿“Œ–¿Ã» “–¿Õ«¿ ÷»… ****
/*
DEFINE SUBROUTINE RECORD-TECH-PROCESS
  FIND XX-TRANSACTION-TECH WITH TX-CODE EQ -1
     IF NO RECORD FOUND
        RESET XX-TRANSACTION-TECH.TX-ID
        XX-TRANSACTION-TECH.TX-CODE := -1
        XX-TRANSACTION-TECH.TX-COUNTER := 1
SM1.
        STORE XX-TRANSACTION-TECH
        INCLUDE UDXXID0C 'XX-TRANSACTION-TECH.TX-ID' '*ISN(SM1.)'
        IF DL-COMMAND EQ 'TECHSET' THEN
           MOVE XDTXMN0A.TX-COUNTER TO XX-TRANSACTION-TECH.TX-COUNTER
        END-IF
        UPDATE (SM1.)
        MOVE BY NAME XX-TRANSACTION-TECH TO XDTXMN0A
     END-NOREC
     IF DL-COMMAND EQ 'TECHSET' THEN
        MOVE XDTXMN0A.TX-COUNTER TO XX-TRANSACTION-TECH.TX-COUNTER
        UPDATE
     END-IF
     MOVE BY NAME XX-TRANSACTION-TECH TO XDTXMN0A
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READHOLD
  IF XDTXMN0A.TX-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND XX-TRANSACTION-VIEW WITH TX-ID EQ XDTXMN0A.TX-ID
     IF NO RECORD FOUND
        MOVE XDTXMN0A.TX-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     IF FALSE THEN UPDATE END-IF
     MOVE BY NAME XX-TRANSACTION-VIEW TO XDTXMN0A
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READ
  IF XDTXMN0A.TX-ID EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND XX-TRANSACTION-VIEW WITH TX-ID EQ XDTXMN0A.TX-ID
     IF NO RECORD FOUND
        MOVE XDTXMN0A.TX-ID TO ERROR-ADDITION(1)
        *ERROR-NR := EC-OBJECT-NOT-FOUND
     END-NOREC
     MOVE BY NAME XX-TRANSACTION-VIEW TO XDTXMN0A
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-READCODE
  IF XDTXMN0A.TX-CODE EQ 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND XX-TRANSACTION-VIEW WITH TX-CODE EQ XDTXMN0A.TX-CODE
     IF NO RECORD FOUND
        MOVE XDTXMN0A.TX-CODE TO ERROR-ADDITION(1)
        RETURN-CODE := EC-OBJECT-NOT-FOUND
     END-NOREC
     IF FALSE THEN UPDATE END-IF
     MOVE BY NAME XX-TRANSACTION-VIEW TO XDTXMN0A
  END-FIND
END-SUBROUTINE
/*
DEFINE SUBROUTINE RECORD-SET
  IF XDTXMN0A.TX-CODE LE 0 THEN
     *ERROR-NR := EC-OBJECT-ID-REQUIRED
  END-IF
  FIND XX-TRANSACTION-VIEW WITH TX-CODE EQ XDTXMN0A.TX-CODE
     IF NO RECORD FOUND
        MOVE BY NAME XDTXMN0A TO XX-TRANSACTION-VIEW
        RESET XX-TRANSACTION-VIEW.TX-ID
SM2.
        STORE XX-TRANSACTION-VIEW
        INCLUDE UDXXID0C 'XX-TRANSACTION-VIEW.TX-ID' '*ISN(SM2.)'
        UPDATE (SM2.)
        MOVE BY NAME  XX-TRANSACTION-VIEW TO XDTXMN0A
        ESCAPE ROUTINE
     END-NOREC
     MOVE XX-TRANSACTION-VIEW.TX-ID TO XDTXMN0A.TX-ID
     MOVE BY NAME XDTXMN0A TO XX-TRANSACTION-VIEW
     UPDATE
  END-FIND
END-SUBROUTINE
/*
/*DEFINE SUBROUTINE RECORD-LOCATE
/*  IF XDTXMN0A.TX-OBJECT-ID EQ 0 THEN
/*     *ERROR-NR := EC-OBJECT-ID-REQUIRED
/*  END-IF
/*  IF XDTXMN0A.TX-OBJECT-TYPE-ID EQ 0 THEN
/*     *ERROR-NR := EC-OBJECT-TYPE-REQUIRED
/*  END-IF
/*  MOVE XDTXMN0A.TX-OBJECT-TYPE-ID TO TX-OBJECT-SUPER.TX-OBJECT-TYPE-ID
/*  MOVE XDTXMN0A.TX-OBJECT-ID TO TX-OBJECT-SUPER.TX-OBJECT-ID
/*  MOVE TRUE TO TX-OBJECT-SUPER.TX-IS-OPEN
/*  FIND XX-TRANSACTION-VIEW WITH TX-OBJECT-SUPER EQ TX-OBJECT-SUPER
/*     IF NO RECORD FOUND
/*        MOVE XDTXMN0A.TX-OBJECT-ID TO ERROR-ADDITION(1)
/*        MOVE XDTXMN0A.TX-OBJECT-TYPE-ID TO ERROR-ADDITION(2)
/*        RETURN-CODE := EC-OBJECT-NOT-FOUND
/*     END-NOREC
/*     MOVE BY NAME XX-TRANSACTION-VIEW TO XDTXMN0A
/*  END-FIND
/*END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END


