**C               *>Natural Source Header 000000
**C               *:NatName XMBMXX1A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060609
**C               *:Time 1607000
**C               *<Natural Source Header
**DS          0000      1XMBMXX1A
**DK          0000A  10 2BM-COMMAND
**DK          0000A  10 2BO-COMMAND-PROCESS
**DK          0000P  15 2BM-OBJECT
