* >Natural Source Header 000000 /*<RO>>
* :NatName XPASCH0C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060610
* :Time 2357000
* <Natural Source Header /*<<RO>
/* опнбепйю онкеи рхою дюрю
IF &1& EQ " " THEN
  CP-CURS-FIELD := POS(&2&)
  INCLUDE XXERUS1C '2305'
END-IF

