* >Natural Source Header 000000 /*<RO>>
* :NatName XPCBAD0C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060606
* :Time 1145000
* <Natural Source Header /*<<RO>
ADD 1 TO CB-LIST-C
CB-CMD-INT(CB-LIST-C) := &1&
CB-CMD-CODE(CB-LIST-C) := &2&
CB-BAR-NAME(CB-LIST-C) := &3&

