* >Natural Source Header 000000 /*<RO>>
* :NatName XPCKAD4C
* :UID PAUL
* :Mode S
* :CP
* :Date 20070624
* :Time 1901000
* <Natural Source Header /*<<RO>
INCLUDE XPCKAD0C "'EXIT'" &1& "'PF3'" '"Выход"'
INCLUDE XPCKAD0C "'EXIT'" &1& "'CLR'" '"Выход"'

