* >Natural Source Header 000000 /*<RO>>
* :NatName XPCPRS0C
* :UID Админист
* :Mode S
* :CP
* :Date 20050916
* :Time 2215000
* <Natural Source Header /*<<RO>
RESET CB-LIST-C CB-LIST(*)
      CK-LIST-C CK-LIST(*)
      CM-LIST-C CM-LIST(*)
      CS-LIST-C CS-LIST(*)

