* >Natural Source Header 000000 /*<RO>>
* :NatName XPCSAD0C
* :UID Админист
* :Mode S
* :CP
* :Date 20050916
* :Time 2215000
* <Natural Source Header /*<<RO>

ADD 1 TO CS-LIST-C
CS-CMD-SHORT(CS-LIST-C) := &1&
CS-CMD-CODE(CS-LIST-C) := &2&

