**C               *>Natural Source Header 000000
**C               *:NatName XPDMSC0L
**C               *:UID Админист
**C               *:Mode S
**C               *:CP
**C               *:Date 20050923
**C               *:Time 1423000
**C               *<Natural Source Header
**DS          0000      1XPDMSC0L
**DK          0000N   5 2DM-CODE
**DK          0000A  44 2DM-NAME
