**C               *>Natural Source Header 000000
**C               *:NatName XPDPSR0L
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070624
**C               *:Time 1450000
**C               *<Natural Source Header
**DS          0000      1XPDPSR0L
**DS I1       0000      2DP-LIST                         (1:7)
**DK          0000A   2 3CP-CMD
**DK          0000N   5 3DP-CODE
**DK          0000A  72 3DP-NAME
