* >Natural Source Header 000000 /*<RO>>
* :NatName XPDRSU7C
* :UID OLEG
* :Mode S
* :CP
* :Date 20061016
* :Time 1224000
* <Natural Source Header /*<<RO>
/* –¿—œ¿ Œ¬¿“‹ »« –15 ¬ N8.7
  RESET &2&
  MOVE &1& TO SX-NUMBER-NUMBER
  MOVE SX-NUMBER7-VALUE TO &2&

