* >Natural Source Header 000000 /*<RO>>
* :NatName XPDRSU2C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060602
* :Time 1230000
* <Natural Source Header /*<<RO>
/* –¿—œ¿ Œ¬¿“‹ »« –15 ¬ N13.2
  RESET &2&
  MOVE &1& TO SX-NUMBER-NUMBER
  MOVE SX-NUMBER2-VALUE TO &2&

