**C               *>Natural Source Header 000000
**C               *:NatName XPEISC0L
**C               *:UID Админист
**C               *:Mode S
**C               *:CP
**C               *:Date 20050916
**C               *:Time 2215000
**C               *<Natural Source Header
**DS          0000      1XPEISC0L
**DK          0000N   5 2EI-CODE
**DK          0000A  50 2EI-NAME
