**C               *>Natural Source Header 000000
**C               *:NatName XPGMSC0L
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060511
**C               *:Time 0141000
**C               *<Natural Source Header
**DS          0000      1XPGMSC0L
**DK          0000N   5 2GM-CODE
**DK          0000A  60 2GM-NAME
