**C               *>Natural Source Header 000000
**C               *:NatName XPGMSR0L
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060511
**C               *:Time 0149000
**C               *<Natural Source Header
**DS          0000      1XPGMSR0L
**DS I1       0000      2GM-LIST                         (1:7)
**DK          0000A   2 3CP-CMD
**DK          0000N   5 3GM-CODE
**DK          0000A  60 3GM-NAME
