* >Natural Source Header 000000 /*<RO>>
* :NatName XPMFOT0C
* :UID OLEG
* :Mode S
* :CP
* :Date 20061011
* :Time 2344000
* <Natural Source Header /*<<RO>
DEFINE SUBROUTINE SCREEN-INIT
  CP-MSG-POS := 3
  INCLUDE XPCPOT0C
END-SUBROUTINE
/*
INCLUDE XPMXXX1C "SCREEN-SHOW" &1& "OFF" "3"
/*
/*
DEFINE SUBROUTINE COMMAND-CHECK
  RESET XXERX00A CP-COMMAND CP-CMD-EXIT
  INCLUDE XPCKCH0C
END-SUBROUTINE

