* >Natural Source Header 000000 /*<RO>>
* :NatName XPMFOT1C
* :UID Админист
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
DEFINE SUBROUTINE SCREEN-INIT
  CP-MSG-POS := 3
  INCLUDE XPCPOT0C
END-SUBROUTINE
/*
INCLUDE XPMXXX1C &1& "OFF"
/*
/*
DEFINE SUBROUTINE COMMAND-CHECK
  RESET XXERX00A CP-COMMAND CP-CMD-EXIT
  INCLUDE XPCKCH0C
END-SUBROUTINE

