* >Natural Source Header 000000 /*<RO>>
* :NatName XPMFSH1C
* :UID Админист
* :Mode S
* :CP
* :Date 20060911
* :Time 1024000
* <Natural Source Header /*<<RO>
DEFINE SUBROUTINE SCREEN-INIT
  CP-MSG-POS := 3
  INCLUDE XPCPIN1C
END-SUBROUTINE
/*
INCLUDE XPMXXX1C &1& "OFF"
/*
/*
DEFINE SUBROUTINE COMMAND-CHECK
  RESET XXERX00A CP-COMMAND CP-CMD-EXIT
  INCLUDE XPCKCH0C
END-SUBROUTINE

