* >Natural Source Header 000000 /*<RO>>
* :NatName XPMFSH0C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060929
* :Time 1043000
* <Natural Source Header /*<<RO>
DEFINE SUBROUTINE SCREEN-INIT
  CP-MSG-POS := 3
  INCLUDE XPCPIN1C
END-SUBROUTINE
/*
INCLUDE XPMXXX1C "SCREEN-SHOW" &1& "OFF" "3"
/*
/*
DEFINE SUBROUTINE COMMAND-CHECK
  RESET XXERX00A CP-COMMAND CP-CMD-EXIT
  INCLUDE XPCKCH0C
END-SUBROUTINE

