**C               *>Natural Source Header 000000
**C               *:NatName XPMNXX0A
**C               *:UID PAUL
**C               *:Mode S
**C               *:CP
**C               *:Date 20070108
**C               *:Time 1521000
**C               *<Natural Source Header
**DS          0000      1XPMNXX0A
**DS I1       0000      2MENU-G                          (1:20)
**DK          0000A  30 3MENU-ITEM
**DK          0000A  10 3MENU-CMD
