**C               *>Natural Source Header 000000
**C               *:NatName XPMOSC0L
**C               *:UID Админист
**C               *:Mode S
**C               *:CP
**C               *:Date 20050916
**C               *:Time 2215000
**C               *<Natural Source Header
**DS          0000      1XPMOSC0L
**DK          0000N   5 2MO-CODE
**DK          0000N   5 2MO-PO
**DK          0000A  50 2MO-NAME
