**C               *>Natural Source Header 000000
**C               *:NatName XPMTSC0L
**C               *:UID OLEG
**C               *:Mode S
**C               *:CP
**C               *:Date 20060425
**C               *:Time 1247000
**C               *<Natural Source Header
**DS          0000      1XPMTSC0L
**DK          0000A  22 2MT-CODE
**DK          0000N   5 2MT-GR
**DK          0000A  50 2MT-NAME
