**C               *>Natural Source Header 000000
**C               *:NatName XPMTSH0A
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060701
**C               *:Time 1558000
**C               *<Natural Source Header
**DS          0000      1XPMTSH0A
**DK          0000A  10 2SH-COMMAND
**DK          0000A  40 2MT-SEARCH
**DK          0000N   5 2MT-GR
