**C               *>Natural Source Header 000000
**C               *:NatName XPTBSC0L
**C               *:UID Админист
**C               *:Mode S
**C               *:CP
**C               *:Date 20050926
**C               *:Time 2227000
**C               *<Natural Source Header
**DS          0000      1XPTBSC0L
**DK          0000N   5 2TB-CODE
**DK          0000N   5 2TB-POD
**DK          0000A  20 2TB-FAM
