* >Natural Source Header 000000 /*<RO>>
* :NatName XPVOSH0S
* :UID PAUL
* :Mode S
* :CP
* :Date 20070220
* :Time 1922000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿: œŒ»—  ¬ —œ–¿¬Œ◊Õ» ≈
/*
/* –¿«–¿¡Œ“◊» :
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: œŒ»—  ¬ —œ–¿¬Œ◊Õ» ≈ ¬Õ≈ÿÕ»’ Œ–√¿Õ»«¿÷»…
/*  ŒÃ¿Õƒ€:
/*  - LOCATE
/*  - SELECT
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
PARAMETER USING XXCTXX0A
PARAMETER USING XPVOSH0A
/*
LOCAL USING XXXXEC0L
LOCAL USING XPVOSC0L
LOCAL USING XPVOSR0L
LOCAL USING STEKL
LOCAL USING LCLVOL
LOCAL USING MBVOMN0A
LOCAL
1 #VO-ID      (N15)
1 REDEFINE #VO-ID
2 BLANK       (N5)
2 OG-ID       (N5)
2 VO-ID       (N5)
/*
1 #VO-START   (A30/1:5)
1 #VO-STOP    (A30/1:5)
1 #VO-FULL    (A250)
1 #COUNT      (I4)
1 #FLAG       (L)
1 #POSITION   (I4)
1 #SELECTED   (P13)
1 #VO-CODE    (N5)
1 #NUMBER     (P10)
/*
1 KEYVO(A10)
1 REDEFINE KEYVO
  2 KEYVOOG(N5)  2 KEYVOVO(N5)
1 KEYVO1(A10)
1 REDEFINE KEYVO1
  2 KEYVO1OG(N5)  2 KEYVO1VO(N5)
1 KEYINN(A25)
1 REDEFINE KEYINN
  2 KEYINNOG(N5)  2 KEYINNINN(A20)
1 CNTST(N5) INIT < 200 >
1 LEN-ST-VO(B4) INIT < 200 >
1 STEKVO
2 VO-ID    (P13)
2 VO-CODE  (N5)
2 VO-INN   (A14)
2 VO-KPP   (A14)
2 VO-NAME  (A80)
2 VO-ADDR  (A80)
1 C-Z(C/7)
END-DEFINE
DEFINE SUBROUTINE XPVOSH0S
/*
DEFINE WINDOW WINDOW-RESULT
  SIZE 20*80
  BASE 5/1
  TITLE "Õ¿…ƒ≈ÕÕ€≈ Œ–√¿Õ»«¿÷»»"
  FRAMED ON
/*
DEFINE WINDOW WINDOW-CRITERY
  SIZE 18*80
  BASE 7/1
  TITLE "œ¿–¿Ã≈“–€ Œ“¡Œ–¿ Œ–√¿Õ»«¿÷»»"
  FRAMED ON
/*
SET KEY ALL
SET CONTROL 'MT'
RESET RETURN-CODE XPVOSH0A.VO-ID XPVOSH0A.VO-NAME XPVOSH0A.VO-ADDR
     XPVOSH0A.VO-INN XPVOSH0A.VO-KPP
/*MOVE BY NAME XPVOSH0A TO XPVOSC0L
/*
DECIDE ON FIRST VALUE SH-COMMAND
  VALUE 'LOCATE'
     PERFORM VO-LOCATE
  VALUE 'SELECT'
     PERFORM VO-SELECT
  NONE VALUE
     INCLUDE XXERUS1C '2201'
END-DECIDE
/*
IF XPVOSH0A.VO-ID NE 0 THEN
  MOVE XPVOSH0A.VO-ID TO #VO-ID.VO-ID
  #VO-ID.OG-ID := XXCTXX0A.VO-OG-ID
  MOVE #VO-ID TO XPVOSH0A.VO-ID
  MOVE XPVOSH0A.VO-ID TO MBVOMN0A.VO-ID
  MOVE "READ" TO MBVOMN0A.BL-COMMAND
  PERFORM MBVOMN0S XXERX00A XXCTXX0A MBVOMN0A
  IF RETURN-CODE EQ 0 THEN
     MOVE BY NAME MBVOMN0A TO XPVOSH0A
  END-IF
END-IF

/*
SET WINDOW OFF
/*
DEFINE SUBROUTINE VO-LOCATE
  MOVE VO-SEARCH TO  XPVOSC0L.VO-NAME
  IF NOT VO-SEARCH IS (N5) THEN
     EXAMINE VO-SEARCH FOR " " GIVING LENGTH #NUMBER
     IF #NUMBER < 3 THEN
        INCLUDE XXERUS1C '2413'
     END-IF
  END-IF
  PERFORM VO-SEARCH
  IF #COUNT EQ 0 THEN
     INCLUDE XXERUS1C '2401'
  ELSE
     IF #COUNT EQ 1 THEN
        MOVE BY NAME STEKVO TO XPVOSH0A
        ESCAPE ROUTINE
     END-IF
     PERFORM VO-SHOW
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE VO-SELECT
  PERFORM VO-CRITERY
  IF *PF-KEY NE 'PF3' THEN
     PERFORM VO-SHOW
  END-IF
END-SUBROUTINE
/*
DEFINE SUBROUTINE VO-SHOW
  SET WINDOW 'WINDOW-RESULT'
  SET KEY NAMED OFF
  SET KEY ENTR NAMED '¬€¡–“'
  SET KEY PF3 NAMED '¬€’Œƒ'
  SET KEY PF7 NAMED 'Õ¿«¿ƒ'
  SET KEY PF8 NAMED '¬œ≈–≈ƒ'
  SET KEY PF6 NAMED 'œ¿–¿Ã'
  RESET #SELECTED
  #N := 1
  REPEAT
    PERFORM VO-LIST
     INPUT USING MAP 'XPVOSR0M'
     IF *PF-KEY EQ 'PF6' THEN
        PERFORM VO-CRITERY
        SET WINDOW 'WINDOW-RESULT'
        SET KEY NAMED OFF
        SET KEY ENTR NAMED '¬€¡–“'
        SET KEY PF3 NAMED '¬€’Œƒ'
        SET KEY PF7 NAMED '¬œ≈–ƒ'
        SET KEY PF8 NAMED 'Õ¿«¿ƒ'
        SET KEY PF6 NAMED 'œ¿–¿Ã'
        RESET #SELECTED
     END-IF
     IF *PF-KEY EQ 'PF3' THEN
        RESET #SELECTED
        ESCAPE BOTTOM
     END-IF
     IF *PF-KEY EQ 'PF7' AND #N > 7
        ADD -7 TO #N
     END-IF
     IF *PF-KEY EQ 'PF8' AND #K < #COUNT
        ADD 7 TO #N
     END-IF
     IF *PF-KEY EQ 'ENTR' THEN
        FOR #I = 1 TO 7
           IF *CURS-FIELD EQ POS(CP-CMD(#I)) THEN
              #SELECTED := XPVOSR0L.VO-ID(#I)
              XPVOSH0A.VO-INN := XPVOSR0L.VO-INN(#I)
              XPVOSH0A.VO-KPP := XPVOSR0L.VO-KPP(#I)
              XPVOSH0A.VO-ID := XPVOSR0L.VO-ID(#I)
              XPVOSH0A.VO-CODE := XPVOSR0L.VO-CODE(#I)
              XI := #N + #I - 1  CALL 'RWSX' XI STEKVO.VO-ID XR XN1
              XPVOSH0A.VO-NAME := STEKVO.VO-NAME
              XPVOSH0A.VO-ADDR := STEKVO.VO-ADDR
              ESCAPE ROUTINE
           END-IF
        END-FOR
     END-IF
  END-REPEAT
END-SUBROUTINE
/*
DEFINE SUBROUTINE VO-CRITERY
  SET WINDOW 'WINDOW-CRITERY'
  SET KEY NAMED OFF
  SET KEY ENTR NAMED '»— ¿“'
  SET KEY PF3 NAMED '¬€’Œƒ'
  REPEAT
     INPUT USING MAP 'XPVOSC0M'
     IF *PF-KEY EQ 'PF3' THEN
        RESET #SELECTED
        ESCAPE BOTTOM
     END-IF
     IF *PF-KEY EQ 'ENTR'
        IF XPVOSC0L.VO-NAME NE " " THEN
           EXAMINE XPVOSC0L.VO-NAME FOR " " GIVING LENGTH #NUMBER
           IF #NUMBER < 3 THEN
              REINPUT *2413 MARK *XPVOSC0L.VO-NAME
           END-IF
        END-IF
        IF XPVOSC0L.VO-ADDR NE " " THEN
           EXAMINE XPVOSC0L.VO-ADDR FOR " " GIVING LENGTH #NUMBER
           IF #NUMBER < 3 THEN
              REINPUT *2413 MARK *XPVOSC0L.VO-ADDR
           END-IF
        END-IF
        IF XPVOSC0L.VO-KPP NE ' ' AND XPVOSC0L.VO-INN EQ ' ' THEN
           REINPUT 'œË ÛÍ‡Á‡ÌËË  œœ ÚÂ·ÛÂÚÒ  ÛÍ‡Á‡ÌËÂ »ÕÕ'
                 MARK *XPVOSC0L.VO-INN
        END-IF
        PERFORM VO-SEARCH
        ESCAPE ROUTINE
     END-IF
  END-REPEAT
END-SUBROUTINE
/*
DEFINE SUBROUTINE VO-LIST
  RESET XPVOSR0L.VO-LIST(*)
  #K := #N + 6  #L := 0  C-Z(*) := (AD=PN)
  FOR #I #N #K
    IF #I <= #COUNT  XI := #I  CALL 'RWSX' XI STEKVO.VO-ID XR XN1
      #SELECTED := STEKVO.VO-ID
      ADD 1 TO #L  RESET C-Z(#L)
      MOVE BY NAME STEKVO TO XPVOSR0L.VO-LIST(#L)
      COMPRESS STEKVO.VO-NAME STEKVO.VO-ADDR
      INTO XPVOSR0L.VO-DESCRIPTION(#L)
    END-IF
  END-FOR
END-SUBROUTINE
/*
DEFINE SUBROUTINE VO-SEARCH
  XI := CNTST  CALL 'GTSX' LEN-ST-VO XI XN1
  RESET #COUNT #NUMBER
  #N := XW := 1  KEYVOOG := KEYVO1OG := KEYINNOG := XXCTXX0A.VO-OG-ID  RESET #COUNT
  IF XPVOSC0L.VO-CODE NE 0 THEN
     #VO-CODE := KEYVOVO := XPVOSC0L.VO-CODE
     FIND IBS-KVO-FILE OG-VO = KEYVO
        WHERE (XPVOSC0L.VO-KPP = ' ' OR = IBS-KVO-FILE.NM-PL)
          AND (XPVOSC0L.VO-INN = ' ' OR = IBS-KVO-FILE.NN-ID)
        PERFORM VO2STEK
     END-FIND
     ESCAPE ROUTINE
  END-IF
  IF XPVOSC0L.VO-INN NE ' '  KEYINNINN := XPVOSC0L.VO-INN
     FIND IBS-KVO-FILE OG-INN = KEYINN
       ACCEPT
       IF XPVOSC0L.VO-KPP = ' ' OR = IBS-KVO-FILE.NM-PL
       PERFORM VO2STEK
     END-FIND
     ESCAPE ROUTINE
  END-IF
  IF VO-SEARCH NE " " THEN
     IF VO-SEARCH IS (N5) THEN
        #VO-CODE := KEYVOVO := VAL(VO-SEARCH)
FL1.
        FIND IBS-KVO-FILE OG-VO = KEYVO
           WHERE (XPVOSC0L.VO-KPP = ' ' OR = IBS-KVO-FILE.NM-PL)
              AND (XPVOSC0L.VO-INN = ' ' OR = IBS-KVO-FILE.NN-ID)
           PERFORM VO2STEK
        END-FIND
     END-IF
     KEYINNINN := VO-SEARCH
     FIND IBS-KVO-FILE OG-INN = KEYINN
       PERFORM VO2STEK
     END-FIND
  END-IF
  COMPRESS XPVOSC0L.VO-NAME XPVOSC0L.VO-ADDR TO #VO-FULL
  SEPARATE #VO-FULL INTO #VO-START(*) WITH DELIMITER " "
  MOVE #VO-START(*) TO #VO-STOP(*)
  FOR #I = 1 TO 5
    IF #VO-START(#I) EQ " " THEN ESCAPE BOTTOM END-IF
    COMPRESS SUBSTRING(#VO-START(#I),1,29) H'00' INTO #VO-START(#I)
             LEAVING NO
    COMPRESS SUBSTRING(#VO-STOP(#I),1,29) H'FF' INTO #VO-STOP(#I)
             LEAVING NO
    #J := #I
  END-FOR
/*  WRITE #J #VO-START(1) #VO-STOP(1)
  DECIDE ON FIRST VALUE #J
  VALUE 1
     FIND IBS-KVO-FILE VO-NM-SH = #VO-START(1) THRU #VO-STOP(1)
        PERFORM VO2STEK
     END-FIND
  VALUE 2
     FIND IBS-KVO-FILE VO-NM-SH = #VO-START(1) THRU #VO-STOP(1) AND
                       VO-NM-SH = #VO-START(2) THRU #VO-STOP(2)
        PERFORM VO2STEK
     END-FIND
  VALUE 3
     FIND IBS-KVO-FILE VO-NM-SH = #VO-START(1) THRU #VO-STOP(1) AND
                       VO-NM-SH = #VO-START(2) THRU #VO-STOP(2) AND
                       VO-NM-SH = #VO-START(3) THRU #VO-STOP(3)
        PERFORM VO2STEK
     END-FIND
  VALUE 4
     FIND IBS-KVO-FILE VO-NM-SH = #VO-START(1) THRU #VO-STOP(1) AND
                       VO-NM-SH = #VO-START(2) THRU #VO-STOP(2) AND
                       VO-NM-SH = #VO-START(3) THRU #VO-STOP(3) AND
                       VO-NM-SH = #VO-START(4) THRU #VO-STOP(4)
        PERFORM VO2STEK
     END-FIND
  VALUE 5
     FIND IBS-KVO-FILE VO-NM-SH = #VO-START(1) THRU #VO-STOP(1) AND
                       VO-NM-SH = #VO-START(2) THRU #VO-STOP(2) AND
                       VO-NM-SH = #VO-START(3) THRU #VO-STOP(3) AND
                       VO-NM-SH = #VO-START(4) THRU #VO-STOP(4) AND
                       VO-NM-SH = #VO-START(5) THRU #VO-STOP(5)
        PERFORM VO2STEK
     END-FIND
  NONE VALUE
     IGNORE
  END-DECIDE
END-SUBROUTINE
/*
DEFINE SUBROUTINE FIND-BY-NAME
  IF IBS-KVO-FILE.OG-ID NE XXCTXX0A.VO-OG-ID THEN ESCAPE ROUTINE END-IF
  IF XPVOSC0L.VO-NAME NE " "  THEN
     EXAMINE IBS-KVO-FILE.NM-OG FOR XPVOSC0L.VO-NAME GIVING #NUMBER
     IF #NUMBER EQ 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  IF XPVOSC0L.VO-ADDR NE " "  THEN
     EXAMINE IBS-KVO-FILE.AD-OG FOR XPVOSC0L.VO-ADDR GIVING #NUMBER
     IF #NUMBER EQ 0 THEN ESCAPE ROUTINE END-IF
  END-IF
  PERFORM VO2STEK
END-SUBROUTINE
/*
DEFINE SUBROUTINE VO2STEK
  STEKVO.VO-ID := STEKVO.VO-CODE := IBS-KVO-FILE.VO-ID
  STEKVO.VO-INN := IBS-KVO-FILE.NN-ID
  STEKVO.VO-KPP := IBS-KVO-FILE.NM-PL
  STEKVO.VO-NAME := IBS-KVO-FILE.NM-OG
  STEKVO.VO-ADDR := IBS-KVO-FILE.AD-OG
  ADD 1 TO #COUNT
  IF #COUNT > CNTST  #K := XI := CNTST  CALL 'GTSX' LEN-ST-VO XI XN2
    FOR #I 1 CNTST  XI := #I  CALL 'RWSX' XI STEKVO.VO-ID XR XN1
      CALL 'RWSX' XI STEKVO.VO-ID XW XN2
    END-FOR
    CALL 'FRSX' XN1
    ADD 200 TO CNTST  XI := CNTST  CALL 'GTSX' LEN-ST-VO XI XN1
    FOR #I 1 #K  XI := #I  CALL 'RWSX' XI STEKVO.VO-ID XR XN2
      CALL 'RWSX' XI STEKVO.VO-ID XW XN1
    END-FOR
    CALL 'FRSX' XN2
  END-IF
  XI := #COUNT  CALL 'RWSX' XI STEKVO.VO-ID XW XN1
END-SUBROUTINE
/*
INCLUDE XXERSY1C
END-SUBROUTINE
END
