**C               *>Natural Source Header 000000
**C               *:NatName XPXXEC0L
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060501
**C               *:Time 1231000
**C               *<Natural Source Header
**DS          0000      1XPXXEC0L
**DKC  S      0002I   2C2EC-SCREEN-BAR-UNKNOW
**HS0001
**I                      2101
