**C               *>Natural Source Header 000000
**C               *:NatName XPZKSR0L
**C               *:UID MSA
**C               *:Mode S
**C               *:CP
**C               *:Date 20060504
**C               *:Time 2212000
**C               *<Natural Source Header
**DS          0000      1XPZKSR0L
**DS I1       0000      2ZK-LIST                         (1:7)
**DK          0000A   2 3CP-CMD
**DK          0000A  22 3ZK-CODE
**DK          0000A  72 3ZK-NAME
