**C               *>Natural Source Header 000000
**C               *:NatName XPZKSC0L
**C               *:UID MSA
**C               *:Mode S
**C               *:CP
**C               *:Date 20060504
**C               *:Time 2211000
**C               *<Natural Source Header
**DS          0000      1XPZKSC0L
**DK          0000A  22 2ZK-CODE
**DK          0000N   5 2ZK-BS
**DK          0000A  50 2ZK-NAME
