* >Natural Source Header 000000 /*<RO>>
* :NatName XTGMSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060612
* :Time 1730000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPGMSH0A
END-DEFINE
SH-COMMAND := 'SELECT'
GM-OG-ID := 1000

/* GM-SEARCH := '«¿Œ'
PERFORM XPGMSH0S XXERX00A XXCTXX0A XPGMSH0A
* PRINT XXERX00A
PRINT XPGMSH0A
END
