* >Natural Source Header 000000 /*<RO>>
* :NatName XTTBSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060717
* :Time 2254000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPTBSH0A
END-DEFINE
SH-COMMAND := "LOCATE"
TB-SEARCH := '2184'  VO-OG-ID := 1000
PERFORM XPTBSH0S XXERX00A XXCTXX0A XPTBSH0A
* PRINT XXERX00A
PRINT RETURN-CODE ERROR-NUMBER XPTBSH0A
END
