* >Natural Source Header 000000 /*<RO>>
* :NatName XTVOSH0P
* :UID ARMK02
* :Mode S
* :CP
* :Date 20061129
* :Time 1019000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPVOSH0A
END-DEFINE
SH-COMMAND := 'LOCATE'
VO-SEARCH := 'ÈHTE'  VO-OG-ID := 1000
PERFORM XPVOSH0S XXERX00A XXCTXX0A XPVOSH0A
* PRINT XXERX00A
PRINT XPVOSH0A
END
