* >Natural Source Header 000000 /*<RO>>
* :NatName XTZKSH0P
* :UID INTECO
* :Mode S
* :CP
* :Date 20060605
* :Time 0101000
* <Natural Source Header /*<<RO>
DEFINE DATA
LOCAL USING XXERX00A
LOCAL USING XXCTXX0A
LOCAL USING XPZKSH0A
END-DEFINE
OG-ID := 1000
SH-COMMAND := 'SELECT'
ZK-SEARCH := ' '
PERFORM XPZKSH0S XXERX00A XXCTXX0A XPZKSH0A
* PRINT XXERX00A
PRINT XPZKSH0A.ZK-ID
END
