* >Natural Source Header 000000 /*<RO>>
* :NatName XXERSY2C
* :UID PAUL
* :Mode S
* :CP
* :Date 20070121
* :Time 1730000
* <Natural Source Header /*<<RO>
/*
ON ERROR
  IF XXERX00A.ERROR-STACK-C EQ 0 THEN
     XXERX00A.ERROR-MODULE := *PROGRAM
     XXERX00A.ERROR-LINE := *ERROR-LINE
     XXERX00A.ERROR-NUMBER := *ERROR-NR
  END-IF
  PERFORM XXEREXTS XXERX00A
  PERFORM ERROR-RECOVER
  ESCAPE ROUTINE
END-ERROR
