* >Natural Source Header 000000 /*<RO>>
* :NatName XXERUS3C
* :UID INTECO
* :Mode S
* :CP
* :Date 20000102
* :Time 0000000
* <Natural Source Header /*<<RO>
/*
 XXERX00A.RETURN-CODE := -1
 XXERX00A.ERROR-MODULE := *PROGRAM;
 XXERX00A.ERROR-NUMBER := &1&
/*
