* >Natural Source Header 000000 /*<RO>>
* :NatName XXEREXTS
* :UID PAUL
* :Mode S
* :CP
* :Date 20070121
* :Time 1903000
* <Natural Source Header /*<<RO>
/***********************************************************************
/*
/* —»—“≈Ã¿: ARM-K
/* œ–Œ√–¿ÃÃ¿: œ–Œ—ÃŒ“–
/*
/* –¿«–¿¡Œ“◊» : ”«Œ–»Õ œ.¿.
/* ƒ¿“¿ ¬€œ”— ¿:
/*
/* Õ¿«¬¿Õ»≈: œ–Œ—ÃŒ“– —»—“≈ÃÕ€’ Œÿ»¡Œ 
/*  ŒÃ¿Õƒ€:
/*
/* »—œ–¿¬À≈Õ»ﬂ:
/*
/***********************************************************************
DEFINE DATA
PARAMETER USING XXERX00A
LOCAL USING USR2006A
LOCAL USING XXXXEC0L
LOCAL
1 #ADD-OCCURENCE (N1)
1 #ADD-RESPONSE (N4)
1 #ER-MAX     (I4)
1 #ER-INDEX   (I4)
1 #ER-ET      (I4)
END-DEFINE
DEFINE SUBROUTINE XXEREXTS
ER-INDEX := 0
CALLNAT "USR2006N" USR2006A
IF XXERX00A.ERROR-STACK-C EQ 0 THEN
   IF USR2006A.ER-ET EQ 4 THEN
     RETURN-CODE := -1
   ELSE
     CALLNAT "USR2009N" ERROR-ADDITION(*) #ADD-OCCURENCE #ADD-RESPONSE
     MOVE USR2006A.ER-ET TO #ER-ET
     RETURN-CODE := -2 - #ER-ET
   END-IF
END-IF
#ER-MAX := 1
REPEAT
  ER-INDEX := #ER-MAX
  CALLNAT "USR2006N" USR2006A
  IF ER-RESPONSE NE 0 THEN
     SUBTRACT 1 FROM #ER-MAX
     ESCAPE BOTTOM
  END-IF
  ADD 1 TO #ER-MAX
END-REPEAT
FOR #ER-INDEX = #ER-MAX TO 1 STEP -1
  ER-INDEX := #ER-INDEX
  CALLNAT "USR2006N" USR2006A
  IF ER-RESPONSE EQ 0 THEN
     ADD 1 TO XXERX00A.ERROR-STACK-C
     IF XXERX00A.ERROR-STACK-C < 21 THEN
MOVE USR2006A.ER-DBID TO XXERX00A.ERROR-STACK-DBID(ERROR-STACK-C)
MOVE USR2006A.ER-FNR TO XXERX00A.ERROR-STACK-FNR(ERROR-STACK-C)
MOVE USR2006A.ER-LIBRARY TO XXERX00A.ERROR-STACK-LIBRARY(ERROR-STACK-C)
MOVE USR2006A.ER-PROGRAM TO XXERX00A.ERROR-STACK-MODULE(ERROR-STACK-C)
MOVE USR2006A.ER-LINE TO XXERX00A.ERROR-STACK-LINE(ERROR-STACK-C)
MOVE USR2006A.ER-NUMBER TO XXERX00A.ERROR-STACK-ERROR(ERROR-STACK-C)
MOVE USR2006A.ER-MC TO XXERX00A.ERROR-STACK-MC(ERROR-STACK-C)
MOVE USR2006A.ER-EC TO XXERX00A.ERROR-STACK-EC(ERROR-STACK-C)
MOVE USR2006A.ER-ET TO XXERX00A.ERROR-STACK-ET(ERROR-STACK-C)
     END-IF
  END-IF
END-FOR
ER-INDEX := -1
CALLNAT "USR2006N" USR2006A
END-SUBROUTINE
END
