* >Natural Source Header 000000 /*<RO>>
* :NatName XXERUS2C
* :UID INTECO
* :Mode S
* :CP
* :Date 20060501
* :Time 1229000
* <Natural Source Header /*<<RO>
/*
 XXERX00A.ERROR-MODULE := *PROGRAM;
 XXERX00A.RETURN-CODE := &1&
 XXERX00A.ERROR-ADDITION(1) := &2&
 ESCAPE ROUTINE
/*
