**C               *>Natural Source Header 000000
**C               *:NatName XXSTMN0L
**C               *:UID INTECO
**C               *:Mode S
**C               *:CP
**C               *:Date 20060603
**C               *:Time 1530000
**C               *<Natural Source Header
**DF   S      0002B   4 1STACK-READ
**HS0001
**I                      H'00000000'
**DF   S      0002B   4 1STACK-WRITE
**HS0001
**I                      H'00000001'
