* >Natural Source Header 000000 /*<RO>>
* :NatName XXXTAC0C
* :UID PAUL
* :Mode S
* :CP
* :Date 20070716
* :Time 2011000
* <Natural Source Header /*<<RO>
IF &1& NE &2& THEN
  MOVE &1& TO ERROR-ADDITION(1)
  MOVE &2& TO ERROR-ADDITION(2)
  *ERROR-NR := EC-QUIT-TEST-COMPARE-FAIL
END-IF
