* >Natural Source Header 000000 /*<RO>>
* :NatName XXXTNC0C
* :UID PAUL
* :Mode S
* :CP
* :Date 20070717
* :Time 0154000
* <Natural Source Header /*<<RO>
IF &1& NE &2& THEN
  MOVE EDITED &1& (EM=-ZZZZZZZZZZZZZZ9.9999999) TO ERROR-ADDITION(1)
  MOVE LEFT JUSTIFIED ERROR-ADDITION(1) TO ERROR-ADDITION(1)
  MOVE EDITED &2& (EM=-ZZZZZZZZZZZZZZ9.9999999) TO ERROR-ADDITION(2)
  MOVE LEFT JUSTIFIED ERROR-ADDITION(2) TO ERROR-ADDITION(2)
  *ERROR-NR := EC-QUIT-TEST-COMPARE-FAIL
END-IF
