* >Natural Source Header 000000 /*<RO>>
* :NatName XXXTDC0C
* :UID PAUL
* :Mode S
* :CP
* :Date 20070716
* :Time 2008000
* <Natural Source Header /*<<RO>
MOVE EDITED &1& (EM=YYYYMMDD) TO XXXTXC0L.DATE-A
IF XXXTXC0L.DATE-A NE &2& THEN
  MOVE XXXTXC0L.DATE-A TO ERROR-ADDITION(1)
  MOVE &2& TO ERROR-ADDITION(2)
  *ERROR-NR := EC-QUIT-TEST-COMPARE-FAIL
END-IF
